[NoCoverage] BlockStatement
src/domains/attention/attention-domain.ts:5:45
 import { nowISO } from "../../shared/time.js";
 import type { GraphFinding, NoesisState } from "../../schema.js";
 
-function transientAttention(s: NoesisState) {
-  return s.attention;
-}
+function transientAttention(s: NoesisState) {}
 
 export function setFocus(s: NoesisState, focus: string): void {

[NoCoverage] BlockStatement
src/domains/attention/attention-domain.ts:9:63
   return s.attention;
 }
 
-export function setFocus(s: NoesisState, focus: string): void {
-  s.attention.focus = truncate(focus, 200);
-  s.attention.updatedAt = nowISO();
-}
+export function setFocus(s: NoesisState, focus: string): void {}
 
 export function setGraphQueries(s: NoesisState, queries: string[]): void {

[NoCoverage] BlockStatement
src/domains/attention/attention-domain.ts:14:74
   s.attention.updatedAt = nowISO();
 }
 
-export function setGraphQueries(s: NoesisState, queries: string[]): void {
-  s.attention.graphQueries = queries.slice(0, 5).map((q) => truncate(q, 200));
-}
+export function setGraphQueries(s: NoesisState, queries: string[]): void {}
 
 export function setFiles(s: NoesisState, files: string[]): void {

[NoCoverage] ArrowFunction
src/domains/attention/attention-domain.ts:15:54
 }
 
 export function setGraphQueries(s: NoesisState, queries: string[]): void {
-  s.attention.graphQueries = queries.slice(0, 5).map((q) => truncate(q, 200));
+  s.attention.graphQueries = queries.slice(0, 5).map(() => undefined);
 }
 

[NoCoverage] MethodExpression
src/domains/attention/attention-domain.ts:15:30
 }
 
 export function setGraphQueries(s: NoesisState, queries: string[]): void {
-  s.attention.graphQueries = queries.slice(0, 5).map((q) => truncate(q, 200));
+  s.attention.graphQueries = queries.map((q) => truncate(q, 200));
 }
 

[NoCoverage] BlockStatement
src/domains/attention/attention-domain.ts:18:65
   s.attention.graphQueries = queries.slice(0, 5).map((q) => truncate(q, 200));
 }
 
-export function setFiles(s: NoesisState, files: string[]): void {
-  s.attention.files = files.slice(0, 10);
-}
+export function setFiles(s: NoesisState, files: string[]): void {}
 
 export function storeGraphFindings(s: NoesisState, findings: GraphFinding[]): void {

[NoCoverage] MethodExpression
src/domains/attention/attention-domain.ts:19:23
 }
 
 export function setFiles(s: NoesisState, files: string[]): void {
-  s.attention.files = files.slice(0, 10);
+  s.attention.files = files;
 }
 

[NoCoverage] BlockStatement
src/domains/attention/attention-domain.ts:22:84
   s.attention.files = files.slice(0, 10);
 }
 
-export function storeGraphFindings(s: NoesisState, findings: GraphFinding[]): void {
-  transientAttention(s).graphFindings = findings;
-}
+export function storeGraphFindings(s: NoesisState, findings: GraphFinding[]): void {}
 
 export function clearGraphFindings(s: NoesisState): void {

[NoCoverage] BlockStatement
src/domains/attention/attention-domain.ts:26:58
   transientAttention(s).graphFindings = findings;
 }
 
-export function clearGraphFindings(s: NoesisState): void {
-  delete transientAttention(s).graphFindings;
-}
+export function clearGraphFindings(s: NoesisState): void {}
 
