[Killed] BlockStatement
src/domains/belief/belief-domain.ts:19:54
 export function addFact(
   state: NoesisState,
   params: NoesisBelieveFactParams,
-): { created: BeliefFact; superseded: BeliefFact[] } {
-  const fact: BeliefFact = {
-    id: generateId("bf"),
-    content: params.content,
-    confidence: params.confidence,
-    source: params.source,
-    createdAt: nowISO(),
-    updatedAt: nowISO(),
-    status: "active",
-    tags: params.tags,
-    communityScope: params.communityScope,
-  };
-
-  const superseded = reviseFact(state, fact, params.contradictsIds ?? []);
-  return { created: fact, superseded };
-}
+): { created: BeliefFact; superseded: BeliefFact[] } {}
 
 export function addDecision(
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: Cannot read properties of undefined (reading 'created')

[Killed] ObjectLiteral
src/domains/belief/belief-domain.ts:20:28
   state: NoesisState,
   params: NoesisBelieveFactParams,
 ): { created: BeliefFact; superseded: BeliefFact[] } {
-  const fact: BeliefFact = {
-    id: generateId("bf"),
-    content: params.content,
-    confidence: params.confidence,
-    source: params.source,
-    createdAt: nowISO(),
-    updatedAt: nowISO(),
-    status: "active",
-    tags: params.tags,
-    communityScope: params.communityScope,
-  };
+  const fact: BeliefFact = {};
 
   const superseded = reviseFact(state, fact, params.contradictsIds ?? []);
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected undefined to be 'API uses GraphQL' // Object.is equality

[Survived] StringLiteral
src/domains/belief/belief-domain.ts:21:20
   params: NoesisBelieveFactParams,
 ): { created: BeliefFact; superseded: BeliefFact[] } {
   const fact: BeliefFact = {
-    id: generateId("bf"),
+    id: generateId(""),
     content: params.content,
     confidence: params.confidence,

[Killed] LogicalOperator
src/domains/belief/belief-domain.ts:32:46
     communityScope: params.communityScope,
   };
 
-  const superseded = reviseFact(state, fact, params.contradictsIds ?? []);
+  const superseded = reviseFact(state, fact, params.contradictsIds && []);
   return { created: fact, superseded };
 }
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: contradictsIds is not iterable

[Killed] ObjectLiteral
src/domains/belief/belief-domain.ts:33:10
   };
 
   const superseded = reviseFact(state, fact, params.contradictsIds ?? []);
-  return { created: fact, superseded };
+  return {};
 }
 
killedBy: Belief Revision Properties K*6 Equivalence across 100 random dedup sequences
statusReason: Cannot read properties of undefined (reading 'status')

[NoCoverage] BlockStatement
src/domains/belief/belief-domain.ts:39:62
 export function addDecision(
   state: NoesisState,
   params: NoesisBelieveDecisionParams,
-): { created: BeliefDecision; superseded: BeliefDecision[] } {
-  const decision: BeliefDecision = {
-    id: generateId("bd"),
-    content: params.content,
-    rationale: params.rationale,
-    alternatives: params.alternatives,
-    source: "execution",
-    createdAt: nowISO(),
-    updatedAt: nowISO(),
-    status: "active",
-    tags: params.tags,
-  };
-
-  const superseded = reviseDecision(
-    state,
-    decision,
-    params.contradictsIds ?? [],
-  );
-  return { created: decision, superseded };
-}
+): { created: BeliefDecision; superseded: BeliefDecision[] } {}
 
 export function resolveLearning(

[NoCoverage] LogicalOperator
src/domains/belief/belief-domain.ts:55:5
   const superseded = reviseDecision(
     state,
     decision,
-    params.contradictsIds ?? [],
+    params.contradictsIds && [],
   );
   return { created: decision, superseded };

[NoCoverage] BlockStatement
src/domains/belief/belief-domain.ts:65:25
   learningId: string,
   rootCause: string,
   fix: string,
-): LearningEntry | null {
-  let entry: LearningEntry | undefined = state.learning.failures.find(
-    (e) => e.id === learningId,
-  );
-  if (!entry) {
-    entry = state.learning.successes.find((e) => e.id === learningId);
-  }
-  if (!entry) return null;
-
-  const wasUnresolved =
-    entry.rootCause === undefined && entry.fix === undefined;
-  entry.rootCause = rootCause;
-  entry.fix = fix;
-  if (wasUnresolved) {
-    state.learning.summary.resolvedCount++;
-  }
-  return entry;
-}
+): LearningEntry | null {}
 
 export function getActiveFacts(

[NoCoverage] EqualityOperator
src/domains/belief/belief-domain.ts:67:12
   fix: string,
 ): LearningEntry | null {
   let entry: LearningEntry | undefined = state.learning.failures.find(
-    (e) => e.id === learningId,
+    (e) => e.id !== learningId,
   );
   if (!entry) {

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:67:12
   fix: string,
 ): LearningEntry | null {
   let entry: LearningEntry | undefined = state.learning.failures.find(
-    (e) => e.id === learningId,
+    (e) => false,
   );
   if (!entry) {

[NoCoverage] BooleanLiteral
src/domains/belief/belief-domain.ts:69:7
   let entry: LearningEntry | undefined = state.learning.failures.find(
     (e) => e.id === learningId,
   );
-  if (!entry) {
+  if (entry) {
     entry = state.learning.successes.find((e) => e.id === learningId);
   }

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:69:7
   let entry: LearningEntry | undefined = state.learning.failures.find(
     (e) => e.id === learningId,
   );
-  if (!entry) {
+  if (false) {
     entry = state.learning.successes.find((e) => e.id === learningId);
   }

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:70:50
     (e) => e.id === learningId,
   );
   if (!entry) {
-    entry = state.learning.successes.find((e) => e.id === learningId);
+    entry = state.learning.successes.find((e) => false);
   }
   if (!entry) return null;

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:70:50
     (e) => e.id === learningId,
   );
   if (!entry) {
-    entry = state.learning.successes.find((e) => e.id === learningId);
+    entry = state.learning.successes.find((e) => true);
   }
   if (!entry) return null;

[NoCoverage] BooleanLiteral
src/domains/belief/belief-domain.ts:72:7
   if (!entry) {
     entry = state.learning.successes.find((e) => e.id === learningId);
   }
-  if (!entry) return null;
+  if (entry) return null;
 
   const wasUnresolved =

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:72:7
   if (!entry) {
     entry = state.learning.successes.find((e) => e.id === learningId);
   }
-  if (!entry) return null;
+  if (true) return null;
 
   const wasUnresolved =

[NoCoverage] EqualityOperator
src/domains/belief/belief-domain.ts:75:5
   if (!entry) return null;
 
   const wasUnresolved =
-    entry.rootCause === undefined && entry.fix === undefined;
+    entry.rootCause !== undefined && entry.fix === undefined;
   entry.rootCause = rootCause;
   entry.fix = fix;

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:75:5
   if (!entry) return null;
 
   const wasUnresolved =
-    entry.rootCause === undefined && entry.fix === undefined;
+    false;
   entry.rootCause = rootCause;
   entry.fix = fix;

[NoCoverage] BlockStatement
src/domains/belief/belief-domain.ts:78:22
     entry.rootCause === undefined && entry.fix === undefined;
   entry.rootCause = rootCause;
   entry.fix = fix;
-  if (wasUnresolved) {
-    state.learning.summary.resolvedCount++;
-  }
+  if (wasUnresolved) {}
   return entry;
 }

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:78:7
     entry.rootCause === undefined && entry.fix === undefined;
   entry.rootCause = rootCause;
   entry.fix = fix;
-  if (wasUnresolved) {
+  if (true) {
     state.learning.summary.resolvedCount++;
   }

[NoCoverage] UpdateOperator
src/domains/belief/belief-domain.ts:79:5
   entry.rootCause = rootCause;
   entry.fix = fix;
   if (wasUnresolved) {
-    state.learning.summary.resolvedCount++;
+    state.learning.summary.resolvedCount--;
   }
   return entry;

[NoCoverage] BlockStatement
src/domains/belief/belief-domain.ts:87:17
 export function getActiveFacts(
   state: NoesisState,
   minConfidence?: number,
-): BeliefFact[] {
-  return state.belief.facts.filter((f) => {
-    if (f.status !== "active") return false;
-    if (minConfidence !== undefined && f.confidence < minConfidence)
-      return false;
-    return true;
-  });
-}
+): BeliefFact[] {}
 
 export function getActiveDecisions(

[NoCoverage] BlockStatement
src/domains/belief/belief-domain.ts:88:43
   state: NoesisState,
   minConfidence?: number,
 ): BeliefFact[] {
-  return state.belief.facts.filter((f) => {
-    if (f.status !== "active") return false;
-    if (minConfidence !== undefined && f.confidence < minConfidence)
-      return false;
-    return true;
-  });
+  return state.belief.facts.filter((f) => {});
 }
 

[NoCoverage] MethodExpression
src/domains/belief/belief-domain.ts:88:10
   state: NoesisState,
   minConfidence?: number,
 ): BeliefFact[] {
-  return state.belief.facts.filter((f) => {
-    if (f.status !== "active") return false;
-    if (minConfidence !== undefined && f.confidence < minConfidence)
-      return false;
-    return true;
-  });
+  return state.belief.facts;
 }
 

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:89:9
   minConfidence?: number,
 ): BeliefFact[] {
   return state.belief.facts.filter((f) => {
-    if (f.status !== "active") return false;
+    if (false) return false;
     if (minConfidence !== undefined && f.confidence < minConfidence)
       return false;

[NoCoverage] EqualityOperator
src/domains/belief/belief-domain.ts:89:9
   minConfidence?: number,
 ): BeliefFact[] {
   return state.belief.facts.filter((f) => {
-    if (f.status !== "active") return false;
+    if (f.status === "active") return false;
     if (minConfidence !== undefined && f.confidence < minConfidence)
       return false;

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:90:9
 ): BeliefFact[] {
   return state.belief.facts.filter((f) => {
     if (f.status !== "active") return false;
-    if (minConfidence !== undefined && f.confidence < minConfidence)
+    if (true)
       return false;
     return true;

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:90:9
 ): BeliefFact[] {
   return state.belief.facts.filter((f) => {
     if (f.status !== "active") return false;
-    if (minConfidence !== undefined && f.confidence < minConfidence)
+    if (true && f.confidence < minConfidence)
       return false;
     return true;

[NoCoverage] BooleanLiteral
src/domains/belief/belief-domain.ts:91:14
   return state.belief.facts.filter((f) => {
     if (f.status !== "active") return false;
     if (minConfidence !== undefined && f.confidence < minConfidence)
-      return false;
+      return true;
     return true;
   });

[NoCoverage] BlockStatement
src/domains/belief/belief-domain.ts:98:21
 
 export function getActiveDecisions(
   state: NoesisState,
-): BeliefDecision[] {
-  return state.belief.decisions.filter((d) => d.status === "active");
-}
+): BeliefDecision[] {}
 
 export function computeStaleReviewNotes(

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:99:47
 export function getActiveDecisions(
   state: NoesisState,
 ): BeliefDecision[] {
-  return state.belief.decisions.filter((d) => d.status === "active");
+  return state.belief.decisions.filter((d) => true);
 }
 

[NoCoverage] ArrowFunction
src/domains/belief/belief-domain.ts:99:40
 export function getActiveDecisions(
   state: NoesisState,
 ): BeliefDecision[] {
-  return state.belief.decisions.filter((d) => d.status === "active");
+  return state.belief.decisions.filter(() => undefined);
 }
 

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:107:7
   capability: CapabilityLevel,
   lastGraphRefresh?: string,
 ): StaleReviewNote[] {
-  if (capability === "FULL") return [];
+  if (true) return [];
   if (!lastGraphRefresh) return [];
 

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:107:7
   capability: CapabilityLevel,
   lastGraphRefresh?: string,
 ): StaleReviewNote[] {
-  if (capability === "FULL") return [];
+  if (false) return [];
   if (!lastGraphRefresh) return [];
 

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:108:7
   lastGraphRefresh?: string,
 ): StaleReviewNote[] {
   if (capability === "FULL") return [];
-  if (!lastGraphRefresh) return [];
+  if (true) return [];
 
   const notes: StaleReviewNote[] = [];

[NoCoverage] BooleanLiteral
src/domains/belief/belief-domain.ts:108:7
   lastGraphRefresh?: string,
 ): StaleReviewNote[] {
   if (capability === "FULL") return [];
-  if (!lastGraphRefresh) return [];
+  if (lastGraphRefresh) return [];
 
   const notes: StaleReviewNote[] = [];

[NoCoverage] BlockStatement
src/domains/belief/belief-domain.ts:112:42
 
   const notes: StaleReviewNote[] = [];
 
-  for (const fact of state.belief.facts) {
-    if (
-      fact.status === "active" &&
-      fact.source === "graph" &&
-      fact.createdAt < lastGraphRefresh
-    ) {
-      const adjustedConfidence = applyStalePenalty(fact.confidence);
-      const preview =
-        fact.content.length > 80
-          ? fact.content.slice(0, 80) + "..."
-          : fact.content;
-      notes.push({
-        beliefId: fact.id,
-        originalConfidence: fact.confidence,
-        adjustedConfidence,
-        message: `Belief "${preview}" is stale (created ${fact.createdAt}, last refresh ${lastGraphRefresh}). Confidence adjusted from ${fact.confidence} to ${adjustedConfidence}.`,
-      });
-    }
-  }
+  for (const fact of state.belief.facts) {}
 
   return notes;

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:114:7
 
   for (const fact of state.belief.facts) {
     if (
-      fact.status === "active" &&
-      fact.source === "graph" &&
-      fact.createdAt < lastGraphRefresh
+      true
     ) {
       const adjustedConfidence = applyStalePenalty(fact.confidence);

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:114:7
 
   for (const fact of state.belief.facts) {
     if (
-      fact.status === "active" &&
-      fact.source === "graph" &&
+      true &&
       fact.createdAt < lastGraphRefresh
     ) {

[NoCoverage] EqualityOperator
src/domains/belief/belief-domain.ts:115:7
   for (const fact of state.belief.facts) {
     if (
       fact.status === "active" &&
-      fact.source === "graph" &&
+      fact.source !== "graph" &&
       fact.createdAt < lastGraphRefresh
     ) {

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:115:7
   for (const fact of state.belief.facts) {
     if (
       fact.status === "active" &&
-      fact.source === "graph" &&
+      true &&
       fact.createdAt < lastGraphRefresh
     ) {

[NoCoverage] EqualityOperator
src/domains/belief/belief-domain.ts:116:7
     if (
       fact.status === "active" &&
       fact.source === "graph" &&
-      fact.createdAt < lastGraphRefresh
+      fact.createdAt >= lastGraphRefresh
     ) {
       const adjustedConfidence = applyStalePenalty(fact.confidence);

[NoCoverage] EqualityOperator
src/domains/belief/belief-domain.ts:116:7
     if (
       fact.status === "active" &&
       fact.source === "graph" &&
-      fact.createdAt < lastGraphRefresh
+      fact.createdAt <= lastGraphRefresh
     ) {
       const adjustedConfidence = applyStalePenalty(fact.confidence);

[NoCoverage] BlockStatement
src/domains/belief/belief-domain.ts:117:7
       fact.status === "active" &&
       fact.source === "graph" &&
       fact.createdAt < lastGraphRefresh
-    ) {
-      const adjustedConfidence = applyStalePenalty(fact.confidence);
-      const preview =
-        fact.content.length > 80
-          ? fact.content.slice(0, 80) + "..."
-          : fact.content;
-      notes.push({
-        beliefId: fact.id,
-        originalConfidence: fact.confidence,
-        adjustedConfidence,
-        message: `Belief "${preview}" is stale (created ${fact.createdAt}, last refresh ${lastGraphRefresh}). Confidence adjusted from ${fact.confidence} to ${adjustedConfidence}.`,
-      });
-    }
+    ) {}
   }
 

[NoCoverage] ConditionalExpression
src/domains/belief/belief-domain.ts:120:9
     ) {
       const adjustedConfidence = applyStalePenalty(fact.confidence);
       const preview =
-        fact.content.length > 80
+        false
           ? fact.content.slice(0, 80) + "..."
           : fact.content;

[NoCoverage] EqualityOperator
src/domains/belief/belief-domain.ts:120:9
     ) {
       const adjustedConfidence = applyStalePenalty(fact.confidence);
       const preview =
-        fact.content.length > 80
+        fact.content.length <= 80
           ? fact.content.slice(0, 80) + "..."
           : fact.content;

[NoCoverage] MethodExpression
src/domains/belief/belief-domain.ts:121:13
       const adjustedConfidence = applyStalePenalty(fact.confidence);
       const preview =
         fact.content.length > 80
-          ? fact.content.slice(0, 80) + "..."
+          ? fact.content + "..."
           : fact.content;
       notes.push({

[NoCoverage] ObjectLiteral
src/domains/belief/belief-domain.ts:123:18
         fact.content.length > 80
           ? fact.content.slice(0, 80) + "..."
           : fact.content;
-      notes.push({
-        beliefId: fact.id,
-        originalConfidence: fact.confidence,
-        adjustedConfidence,
-        message: `Belief "${preview}" is stale (created ${fact.createdAt}, last refresh ${lastGraphRefresh}). Confidence adjusted from ${fact.confidence} to ${adjustedConfidence}.`,
-      });
+      notes.push({});
     }
   }
