[Killed] ArrayDeclaration
src/domains/belief/confidence-strategy.ts:3:41
 import type { BeliefFact } from "../../schema.js";
 
-const STALE_TIERS: [number, number][] = [
-  [1.0, 1.0],
-  [0.95, 0.85],
-  [0.85, 0.75],
-  [0.75, 0.65],
-  [0.65, 0.55],
-  [0.55, 0.55],
-];
+const STALE_TIERS: [number, number][] = [];
 
 export function translateGraphConfidence(
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.8216051537698412 to be greater than or equal to 0.8216051554222804

[Survived] ArrayDeclaration
src/domains/belief/confidence-strategy.ts:8:3
   [0.95, 0.85],
   [0.85, 0.75],
   [0.75, 0.65],
-  [0.65, 0.55],
+  [],
   [0.55, 0.55],
 ];

[Survived] ArrayDeclaration
src/domains/belief/confidence-strategy.ts:9:3
   [0.85, 0.75],
   [0.75, 0.65],
   [0.65, 0.55],
-  [0.55, 0.55],
+  [],
 ];
 

[NoCoverage] BlockStatement
src/domains/belief/confidence-strategy.ts:15:18
 export function translateGraphConfidence(
   label: string,
   inferredValue?: number,
-): number | null {
-  switch (label) {
-    case "EXTRACTED":
-      return 1.0;
-    case "INFERRED":
-      if (
-        inferredValue === 0.55 ||
-        inferredValue === 0.65 ||
-        inferredValue === 0.75 ||
-        inferredValue === 0.85 ||
-        inferredValue === 0.95
-      ) {
-        return inferredValue;
-      }
-      return null;
-    case "AMBIGUOUS":
-      return null;
-    default:
-      return null;
-  }
-}
+): number | null {}
 
 export function applyStalePenalty(confidence: number): number {

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:17:5
   inferredValue?: number,
 ): number | null {
   switch (label) {
-    case "EXTRACTED":
-      return 1.0;
+    case "EXTRACTED":
     case "INFERRED":
       if (

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:19:5
   switch (label) {
     case "EXTRACTED":
       return 1.0;
-    case "INFERRED":
-      if (
-        inferredValue === 0.55 ||
-        inferredValue === 0.65 ||
-        inferredValue === 0.75 ||
-        inferredValue === 0.85 ||
-        inferredValue === 0.95
-      ) {
-        return inferredValue;
-      }
-      return null;
+    case "INFERRED":
     case "AMBIGUOUS":
       return null;

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:21:9
       return 1.0;
     case "INFERRED":
       if (
-        inferredValue === 0.55 ||
-        inferredValue === 0.65 ||
-        inferredValue === 0.75 ||
-        inferredValue === 0.85 ||
-        inferredValue === 0.95
+        false
       ) {
         return inferredValue;

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:21:9
       return 1.0;
     case "INFERRED":
       if (
-        inferredValue === 0.55 ||
-        inferredValue === 0.65 ||
-        inferredValue === 0.75 ||
-        inferredValue === 0.85 ||
+        false ||
         inferredValue === 0.95
       ) {

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:22:9
     case "INFERRED":
       if (
         inferredValue === 0.55 ||
-        inferredValue === 0.65 ||
+        false ||
         inferredValue === 0.75 ||
         inferredValue === 0.85 ||

[NoCoverage] EqualityOperator
src/domains/belief/confidence-strategy.ts:22:9
     case "INFERRED":
       if (
         inferredValue === 0.55 ||
-        inferredValue === 0.65 ||
+        inferredValue !== 0.65 ||
         inferredValue === 0.75 ||
         inferredValue === 0.85 ||

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:23:9
       if (
         inferredValue === 0.55 ||
         inferredValue === 0.65 ||
-        inferredValue === 0.75 ||
+        false ||
         inferredValue === 0.85 ||
         inferredValue === 0.95

[NoCoverage] EqualityOperator
src/domains/belief/confidence-strategy.ts:23:9
       if (
         inferredValue === 0.55 ||
         inferredValue === 0.65 ||
-        inferredValue === 0.75 ||
+        inferredValue !== 0.75 ||
         inferredValue === 0.85 ||
         inferredValue === 0.95

[NoCoverage] EqualityOperator
src/domains/belief/confidence-strategy.ts:24:9
         inferredValue === 0.55 ||
         inferredValue === 0.65 ||
         inferredValue === 0.75 ||
-        inferredValue === 0.85 ||
+        inferredValue !== 0.85 ||
         inferredValue === 0.95
       ) {

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:24:9
         inferredValue === 0.55 ||
         inferredValue === 0.65 ||
         inferredValue === 0.75 ||
-        inferredValue === 0.85 ||
+        false ||
         inferredValue === 0.95
       ) {

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:25:9
         inferredValue === 0.65 ||
         inferredValue === 0.75 ||
         inferredValue === 0.85 ||
-        inferredValue === 0.95
+        false
       ) {
         return inferredValue;

[NoCoverage] EqualityOperator
src/domains/belief/confidence-strategy.ts:25:9
         inferredValue === 0.65 ||
         inferredValue === 0.75 ||
         inferredValue === 0.85 ||
-        inferredValue === 0.95
+        inferredValue !== 0.95
       ) {
         return inferredValue;

[NoCoverage] BlockStatement
src/domains/belief/confidence-strategy.ts:26:9
         inferredValue === 0.75 ||
         inferredValue === 0.85 ||
         inferredValue === 0.95
-      ) {
-        return inferredValue;
-      }
+      ) {}
       return null;
     case "AMBIGUOUS":

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:30:5
         return inferredValue;
       }
       return null;
-    case "AMBIGUOUS":
-      return null;
+    case "AMBIGUOUS":
     default:
       return null;

[NoCoverage] StringLiteral
src/domains/belief/confidence-strategy.ts:30:10
         return inferredValue;
       }
       return null;
-    case "AMBIGUOUS":
+    case "":
       return null;
     default:

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:32:5
       return null;
     case "AMBIGUOUS":
       return null;
-    default:
-      return null;
+    default:
   }
 }

[NoCoverage] BlockStatement
src/domains/belief/confidence-strategy.ts:37:63
   }
 }
 
-export function applyStalePenalty(confidence: number): number {
-  for (const [tierInput, tierOutput] of STALE_TIERS) {
-    if (confidence >= tierInput) {
-      return tierOutput;
-    }
-  }
-  return 0.55;
-}
+export function applyStalePenalty(confidence: number): number {}
 
 export function isPreambleEligible(fact: BeliefFact): boolean {

[NoCoverage] BlockStatement
src/domains/belief/confidence-strategy.ts:38:54
 }
 
 export function applyStalePenalty(confidence: number): number {
-  for (const [tierInput, tierOutput] of STALE_TIERS) {
-    if (confidence >= tierInput) {
-      return tierOutput;
-    }
-  }
+  for (const [tierInput, tierOutput] of STALE_TIERS) {}
   return 0.55;
 }

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:39:9
 
 export function applyStalePenalty(confidence: number): number {
   for (const [tierInput, tierOutput] of STALE_TIERS) {
-    if (confidence >= tierInput) {
+    if (true) {
       return tierOutput;
     }

[NoCoverage] EqualityOperator
src/domains/belief/confidence-strategy.ts:39:9
 
 export function applyStalePenalty(confidence: number): number {
   for (const [tierInput, tierOutput] of STALE_TIERS) {
-    if (confidence >= tierInput) {
+    if (confidence > tierInput) {
       return tierOutput;
     }

[NoCoverage] BlockStatement
src/domains/belief/confidence-strategy.ts:46:63
   return 0.55;
 }
 
-export function isPreambleEligible(fact: BeliefFact): boolean {
-  return fact.confidence >= 0.75 && fact.status === "active";
-}
+export function isPreambleEligible(fact: BeliefFact): boolean {}
 

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:47:10
 }
 
 export function isPreambleEligible(fact: BeliefFact): boolean {
-  return fact.confidence >= 0.75 && fact.status === "active";
+  return true;
 }
 

[NoCoverage] ConditionalExpression
src/domains/belief/confidence-strategy.ts:47:10
 }
 
 export function isPreambleEligible(fact: BeliefFact): boolean {
-  return fact.confidence >= 0.75 && fact.status === "active";
+  return true && fact.status === "active";
 }
 
