[Killed] BlockStatement
src/domains/belief/revision-strategy.ts:12:81
   prefix: "bf" | "bd";
 };
 
-function tagsOverlap(a: string[] | undefined, b: string[] | undefined): boolean {
-  if (!a || !b || a.length === 0 || b.length === 0) return false;
-  return a.some((tag) => b.includes(tag));
-}
+function tagsOverlap(a: string[] | undefined, b: string[] | undefined): boolean {}
 
 function walkToActiveHead<T extends Revisable>(items: T[], id: string, maxDepth = 100): T | null {
killedBy: Belief Revision Properties K*6 Equivalence across 100 random dedup sequences
statusReason: Duplicate add for "duplicate-content-0" should not create a new belief (iteration 0): expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/domains/belief/revision-strategy.ts:13:7
 };
 
 function tagsOverlap(a: string[] | undefined, b: string[] | undefined): boolean {
-  if (!a || !b || a.length === 0 || b.length === 0) return false;
+  if (a || !b || a.length === 0 || b.length === 0) return false;
   return a.some((tag) => b.includes(tag));
 }
killedBy: Belief Revision Properties K*6 Equivalence across 100 random dedup sequences
statusReason: Duplicate add for "duplicate-content-0" should not create a new belief (iteration 0): expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/domains/belief/revision-strategy.ts:13:13
 };
 
 function tagsOverlap(a: string[] | undefined, b: string[] | undefined): boolean {
-  if (!a || !b || a.length === 0 || b.length === 0) return false;
+  if (!a || b || a.length === 0 || b.length === 0) return false;
   return a.some((tag) => b.includes(tag));
 }
killedBy: Belief Revision Properties K*6 Equivalence across 100 random dedup sequences
statusReason: Duplicate add for "duplicate-content-0" should not create a new belief (iteration 0): expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
src/domains/belief/revision-strategy.ts:14:17
 
 function tagsOverlap(a: string[] | undefined, b: string[] | undefined): boolean {
   if (!a || !b || a.length === 0 || b.length === 0) return false;
-  return a.some((tag) => b.includes(tag));
+  return a.some(() => undefined);
 }
 
killedBy: Belief Revision Properties K*6 Equivalence across 100 random dedup sequences
statusReason: Duplicate add for "duplicate-content-0" should not create a new belief (iteration 0): expected 2 to be 1 // Object.is equality

[Survived] MethodExpression
src/domains/belief/revision-strategy.ts:14:10
 
 function tagsOverlap(a: string[] | undefined, b: string[] | undefined): boolean {
   if (!a || !b || a.length === 0 || b.length === 0) return false;
-  return a.some((tag) => b.includes(tag));
+  return a.every(tag => b.includes(tag));
 }
 

[Killed] BlockStatement
src/domains/belief/revision-strategy.ts:17:98
   return a.some((tag) => b.includes(tag));
 }
 
-function walkToActiveHead<T extends Revisable>(items: T[], id: string, maxDepth = 100): T | null {
-  const visited = new Set<string>();
-  let current = items.find((item) => item.id === id);
-  let depth = 0;
-
-  while (current && depth < maxDepth) {
-    if (visited.has(current.id)) return null; // cycle detected
-    visited.add(current.id);
-
-    if (current.status === "active") return current;
-    if (!current.supersededBy) return null;
-
-    const nextId = current.supersededBy;
-    const next = items.find((item) => item.id === nextId);
-    if (!next) return null;
-    current = next;
-    depth++;
-  }
-
-  return null;
-}
+function walkToActiveHead<T extends Revisable>(items: T[], id: string, maxDepth = 100): T | null {}
 
 function revise<T extends Revisable & { createdAt: string; updatedAt: string }>(
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[Killed] ConditionalExpression
src/domains/belief/revision-strategy.ts:19:38
 
 function walkToActiveHead<T extends Revisable>(items: T[], id: string, maxDepth = 100): T | null {
   const visited = new Set<string>();
-  let current = items.find((item) => item.id === id);
+  let current = items.find((item) => false);
   let depth = 0;
 
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[Killed] ArrowFunction
src/domains/belief/revision-strategy.ts:19:28
 
 function walkToActiveHead<T extends Revisable>(items: T[], id: string, maxDepth = 100): T | null {
   const visited = new Set<string>();
-  let current = items.find((item) => item.id === id);
+  let current = items.find(() => undefined);
   let depth = 0;
 
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[Killed] EqualityOperator
src/domains/belief/revision-strategy.ts:22:21
   let current = items.find((item) => item.id === id);
   let depth = 0;
 
-  while (current && depth < maxDepth) {
+  while (current && depth >= maxDepth) {
     if (visited.has(current.id)) return null; // cycle detected
     visited.add(current.id);
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[Killed] ConditionalExpression
src/domains/belief/revision-strategy.ts:22:10
   let current = items.find((item) => item.id === id);
   let depth = 0;
 
-  while (current && depth < maxDepth) {
+  while (false) {
     if (visited.has(current.id)) return null; // cycle detected
     visited.add(current.id);
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[Killed] ConditionalExpression
src/domains/belief/revision-strategy.ts:23:9
   let depth = 0;
 
   while (current && depth < maxDepth) {
-    if (visited.has(current.id)) return null; // cycle detected
+    if (true) return null; // cycle detected
     visited.add(current.id);
 
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[Survived] ConditionalExpression
src/domains/belief/revision-strategy.ts:23:9
   let depth = 0;
 
   while (current && depth < maxDepth) {
-    if (visited.has(current.id)) return null; // cycle detected
+    if (false) return null; // cycle detected
     visited.add(current.id);
 

[Killed] ConditionalExpression
src/domains/belief/revision-strategy.ts:26:9
     if (visited.has(current.id)) return null; // cycle detected
     visited.add(current.id);
 
-    if (current.status === "active") return current;
+    if (false) return current;
     if (!current.supersededBy) return null;
 
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[Killed] EqualityOperator
src/domains/belief/revision-strategy.ts:26:9
     if (visited.has(current.id)) return null; // cycle detected
     visited.add(current.id);
 
-    if (current.status === "active") return current;
+    if (current.status !== "active") return current;
     if (!current.supersededBy) return null;
 
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[NoCoverage] BooleanLiteral
src/domains/belief/revision-strategy.ts:27:9
     visited.add(current.id);
 
     if (current.status === "active") return current;
-    if (!current.supersededBy) return null;
+    if (current.supersededBy) return null;
 
     const nextId = current.supersededBy;

[NoCoverage] ConditionalExpression
src/domains/belief/revision-strategy.ts:27:9
     visited.add(current.id);
 
     if (current.status === "active") return current;
-    if (!current.supersededBy) return null;
+    if (false) return null;
 
     const nextId = current.supersededBy;

[NoCoverage] ArrowFunction
src/domains/belief/revision-strategy.ts:30:29
     if (!current.supersededBy) return null;
 
     const nextId = current.supersededBy;
-    const next = items.find((item) => item.id === nextId);
+    const next = items.find(() => undefined);
     if (!next) return null;
     current = next;

[NoCoverage] ConditionalExpression
src/domains/belief/revision-strategy.ts:30:39
     if (!current.supersededBy) return null;
 
     const nextId = current.supersededBy;
-    const next = items.find((item) => item.id === nextId);
+    const next = items.find((item) => true);
     if (!next) return null;
     current = next;

[NoCoverage] ConditionalExpression
src/domains/belief/revision-strategy.ts:31:9
 
     const nextId = current.supersededBy;
     const next = items.find((item) => item.id === nextId);
-    if (!next) return null;
+    if (true) return null;
     current = next;
     depth++;

[NoCoverage] ConditionalExpression
src/domains/belief/revision-strategy.ts:31:9
 
     const nextId = current.supersededBy;
     const next = items.find((item) => item.id === nextId);
-    if (!next) return null;
+    if (false) return null;
     current = next;
     depth++;

[NoCoverage] UpdateOperator
src/domains/belief/revision-strategy.ts:33:5
     const next = items.find((item) => item.id === nextId);
     if (!next) return null;
     current = next;
-    depth++;
+    depth--;
   }
 

[Killed] BlockStatement
src/domains/belief/revision-strategy.ts:44:8
   current: T,
   contradictsIds: string[],
   sameKindDuplicate: (item: T) => boolean,
-): T[] {
-  if (collection.items.some(sameKindDuplicate)) return [];
-
-  const superseded: T[] = [];
-  const nextId = generateId(collection.prefix);
-  const timestamp = nowISO();
-
-  current.id = nextId;
-  current.status = "active";
-  current.createdAt = timestamp;
-  current.updatedAt = timestamp;
-
-  for (const id of contradictsIds) {
-    const activeHead = walkToActiveHead(collection.items, id);
-    if (!activeHead) continue;
-    activeHead.status = "superseded";
-    activeHead.supersededBy = nextId;
-    activeHead.updatedAt = timestamp;
-    superseded.push(activeHead);
-  }
-
-  collection.items.push(current);
-  return superseded;
-}
+): T[] {}
 
 export function reviseFact(state: NoesisState, newFact: BeliefFact, contradictsIds: string[]): BeliefFact[] {
killedBy: Belief Revision Properties 100 revision chains always terminate at active
statusReason: Chain starting at bf-118d7d79-16bd-42c0-bba3-d379830e9c1f (iteration 0) must terminate at an active fact: expected null not to be null

[Killed] ConditionalExpression
src/domains/belief/revision-strategy.ts:45:7
   contradictsIds: string[],
   sameKindDuplicate: (item: T) => boolean,
 ): T[] {
-  if (collection.items.some(sameKindDuplicate)) return [];
+  if (true) return [];
 
   const superseded: T[] = [];
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected [] to have a length of 2 but got +0

[Killed] MethodExpression
src/domains/belief/revision-strategy.ts:45:7
   contradictsIds: string[],
   sameKindDuplicate: (item: T) => boolean,
 ): T[] {
-  if (collection.items.some(sameKindDuplicate)) return [];
+  if (collection.items.every(sameKindDuplicate)) return [];
 
   const superseded: T[] = [];
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected [] to have a length of 2 but got +0

[Killed] StringLiteral
src/domains/belief/revision-strategy.ts:52:20
   const timestamp = nowISO();
 
   current.id = nextId;
-  current.status = "active";
+  current.status = "";
   current.createdAt = timestamp;
   current.updatedAt = timestamp;
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected '' to be 'active' // Object.is equality

[Killed] BlockStatement
src/domains/belief/revision-strategy.ts:56:36
   current.createdAt = timestamp;
   current.updatedAt = timestamp;
 
-  for (const id of contradictsIds) {
-    const activeHead = walkToActiveHead(collection.items, id);
-    if (!activeHead) continue;
-    activeHead.status = "superseded";
-    activeHead.supersededBy = nextId;
-    activeHead.updatedAt = timestamp;
-    superseded.push(activeHead);
-  }
+  for (const id of contradictsIds) {}
 
   collection.items.push(current);
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[Killed] ConditionalExpression
src/domains/belief/revision-strategy.ts:58:9
 
   for (const id of contradictsIds) {
     const activeHead = walkToActiveHead(collection.items, id);
-    if (!activeHead) continue;
+    if (true) continue;
     activeHead.status = "superseded";
     activeHead.supersededBy = nextId;
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[Killed] BooleanLiteral
src/domains/belief/revision-strategy.ts:58:9
 
   for (const id of contradictsIds) {
     const activeHead = walkToActiveHead(collection.items, id);
-    if (!activeHead) continue;
+    if (activeHead) continue;
     activeHead.status = "superseded";
     activeHead.supersededBy = nextId;
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected 'active' to be 'superseded' // Object.is equality

[Killed] StringLiteral
src/domains/belief/revision-strategy.ts:59:25
   for (const id of contradictsIds) {
     const activeHead = walkToActiveHead(collection.items, id);
     if (!activeHead) continue;
-    activeHead.status = "superseded";
+    activeHead.status = "";
     activeHead.supersededBy = nextId;
     activeHead.updatedAt = timestamp;
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: expected '' to be 'superseded' // Object.is equality

[Killed] BlockStatement
src/domains/belief/revision-strategy.ts:69:109
   return superseded;
 }
 
-export function reviseFact(state: NoesisState, newFact: BeliefFact, contradictsIds: string[]): BeliefFact[] {
-  return revise(
-    { items: state.belief.facts, prefix: "bf" },
-    newFact,
-    contradictsIds,
-    (fact) => fact.status === "active" && fact.content === newFact.content && tagsOverlap(fact.tags, newFact.tags),
-  );
-}
+export function reviseFact(state: NoesisState, newFact: BeliefFact, contradictsIds: string[]): BeliefFact[] {}
 
 export function reviseDecision(state: NoesisState, newDecision: BeliefDecision, contradictsIds: string[]): BeliefDecision[] {
killedBy: Scenario D: Contradictory evidence believes REST → discovers GraphQL → old fact superseded, new active, chain intact
statusReason: Target cannot be null or undefined.

[Killed] EqualityOperator
src/domains/belief/revision-strategy.ts:74:15
     { items: state.belief.facts, prefix: "bf" },
     newFact,
     contradictsIds,
-    (fact) => fact.status === "active" && fact.content === newFact.content && tagsOverlap(fact.tags, newFact.tags),
+    (fact) => fact.status !== "active" && fact.content === newFact.content && tagsOverlap(fact.tags, newFact.tags),
   );
 }
killedBy: Belief Revision Properties K*6 Equivalence across 100 random dedup sequences
statusReason: Duplicate add for "duplicate-content-0" should not create a new belief (iteration 0): expected 2 to be 1 // Object.is equality

[Killed] EqualityOperator
src/domains/belief/revision-strategy.ts:74:43
     { items: state.belief.facts, prefix: "bf" },
     newFact,
     contradictsIds,
-    (fact) => fact.status === "active" && fact.content === newFact.content && tagsOverlap(fact.tags, newFact.tags),
+    (fact) => fact.status === "active" && fact.content !== newFact.content && tagsOverlap(fact.tags, newFact.tags),
   );
 }
killedBy: Belief Revision Properties K*6 Equivalence across 100 random dedup sequences
statusReason: Duplicate add for "duplicate-content-0" should not create a new belief (iteration 0): expected 2 to be 1 // Object.is equality

[NoCoverage] BlockStatement
src/domains/belief/revision-strategy.ts:78:125
   );
 }
 
-export function reviseDecision(state: NoesisState, newDecision: BeliefDecision, contradictsIds: string[]): BeliefDecision[] {
-  return revise(
-    { items: state.belief.decisions, prefix: "bd" },
-    newDecision,
-    contradictsIds,
-    (decision) => decision.status === "active" && decision.content === newDecision.content && tagsOverlap(decision.tags, newDecision.tags),
-  );
-}
+export function reviseDecision(state: NoesisState, newDecision: BeliefDecision, contradictsIds: string[]): BeliefDecision[] {}
 

[NoCoverage] EqualityOperator
src/domains/belief/revision-strategy.ts:83:51
     { items: state.belief.decisions, prefix: "bd" },
     newDecision,
     contradictsIds,
-    (decision) => decision.status === "active" && decision.content === newDecision.content && tagsOverlap(decision.tags, newDecision.tags),
+    (decision) => decision.status === "active" && decision.content !== newDecision.content && tagsOverlap(decision.tags, newDecision.tags),
   );
 }

[NoCoverage] ArrowFunction
src/domains/belief/revision-strategy.ts:83:5
     { items: state.belief.decisions, prefix: "bd" },
     newDecision,
     contradictsIds,
-    (decision) => decision.status === "active" && decision.content === newDecision.content && tagsOverlap(decision.tags, newDecision.tags),
+    () => undefined,
   );
 }
