[NoCoverage] BlockStatement
src/domains/commitment/commitment-domain.ts:12:57
   PlannedActionInput,
 } from "../../schema.js";
 
-function toStep(input: WorkflowStepInput): WorkflowStep {
-  return {
-    id: generateId("ws"),
-    description: input.description,
-    status: input.status ?? "pending",
-    dependsOn: input.dependsOn,
-    verification: input.verification,
-    createdAt: nowISO(),
-    updatedAt: nowISO(),
-  };
-}
+function toStep(input: WorkflowStepInput): WorkflowStep {}
 
 function toAction(input: PlannedActionInput) {

[NoCoverage] LogicalOperator
src/domains/commitment/commitment-domain.ts:16:13
   return {
     id: generateId("ws"),
     description: input.description,
-    status: input.status ?? "pending",
+    status: input.status && "pending",
     dependsOn: input.dependsOn,
     verification: input.verification,

[NoCoverage] BlockStatement
src/domains/commitment/commitment-domain.ts:24:46
   };
 }
 
-function toAction(input: PlannedActionInput) {
-  return {
-    id: generateId("pa"),
-    content: input.content,
-    createdAt: nowISO(),
-  };
-}
+function toAction(input: PlannedActionInput) {}
 
 export function extendWorkflow(

[NoCoverage] StringLiteral
src/domains/commitment/commitment-domain.ts:26:20
 
 function toAction(input: PlannedActionInput) {
   return {
-    id: generateId("pa"),
+    id: generateId(""),
     content: input.content,
     createdAt: nowISO(),

[NoCoverage] BlockStatement
src/domains/commitment/commitment-domain.ts:36:13
   state: NoesisState,
   steps: WorkflowStepInput[],
   actions: PlannedActionInput[],
-): Workflow {
-  const newSteps = steps.map(toStep);
-  const newActions = actions.map(toAction);
-
-  state.commitment.workflow.steps.push(...newSteps);
-  state.commitment.actions.push(...newActions);
-  state.commitment.workflow.updatedAt = nowISO();
-
-  return state.commitment.workflow;
-}
+): Workflow {}
 
 export function replaceWorkflow(

[NoCoverage] BlockStatement
src/domains/commitment/commitment-domain.ts:52:13
   goal: string,
   steps: WorkflowStepInput[],
   actions: PlannedActionInput[],
-): Workflow {
-  const newSteps = steps.map(toStep);
-  const newActions = actions.map(toAction);
-
-  state.commitment.workflow.goal = goal;
-  state.commitment.workflow.steps = newSteps;
-  state.commitment.actions = newActions;
-  state.commitment.workflow.updatedAt = nowISO();
-
-  return state.commitment.workflow;
-}
+): Workflow {}
 
 export function updateWorkflowStatus(

[NoCoverage] BlockStatement
src/domains/commitment/commitment-domain.ts:67:9
 export function updateWorkflowStatus(
   state: NoesisState,
   status: WorkflowStatus,
-): void {
-  state.commitment.workflow.status = status;
-  state.commitment.workflow.updatedAt = nowISO();
-}
+): void {}
 
 export function getCurrentStep(state: NoesisState): WorkflowStep | null {

[NoCoverage] BlockStatement
src/domains/commitment/commitment-domain.ts:72:73
   state.commitment.workflow.updatedAt = nowISO();
 }
 
-export function getCurrentStep(state: NoesisState): WorkflowStep | null {
-  const { steps } = state.commitment.workflow;
-
-  // First step with status "active"
-  const active = steps.find((s) => s.status === "active");
-  if (active) return active;
-
-  // Fall back to first "pending"
-  const pending = steps.find((s) => s.status === "pending");
-  if (pending) return pending;
-
-  return null;
-}
+export function getCurrentStep(state: NoesisState): WorkflowStep | null {}
 
 export function getNextStep(state: NoesisState): WorkflowStep | undefined {

[NoCoverage] ConditionalExpression
src/domains/commitment/commitment-domain.ts:76:36
   const { steps } = state.commitment.workflow;
 
   // First step with status "active"
-  const active = steps.find((s) => s.status === "active");
+  const active = steps.find((s) => true);
   if (active) return active;
 

[NoCoverage] EqualityOperator
src/domains/commitment/commitment-domain.ts:76:36
   const { steps } = state.commitment.workflow;
 
   // First step with status "active"
-  const active = steps.find((s) => s.status === "active");
+  const active = steps.find((s) => s.status !== "active");
   if (active) return active;
 

[NoCoverage] ConditionalExpression
src/domains/commitment/commitment-domain.ts:77:7
 
   // First step with status "active"
   const active = steps.find((s) => s.status === "active");
-  if (active) return active;
+  if (true) return active;
 
   // Fall back to first "pending"

[NoCoverage] ConditionalExpression
src/domains/commitment/commitment-domain.ts:77:7
 
   // First step with status "active"
   const active = steps.find((s) => s.status === "active");
-  if (active) return active;
+  if (false) return active;
 
   // Fall back to first "pending"

[NoCoverage] ArrowFunction
src/domains/commitment/commitment-domain.ts:80:30
   if (active) return active;
 
   // Fall back to first "pending"
-  const pending = steps.find((s) => s.status === "pending");
+  const pending = steps.find(() => undefined);
   if (pending) return pending;
 

[NoCoverage] ConditionalExpression
src/domains/commitment/commitment-domain.ts:80:37
   if (active) return active;
 
   // Fall back to first "pending"
-  const pending = steps.find((s) => s.status === "pending");
+  const pending = steps.find((s) => false);
   if (pending) return pending;
 

[NoCoverage] ConditionalExpression
src/domains/commitment/commitment-domain.ts:81:7
 
   // Fall back to first "pending"
   const pending = steps.find((s) => s.status === "pending");
-  if (pending) return pending;
+  if (false) return pending;
 
   return null;

[NoCoverage] ConditionalExpression
src/domains/commitment/commitment-domain.ts:81:7
 
   // Fall back to first "pending"
   const pending = steps.find((s) => s.status === "pending");
-  if (pending) return pending;
+  if (true) return pending;
 
   return null;

[NoCoverage] BlockStatement
src/domains/commitment/commitment-domain.ts:86:75
   return null;
 }
 
-export function getNextStep(state: NoesisState): WorkflowStep | undefined {
-  return state.commitment.workflow.steps.find(
-    (s) => s.status !== "done" && s.status !== "skipped",
-  );
-}
+export function getNextStep(state: NoesisState): WorkflowStep | undefined {}
 

[NoCoverage] EqualityOperator
src/domains/commitment/commitment-domain.ts:88:12
 
 export function getNextStep(state: NoesisState): WorkflowStep | undefined {
   return state.commitment.workflow.steps.find(
-    (s) => s.status !== "done" && s.status !== "skipped",
+    (s) => s.status === "done" && s.status !== "skipped",
   );
 }

[NoCoverage] ConditionalExpression
src/domains/commitment/commitment-domain.ts:88:12
 
 export function getNextStep(state: NoesisState): WorkflowStep | undefined {
   return state.commitment.workflow.steps.find(
-    (s) => s.status !== "done" && s.status !== "skipped",
+    (s) => false,
   );
 }
