[NoCoverage] BlockStatement
src/domains/commitment/consistency-strategy.ts:3:64
 import type { NoesisState } from "../../schema.js";
 
-export function checkConsistency(state: NoesisState): string[] {
-  const warnings: string[] = [];
-  const { workflow } = state.commitment;
-
-  if (workflow.status === "done") {
-    for (const step of workflow.steps) {
-      if (step.status === "active") {
-        warnings.push(
-          `Workflow marked done but step ${step.id} is still active`,
-        );
-      }
-    }
-  }
-
-  if (workflow.status === "active") {
-    const hasActive = workflow.steps.some((s) => s.status === "active");
-    if (!hasActive) {
-      warnings.push("Workflow active but no active step");
-    }
-  }
-
-  return warnings;
-}
+export function checkConsistency(state: NoesisState): string[] {}
 

[NoCoverage] ArrayDeclaration
src/domains/commitment/consistency-strategy.ts:4:30
 import type { NoesisState } from "../../schema.js";
 
 export function checkConsistency(state: NoesisState): string[] {
-  const warnings: string[] = [];
+  const warnings: string[] = ["Stryker was here"];
   const { workflow } = state.commitment;
 

[NoCoverage] ConditionalExpression
src/domains/commitment/consistency-strategy.ts:7:7
   const warnings: string[] = [];
   const { workflow } = state.commitment;
 
-  if (workflow.status === "done") {
+  if (true) {
     for (const step of workflow.steps) {
       if (step.status === "active") {

[NoCoverage] BlockStatement
src/domains/commitment/consistency-strategy.ts:7:35
   const warnings: string[] = [];
   const { workflow } = state.commitment;
 
-  if (workflow.status === "done") {
-    for (const step of workflow.steps) {
-      if (step.status === "active") {
-        warnings.push(
-          `Workflow marked done but step ${step.id} is still active`,
-        );
-      }
-    }
-  }
+  if (workflow.status === "done") {}
 
   if (workflow.status === "active") {

[NoCoverage] BlockStatement
src/domains/commitment/consistency-strategy.ts:8:40
   const { workflow } = state.commitment;
 
   if (workflow.status === "done") {
-    for (const step of workflow.steps) {
-      if (step.status === "active") {
-        warnings.push(
-          `Workflow marked done but step ${step.id} is still active`,
-        );
-      }
-    }
+    for (const step of workflow.steps) {}
   }
 

[NoCoverage] EqualityOperator
src/domains/commitment/consistency-strategy.ts:9:11
 
   if (workflow.status === "done") {
     for (const step of workflow.steps) {
-      if (step.status === "active") {
+      if (step.status !== "active") {
         warnings.push(
           `Workflow marked done but step ${step.id} is still active`,

[NoCoverage] BlockStatement
src/domains/commitment/consistency-strategy.ts:9:37
 
   if (workflow.status === "done") {
     for (const step of workflow.steps) {
-      if (step.status === "active") {
-        warnings.push(
-          `Workflow marked done but step ${step.id} is still active`,
-        );
-      }
+      if (step.status === "active") {}
     }
   }

[NoCoverage] EqualityOperator
src/domains/commitment/consistency-strategy.ts:17:7
     }
   }
 
-  if (workflow.status === "active") {
+  if (workflow.status !== "active") {
     const hasActive = workflow.steps.some((s) => s.status === "active");
     if (!hasActive) {

[NoCoverage] BlockStatement
src/domains/commitment/consistency-strategy.ts:17:37
     }
   }
 
-  if (workflow.status === "active") {
-    const hasActive = workflow.steps.some((s) => s.status === "active");
-    if (!hasActive) {
-      warnings.push("Workflow active but no active step");
-    }
-  }
+  if (workflow.status === "active") {}
 
   return warnings;

[NoCoverage] ConditionalExpression
src/domains/commitment/consistency-strategy.ts:18:50
   }
 
   if (workflow.status === "active") {
-    const hasActive = workflow.steps.some((s) => s.status === "active");
+    const hasActive = workflow.steps.some((s) => false);
     if (!hasActive) {
       warnings.push("Workflow active but no active step");

[NoCoverage] MethodExpression
src/domains/commitment/consistency-strategy.ts:18:23
   }
 
   if (workflow.status === "active") {
-    const hasActive = workflow.steps.some((s) => s.status === "active");
+    const hasActive = workflow.steps.every(s => s.status === "active");
     if (!hasActive) {
       warnings.push("Workflow active but no active step");

[NoCoverage] BooleanLiteral
src/domains/commitment/consistency-strategy.ts:19:9
 
   if (workflow.status === "active") {
     const hasActive = workflow.steps.some((s) => s.status === "active");
-    if (!hasActive) {
+    if (hasActive) {
       warnings.push("Workflow active but no active step");
     }

[NoCoverage] BlockStatement
src/domains/commitment/consistency-strategy.ts:19:21
 
   if (workflow.status === "active") {
     const hasActive = workflow.steps.some((s) => s.status === "active");
-    if (!hasActive) {
-      warnings.push("Workflow active but no active step");
-    }
+    if (!hasActive) {}
   }
 
