[NoCoverage] BlockStatement
src/domains/inference/inference-domain.ts:15:15
   state: NoesisState,
   content: string,
   evidence?: string,
-): Hypothesis {
-  const hypothesis: Hypothesis = {
-    id: generateId("hy"),
-    content,
-    status: "testing",
-    evidence,
-    createdAt: nowISO(),
-    updatedAt: nowISO(),
-  };
-  state.inference.hypotheses.push(hypothesis);
-  return hypothesis;
-}
+): Hypothesis {}
 
 export function addReasoningStep(

[NoCoverage] BlockStatement
src/domains/inference/inference-domain.ts:32:18
   state: NoesisState,
   content: string,
   relatesTo?: string,
-): ReasoningStep {
-  const step: ReasoningStep = {
-    id: generateId("rs"),
-    content,
-    relatesTo,
-    createdAt: nowISO(),
-  };
-  state.inference.reasoning.push(step);
-  return step;
-}
+): ReasoningStep {}
 
 export function updateHypothesisStatus(

[NoCoverage] BlockStatement
src/domains/inference/inference-domain.ts:48:22
   id: string,
   status: HypothesisStatus,
   evidence?: string,
-): Hypothesis | null {
-  const hypothesis = state.inference.hypotheses.find((h) => h.id === id);
-  if (!hypothesis) return null;
-
-  hypothesis.status = status;
-  if (evidence !== undefined) {
-    hypothesis.evidence = evidence;
-  }
-  hypothesis.updatedAt = nowISO();
-  return hypothesis;
-}
+): Hypothesis | null {}
 
 export function confirmHypothesis(

[NoCoverage] ConditionalExpression
src/domains/inference/inference-domain.ts:49:61
   status: HypothesisStatus,
   evidence?: string,
 ): Hypothesis | null {
-  const hypothesis = state.inference.hypotheses.find((h) => h.id === id);
+  const hypothesis = state.inference.hypotheses.find((h) => false);
   if (!hypothesis) return null;
 

[NoCoverage] ArrowFunction
src/domains/inference/inference-domain.ts:49:54
   status: HypothesisStatus,
   evidence?: string,
 ): Hypothesis | null {
-  const hypothesis = state.inference.hypotheses.find((h) => h.id === id);
+  const hypothesis = state.inference.hypotheses.find(() => undefined);
   if (!hypothesis) return null;
 

[NoCoverage] ConditionalExpression
src/domains/inference/inference-domain.ts:50:7
   evidence?: string,
 ): Hypothesis | null {
   const hypothesis = state.inference.hypotheses.find((h) => h.id === id);
-  if (!hypothesis) return null;
+  if (false) return null;
 
   hypothesis.status = status;

[NoCoverage] BooleanLiteral
src/domains/inference/inference-domain.ts:50:7
   evidence?: string,
 ): Hypothesis | null {
   const hypothesis = state.inference.hypotheses.find((h) => h.id === id);
-  if (!hypothesis) return null;
+  if (hypothesis) return null;
 
   hypothesis.status = status;

[NoCoverage] ConditionalExpression
src/domains/inference/inference-domain.ts:53:7
   if (!hypothesis) return null;
 
   hypothesis.status = status;
-  if (evidence !== undefined) {
+  if (false) {
     hypothesis.evidence = evidence;
   }

[NoCoverage] ConditionalExpression
src/domains/inference/inference-domain.ts:53:7
   if (!hypothesis) return null;
 
   hypothesis.status = status;
-  if (evidence !== undefined) {
+  if (true) {
     hypothesis.evidence = evidence;
   }

[NoCoverage] BlockStatement
src/domains/inference/inference-domain.ts:63:58
 export function confirmHypothesis(
   state: NoesisState,
   id: string,
-): { hypothesis: Hypothesis; belief: BeliefFact } | null {
-  const hypothesis = state.inference.hypotheses.find((h) => h.id === id);
-  if (!hypothesis) return null;
-
-  hypothesis.status = "confirmed";
-  hypothesis.updatedAt = nowISO();
-
-  const belief: BeliefFact = {
-    id: generateId("bf"),
-    content: hypothesis.content,
-    confidence: 0.75,
-    source: "inference",
-    status: "active",
-    tags: [`inferred-from-hy-${id}`],
-    createdAt: nowISO(),
-    updatedAt: nowISO(),
-  };
-  state.belief.facts.push(belief);
-
-  return { hypothesis, belief };
-}
+): { hypothesis: Hypothesis; belief: BeliefFact } | null {}
 
 export function getUnresolvedHypotheses(

[NoCoverage] EqualityOperator
src/domains/inference/inference-domain.ts:64:61
   state: NoesisState,
   id: string,
 ): { hypothesis: Hypothesis; belief: BeliefFact } | null {
-  const hypothesis = state.inference.hypotheses.find((h) => h.id === id);
+  const hypothesis = state.inference.hypotheses.find((h) => h.id !== id);
   if (!hypothesis) return null;
 

[NoCoverage] ArrowFunction
src/domains/inference/inference-domain.ts:64:54
   state: NoesisState,
   id: string,
 ): { hypothesis: Hypothesis; belief: BeliefFact } | null {
-  const hypothesis = state.inference.hypotheses.find((h) => h.id === id);
+  const hypothesis = state.inference.hypotheses.find(() => undefined);
   if (!hypothesis) return null;
 

[NoCoverage] ConditionalExpression
src/domains/inference/inference-domain.ts:65:7
   id: string,
 ): { hypothesis: Hypothesis; belief: BeliefFact } | null {
   const hypothesis = state.inference.hypotheses.find((h) => h.id === id);
-  if (!hypothesis) return null;
+  if (true) return null;
 
   hypothesis.status = "confirmed";

[NoCoverage] ObjectLiteral
src/domains/inference/inference-domain.ts:70:30
   hypothesis.status = "confirmed";
   hypothesis.updatedAt = nowISO();
 
-  const belief: BeliefFact = {
-    id: generateId("bf"),
-    content: hypothesis.content,
-    confidence: 0.75,
-    source: "inference",
-    status: "active",
-    tags: [`inferred-from-hy-${id}`],
-    createdAt: nowISO(),
-    updatedAt: nowISO(),
-  };
+  const belief: BeliefFact = {};
   state.belief.facts.push(belief);
 

[NoCoverage] StringLiteral
src/domains/inference/inference-domain.ts:71:20
   hypothesis.updatedAt = nowISO();
 
   const belief: BeliefFact = {
-    id: generateId("bf"),
+    id: generateId(""),
     content: hypothesis.content,
     confidence: 0.75,

[NoCoverage] StringLiteral
src/domains/inference/inference-domain.ts:75:13
     content: hypothesis.content,
     confidence: 0.75,
     source: "inference",
-    status: "active",
+    status: "",
     tags: [`inferred-from-hy-${id}`],
     createdAt: nowISO(),

[NoCoverage] StringLiteral
src/domains/inference/inference-domain.ts:76:12
     confidence: 0.75,
     source: "inference",
     status: "active",
-    tags: [`inferred-from-hy-${id}`],
+    tags: [``],
     createdAt: nowISO(),
     updatedAt: nowISO(),

[NoCoverage] BlockStatement
src/domains/inference/inference-domain.ts:88:17
 export function getUnresolvedHypotheses(
   state: NoesisState,
   max: number = 3,
-): Hypothesis[] {
-  return state.inference.hypotheses
-    .filter((h) => h.status === "testing")
-    .slice(0, max);
-}
+): Hypothesis[] {}
 

[NoCoverage] MethodExpression
src/domains/inference/inference-domain.ts:89:10
   state: NoesisState,
   max: number = 3,
 ): Hypothesis[] {
-  return state.inference.hypotheses
-    .filter((h) => h.status === "testing")
+  return state.inference.hypotheses
     .slice(0, max);
 }

[NoCoverage] MethodExpression
src/domains/inference/inference-domain.ts:89:10
   state: NoesisState,
   max: number = 3,
 ): Hypothesis[] {
-  return state.inference.hypotheses
-    .filter((h) => h.status === "testing")
-    .slice(0, max);
+  return state.inference.hypotheses.filter(h => h.status === "testing");
 }
 

[NoCoverage] EqualityOperator
src/domains/inference/inference-domain.ts:90:20
   max: number = 3,
 ): Hypothesis[] {
   return state.inference.hypotheses
-    .filter((h) => h.status === "testing")
+    .filter((h) => h.status !== "testing")
     .slice(0, max);
 }

[NoCoverage] ConditionalExpression
src/domains/inference/inference-domain.ts:90:20
   max: number = 3,
 ): Hypothesis[] {
   return state.inference.hypotheses
-    .filter((h) => h.status === "testing")
+    .filter((h) => false)
     .slice(0, max);
 }
