[NoCoverage] BlockStatement
src/domains/learning/learning-domain.ts:8:97
 import { truncate } from "../../shared/text.js";
 import type { NoesisState, LearningEntry } from "../../schema.js";
 
-function createEntry(toolName: string, description: string, skillScope?: string): LearningEntry {
-  return {
-    id: generateId("le"),
-    description: truncate(description, 500),
-    skillScope,
-    toolName,
-    capturedAt: nowISO(),
-  };
-}
+function createEntry(toolName: string, description: string, skillScope?: string): LearningEntry {}
 
 export function captureFailure(

[NoCoverage] BlockStatement
src/domains/learning/learning-domain.ts:23:18
   toolName: string,
   description: string,
   skillScope?: string,
-): LearningEntry {
-  const entry = createEntry(toolName, description, skillScope);
-  state.learning.failures.push(entry);
-  state.learning.summary.failureCount++;
-  return entry;
-}
+): LearningEntry {}
 
 export function captureSuccess(

[NoCoverage] UpdateOperator
src/domains/learning/learning-domain.ts:26:3
 ): LearningEntry {
   const entry = createEntry(toolName, description, skillScope);
   state.learning.failures.push(entry);
-  state.learning.summary.failureCount++;
+  state.learning.summary.failureCount--;
   return entry;
 }

[NoCoverage] BlockStatement
src/domains/learning/learning-domain.ts:35:18
   toolName: string,
   description: string,
   skillScope?: string,
-): LearningEntry {
-  const entry = createEntry(toolName, description, skillScope);
-  state.learning.successes.push(entry);
-  state.learning.summary.successCount++;
-  return entry;
-}
+): LearningEntry {}
 
 export function applyRetentionPolicy(

[NoCoverage] UpdateOperator
src/domains/learning/learning-domain.ts:38:3
 ): LearningEntry {
   const entry = createEntry(toolName, description, skillScope);
   state.learning.successes.push(entry);
-  state.learning.summary.successCount++;
+  state.learning.summary.successCount--;
   return entry;
 }

[NoCoverage] BlockStatement
src/domains/learning/learning-domain.ts:45:20
 export function applyRetentionPolicy(
   entries: LearningEntry[],
   maxEntries: number = 50,
-): LearningEntry[] {
-  return evictLearning(entries, maxEntries);
-}
+): LearningEntry[] {}
 
 export function getTopLearning(

[Killed] BlockStatement
src/domains/learning/learning-domain.ts:53:20
   entries: LearningEntry[],
   count: number,
   skillScope?: string,
-): LearningEntry[] {
-  const ranked = rankLearning(entries, skillScope);
-  return ranked.slice(0, count);
-}
+): LearningEntry[] {}
 
 export function captureResult(
killedBy: OMP hook integration ranks resolved repeated failures above unresolved ones
statusReason: Cannot read properties of undefined (reading '0')

[Survived] MethodExpression
src/domains/learning/learning-domain.ts:55:10
   skillScope?: string,
 ): LearningEntry[] {
   const ranked = rankLearning(entries, skillScope);
-  return ranked.slice(0, count);
+  return ranked;
 }
 

[NoCoverage] BlockStatement
src/domains/learning/learning-domain.ts:64:36
   description: string,
   isError: boolean,
   skillScope?: string,
-): { newEntries: LearningEntry[] } {
-  const entry: LearningEntry = {
-    id: generateId("le"),
-    description: truncate(description, 500),
-    skillScope,
-    toolName,
-    severity: isError ? 2 : 1,
-    capturedAt: nowISO(),
-  };
-  return { newEntries: [...entries, entry] };
-}
+): { newEntries: LearningEntry[] } {}
 
 

[NoCoverage] ObjectLiteral
src/domains/learning/learning-domain.ts:65:32
   isError: boolean,
   skillScope?: string,
 ): { newEntries: LearningEntry[] } {
-  const entry: LearningEntry = {
-    id: generateId("le"),
-    description: truncate(description, 500),
-    skillScope,
-    toolName,
-    severity: isError ? 2 : 1,
-    capturedAt: nowISO(),
-  };
+  const entry: LearningEntry = {};
   return { newEntries: [...entries, entry] };
 }

[NoCoverage] StringLiteral
src/domains/learning/learning-domain.ts:66:20
   skillScope?: string,
 ): { newEntries: LearningEntry[] } {
   const entry: LearningEntry = {
-    id: generateId("le"),
+    id: generateId(""),
     description: truncate(description, 500),
     skillScope,

[NoCoverage] ArrayDeclaration
src/domains/learning/learning-domain.ts:73:24
     severity: isError ? 2 : 1,
     capturedAt: nowISO(),
   };
-  return { newEntries: [...entries, entry] };
+  return { newEntries: [] };
 }
 
