[Killed] BlockStatement
src/domains/learning/ranking-strategy.ts:20:41
   currentSkillScope?: string,
 ): LearningEntry[] {
   const now = Date.now();
-  const scored = entries.map((entry) => {
-    const ageMs = now - new Date(entry.capturedAt).getTime();
-    const ageHours = Number.isFinite(ageMs) ? ageMs / (1000 * 60 * 60) : Infinity;
-    const recency = Math.max(1.0 - ageHours / 168, 0.1); // 1 week = 168 hours
-
-    let relevance: number;
-    if (entry.skillScope === currentSkillScope) {
-      relevance = 1.0;
-    } else if (entry.skillScope !== undefined) {
-      relevance = 0.5;
-    } else {
-      relevance = 0.0;
-    }
-
-    const failureMul = entry.rootCause !== undefined ? 2.0 : 1.0;
-    const resolvedMul =
-      entry.rootCause !== undefined && entry.fix !== undefined ? 2.0 : 1.0;
-
-    const score = recency * relevance * failureMul * resolvedMul;
-    return { entry, score };
-  });
+  const scored = entries.map((entry) => {});
 
   scored.sort((a, b) => b.score - a.score);
killedBy: OMP hook integration ranks resolved repeated failures above unresolved ones
statusReason: Cannot read properties of undefined (reading 'entry')

[Killed] ArithmeticOperator
src/domains/learning/ranking-strategy.ts:21:19
 ): LearningEntry[] {
   const now = Date.now();
   const scored = entries.map((entry) => {
-    const ageMs = now - new Date(entry.capturedAt).getTime();
+    const ageMs = now + new Date(entry.capturedAt).getTime();
     const ageHours = Number.isFinite(ageMs) ? ageMs / (1000 * 60 * 60) : Infinity;
     const recency = Math.max(1.0 - ageHours / 168, 0.1); // 1 week = 168 hours
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 1.6054923214285715 to be greater than or equal to 1.8240639484116983

[Killed] ArithmeticOperator
src/domains/learning/ranking-strategy.ts:22:56
   const now = Date.now();
   const scored = entries.map((entry) => {
     const ageMs = now - new Date(entry.capturedAt).getTime();
-    const ageHours = Number.isFinite(ageMs) ? ageMs / (1000 * 60 * 60) : Infinity;
+    const ageHours = Number.isFinite(ageMs) ? ageMs / (1000 * 60 / 60) : Infinity;
     const recency = Math.max(1.0 - ageHours / 168, 0.1); // 1 week = 168 hours
 
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 1.6054923181216931 to be greater than or equal to 1.8240639484116983

[Killed] ArithmeticOperator
src/domains/learning/ranking-strategy.ts:22:47
   const now = Date.now();
   const scored = entries.map((entry) => {
     const ageMs = now - new Date(entry.capturedAt).getTime();
-    const ageHours = Number.isFinite(ageMs) ? ageMs / (1000 * 60 * 60) : Infinity;
+    const ageHours = Number.isFinite(ageMs) ? ageMs * (1000 * 60 * 60) : Infinity;
     const recency = Math.max(1.0 - ageHours / 168, 0.1); // 1 week = 168 hours
 
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 1.6054923214285715 to be greater than or equal to 1.8240639484116983

[Killed] MethodExpression
src/domains/learning/ranking-strategy.ts:23:21
   const scored = entries.map((entry) => {
     const ageMs = now - new Date(entry.capturedAt).getTime();
     const ageHours = Number.isFinite(ageMs) ? ageMs / (1000 * 60 * 60) : Infinity;
-    const recency = Math.max(1.0 - ageHours / 168, 0.1); // 1 week = 168 hours
+    const recency = Math.min(1.0 - ageHours / 168, 0.1); // 1 week = 168 hours
 
     let relevance: number;
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 1.6054923247354498 to be greater than or equal to 1.8240639517185766

[Killed] ArithmeticOperator
src/domains/learning/ranking-strategy.ts:23:36
   const scored = entries.map((entry) => {
     const ageMs = now - new Date(entry.capturedAt).getTime();
     const ageHours = Number.isFinite(ageMs) ? ageMs / (1000 * 60 * 60) : Infinity;
-    const recency = Math.max(1.0 - ageHours / 168, 0.1); // 1 week = 168 hours
+    const recency = Math.max(1.0 - ageHours * 168, 0.1); // 1 week = 168 hours
 
     let relevance: number;
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 1.6054923247354498 to be greater than or equal to 1.8240639517185766

[Killed] EqualityOperator
src/domains/learning/ranking-strategy.ts:26:9
     const recency = Math.max(1.0 - ageHours / 168, 0.1); // 1 week = 168 hours
 
     let relevance: number;
-    if (entry.skillScope === currentSkillScope) {
+    if (entry.skillScope !== currentSkillScope) {
       relevance = 1.0;
     } else if (entry.skillScope !== undefined) {
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 1.498399818121693 to be greater than or equal to 1.4983998247344497

[Killed] ConditionalExpression
src/domains/learning/ranking-strategy.ts:26:9
     const recency = Math.max(1.0 - ageHours / 168, 0.1); // 1 week = 168 hours
 
     let relevance: number;
-    if (entry.skillScope === currentSkillScope) {
+    if (false) {
       relevance = 1.0;
     } else if (entry.skillScope !== undefined) {
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.8216051537698412 to be greater than or equal to 0.8216051554222804

[Killed] EqualityOperator
src/domains/learning/ranking-strategy.ts:28:16
     let relevance: number;
     if (entry.skillScope === currentSkillScope) {
       relevance = 1.0;
-    } else if (entry.skillScope !== undefined) {
+    } else if (entry.skillScope === undefined) {
       relevance = 0.5;
     } else {
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.16513297867063492 to be greater than or equal to 1.8240639517185766

[Killed] BlockStatement
src/domains/learning/ranking-strategy.ts:28:48
     let relevance: number;
     if (entry.skillScope === currentSkillScope) {
       relevance = 1.0;
-    } else if (entry.skillScope !== undefined) {
-      relevance = 0.5;
-    } else {
+    } else if (entry.skillScope !== undefined) {} else {
       relevance = 0.0;
     }
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.1651329794973545 to be greater than or equal to 1.8240639517185766

[NoCoverage] BlockStatement
src/domains/learning/ranking-strategy.ts:30:12
       relevance = 1.0;
     } else if (entry.skillScope !== undefined) {
       relevance = 0.5;
-    } else {
-      relevance = 0.0;
-    }
+    } else {}
 
     const failureMul = entry.rootCause !== undefined ? 2.0 : 1.0;

[Killed] EqualityOperator
src/domains/learning/ranking-strategy.ts:34:24
       relevance = 0.0;
     }
 
-    const failureMul = entry.rootCause !== undefined ? 2.0 : 1.0;
+    const failureMul = entry.rootCause === undefined ? 2.0 : 1.0;
     const resolvedMul =
       entry.rootCause !== undefined && entry.fix !== undefined ? 2.0 : 1.0;
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.49207854662698414 to be greater than or equal to 1.8240639484116983

[Killed] ConditionalExpression
src/domains/learning/ranking-strategy.ts:34:24
       relevance = 0.0;
     }
 
-    const failureMul = entry.rootCause !== undefined ? 2.0 : 1.0;
+    const failureMul = false ? 2.0 : 1.0;
     const resolvedMul =
       entry.rootCause !== undefined && entry.fix !== undefined ? 2.0 : 1.0;
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.4182812673611111 to be greater than or equal to 0.8216051554222804

[Killed] LogicalOperator
src/domains/learning/ranking-strategy.ts:36:7
 
     const failureMul = entry.rootCause !== undefined ? 2.0 : 1.0;
     const resolvedMul =
-      entry.rootCause !== undefined && entry.fix !== undefined ? 2.0 : 1.0;
+      entry.rootCause !== undefined || entry.fix !== undefined ? 2.0 : 1.0;
 
     const score = recency * relevance * failureMul * resolvedMul;
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.9382186078042328 to be greater than or equal to 1.8240639517185766

[Killed] ConditionalExpression
src/domains/learning/ranking-strategy.ts:36:7
 
     const failureMul = entry.rootCause !== undefined ? 2.0 : 1.0;
     const resolvedMul =
-      entry.rootCause !== undefined && entry.fix !== undefined ? 2.0 : 1.0;
+      false ? 2.0 : 1.0;
 
     const score = recency * relevance * failureMul * resolvedMul;
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.9382186061507937 to be greater than or equal to 1.8240639484116983

[Killed] ArithmeticOperator
src/domains/learning/ranking-strategy.ts:38:19
     const resolvedMul =
       entry.rootCause !== undefined && entry.fix !== undefined ? 2.0 : 1.0;
 
-    const score = recency * relevance * failureMul * resolvedMul;
+    const score = recency * relevance / failureMul * resolvedMul;
     return { entry, score };
   });
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.4920785474537037 to be greater than or equal to 1.8240639517185766

[Killed] ArithmeticOperator
src/domains/learning/ranking-strategy.ts:38:19
     const resolvedMul =
       entry.rootCause !== undefined && entry.fix !== undefined ? 2.0 : 1.0;
 
-    const score = recency * relevance * failureMul * resolvedMul;
+    const score = recency * relevance * failureMul / resolvedMul;
     return { entry, score };
   });
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.9382186078042328 to be greater than or equal to 1.8240639517185766

[Killed] ObjectLiteral
src/domains/learning/ranking-strategy.ts:39:12
       entry.rootCause !== undefined && entry.fix !== undefined ? 2.0 : 1.0;
 
     const score = recency * relevance * failureMul * resolvedMul;
-    return { entry, score };
+    return {};
   });
 
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: Cannot read properties of undefined (reading 'capturedAt')

[Killed] MethodExpression
src/domains/learning/ranking-strategy.ts:42:3
     return { entry, score };
   });
 
-  scored.sort((a, b) => b.score - a.score);
+  scored;
   return scored.map((s) => s.entry);
 }
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.1651329794973545 to be greater than or equal to 1.8240639517185766

[Killed] ArithmeticOperator
src/domains/learning/ranking-strategy.ts:42:25
     return { entry, score };
   });
 
-  scored.sort((a, b) => b.score - a.score);
+  scored.sort((a, b) => b.score + a.score);
   return scored.map((s) => s.entry);
 }
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: expected 0.1651329794973545 to be greater than or equal to 1.8240639517185766

[Killed] ArrowFunction
src/domains/learning/ranking-strategy.ts:43:21
   });
 
   scored.sort((a, b) => b.score - a.score);
-  return scored.map((s) => s.entry);
+  return scored.map(() => undefined);
 }
 
killedBy: eviction ordering properties 100 random entry sets → top entry by score is highest scored
statusReason: Cannot read properties of undefined (reading 'capturedAt')
