[NoCoverage] BlockStatement
src/infrastructure/filesystem-store.ts:19:54
 
 export { statePath } from "../shared/paths.js";
 
-export function loadState(root: string): NoesisState {
-  const path = statePath(root);
-  if (!existsSync(path)) return EMPTY_STATE();
-
-  try {
-    const parsed = NoesisStateSchema.parse(JSON.parse(readFileSync(path, "utf-8")));
-    return parsed.version < CURRENT_VERSION ? runMigrations(parsed) : parsed;
-  } catch {
-    return EMPTY_STATE();
-  }
-}
+export function loadState(root: string): NoesisState {}
 
 function stripTransientFindings(state: NoesisState): NoesisState {

[NoCoverage] ConditionalExpression
src/infrastructure/filesystem-store.ts:21:7
 
 export function loadState(root: string): NoesisState {
   const path = statePath(root);
-  if (!existsSync(path)) return EMPTY_STATE();
+  if (true) return EMPTY_STATE();
 
   try {

[NoCoverage] BooleanLiteral
src/infrastructure/filesystem-store.ts:21:7
 
 export function loadState(root: string): NoesisState {
   const path = statePath(root);
-  if (!existsSync(path)) return EMPTY_STATE();
+  if (existsSync(path)) return EMPTY_STATE();
 
   try {

[NoCoverage] BlockStatement
src/infrastructure/filesystem-store.ts:23:7
   const path = statePath(root);
   if (!existsSync(path)) return EMPTY_STATE();
 
-  try {
-    const parsed = NoesisStateSchema.parse(JSON.parse(readFileSync(path, "utf-8")));
-    return parsed.version < CURRENT_VERSION ? runMigrations(parsed) : parsed;
-  } catch {
+  try {} catch {
     return EMPTY_STATE();
   }

[NoCoverage] StringLiteral
src/infrastructure/filesystem-store.ts:24:74
   if (!existsSync(path)) return EMPTY_STATE();
 
   try {
-    const parsed = NoesisStateSchema.parse(JSON.parse(readFileSync(path, "utf-8")));
+    const parsed = NoesisStateSchema.parse(JSON.parse(readFileSync(path, "")));
     return parsed.version < CURRENT_VERSION ? runMigrations(parsed) : parsed;
   } catch {

[NoCoverage] ConditionalExpression
src/infrastructure/filesystem-store.ts:25:12
 
   try {
     const parsed = NoesisStateSchema.parse(JSON.parse(readFileSync(path, "utf-8")));
-    return parsed.version < CURRENT_VERSION ? runMigrations(parsed) : parsed;
+    return true ? runMigrations(parsed) : parsed;
   } catch {
     return EMPTY_STATE();

[NoCoverage] ConditionalExpression
src/infrastructure/filesystem-store.ts:25:12
 
   try {
     const parsed = NoesisStateSchema.parse(JSON.parse(readFileSync(path, "utf-8")));
-    return parsed.version < CURRENT_VERSION ? runMigrations(parsed) : parsed;
+    return false ? runMigrations(parsed) : parsed;
   } catch {
     return EMPTY_STATE();

[NoCoverage] BlockStatement
src/infrastructure/filesystem-store.ts:26:11
   try {
     const parsed = NoesisStateSchema.parse(JSON.parse(readFileSync(path, "utf-8")));
     return parsed.version < CURRENT_VERSION ? runMigrations(parsed) : parsed;
-  } catch {
-    return EMPTY_STATE();
-  }
+  } catch {}
 }
 

[NoCoverage] BlockStatement
src/infrastructure/filesystem-store.ts:31:66
   }
 }
 
-function stripTransientFindings(state: NoesisState): NoesisState {
-  delete state.attention.graphFindings;
-  delete state.attention.__graphFindings;
-  return state;
-}
+function stripTransientFindings(state: NoesisState): NoesisState {}
 
 export function saveState(root: string, state: NoesisState): void {

[NoCoverage] BlockStatement
src/infrastructure/filesystem-store.ts:37:67
   return state;
 }
 
-export function saveState(root: string, state: NoesisState): void {
-  const cloneState = stripTransientFindings(clone(state));
-  cloneState.lastPersisted = nowISO();
-
-  const json = JSON.stringify(cloneState, null, 2);
-  const finalPath = statePath(root);
-  const tempPath = `${finalPath}.tmp.${process.pid}`;
-
-  ensureDir(dirname(tempPath));
-
-  const fd = openSync(tempPath, "w");
-  try {
-    writeFileSync(fd, json, "utf-8");
-    fsyncSync(fd);
-  } finally {
-    closeSync(fd);
-  }
-
-  renameSync(tempPath, finalPath);
-}
+export function saveState(root: string, state: NoesisState): void {}
 

[NoCoverage] StringLiteral
src/infrastructure/filesystem-store.ts:47:33
 
   ensureDir(dirname(tempPath));
 
-  const fd = openSync(tempPath, "w");
+  const fd = openSync(tempPath, "");
   try {
     writeFileSync(fd, json, "utf-8");

[NoCoverage] BlockStatement
src/infrastructure/filesystem-store.ts:48:7
   ensureDir(dirname(tempPath));
 
   const fd = openSync(tempPath, "w");
-  try {
-    writeFileSync(fd, json, "utf-8");
-    fsyncSync(fd);
-  } finally {
+  try {} finally {
     closeSync(fd);
   }

[NoCoverage] BlockStatement
src/infrastructure/filesystem-store.ts:51:13
   try {
     writeFileSync(fd, json, "utf-8");
     fsyncSync(fd);
-  } finally {
-    closeSync(fd);
-  }
+  } finally {}
 
   renameSync(tempPath, finalPath);
