[NoCoverage] BlockStatement
src/infrastructure/graphify-client.ts:19:37
 
   constructor(private root: string) {}
 
-  get capability(): CapabilityLevel {
-    if (this._capability === undefined) {
-      this._capability = this.detectCapability();
-    }
-    return this._capability;
-  }
+  get capability(): CapabilityLevel {}
 
   detectCapability(): CapabilityLevel {

[NoCoverage] EqualityOperator
src/infrastructure/graphify-client.ts:20:9
   constructor(private root: string) {}
 
   get capability(): CapabilityLevel {
-    if (this._capability === undefined) {
+    if (this._capability !== undefined) {
       this._capability = this.detectCapability();
     }

[NoCoverage] BlockStatement
src/infrastructure/graphify-client.ts:20:41
   constructor(private root: string) {}
 
   get capability(): CapabilityLevel {
-    if (this._capability === undefined) {
-      this._capability = this.detectCapability();
-    }
+    if (this._capability === undefined) {}
     return this._capability;
   }

[Killed] BlockStatement
src/infrastructure/graphify-client.ts:26:39
     return this._capability;
   }
 
-  detectCapability(): CapabilityLevel {
-    try {
-      execFileSync("graphify", ["--version"], { timeout: 5000, cwd: this.root });
-    } catch {
-      return (this._capability = "DEGRADED");
-    }
-
-    const graphPath = join(this.root, "graphify-out", "graph.json");
-    if (!existsSync(graphPath)) {
-      return (this._capability = "NO_GRAPH");
-    }
-
-    const graphMtime = statSync(graphPath).mtimeMs;
-    return (this._capability = graphMtime < this.getNewestSourceMtime() ? "STALE" : "FULL");
-  }
+  detectCapability(): CapabilityLevel {}
 
   refreshCapability(): CapabilityLevel {
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected [ 'FULL', 'STALE', 'NO_GRAPH', …(1) ] to include undefined

[Killed] BlockStatement
src/infrastructure/graphify-client.ts:27:9
   }
 
   detectCapability(): CapabilityLevel {
-    try {
-      execFileSync("graphify", ["--version"], { timeout: 5000, cwd: this.root });
-    } catch {
+    try {} catch {
       return (this._capability = "DEGRADED");
     }
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected "spy" to be called with arguments: [ 'graphify', [ '--version' ], …(1) ]

Number of calls: 0

[Killed] ArrayDeclaration
src/infrastructure/graphify-client.ts:28:32
 
   detectCapability(): CapabilityLevel {
     try {
-      execFileSync("graphify", ["--version"], { timeout: 5000, cwd: this.root });
+      execFileSync("graphify", [], { timeout: 5000, cwd: this.root });
     } catch {
       return (this._capability = "DEGRADED");
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected "spy" to be called with arguments: [ 'graphify', [ '--version' ], …(1) ]

Received: 

  1st spy call:

  [
    "graphify",

[Survived] BlockStatement
src/infrastructure/graphify-client.ts:29:13
   detectCapability(): CapabilityLevel {
     try {
       execFileSync("graphify", ["--version"], { timeout: 5000, cwd: this.root });
-    } catch {
-      return (this._capability = "DEGRADED");
-    }
+    } catch {}
 
     const graphPath = join(this.root, "graphify-out", "graph.json");

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-client.ts:34:9
     }
 
     const graphPath = join(this.root, "graphify-out", "graph.json");
-    if (!existsSync(graphPath)) {
+    if (false) {
       return (this._capability = "NO_GRAPH");
     }

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-client.ts:34:9
     }
 
     const graphPath = join(this.root, "graphify-out", "graph.json");
-    if (!existsSync(graphPath)) {
+    if (true) {
       return (this._capability = "NO_GRAPH");
     }

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-client.ts:39:32
     }
 
     const graphMtime = statSync(graphPath).mtimeMs;
-    return (this._capability = graphMtime < this.getNewestSourceMtime() ? "STALE" : "FULL");
+    return (this._capability = true ? "STALE" : "FULL");
   }
 

[NoCoverage] EqualityOperator
src/infrastructure/graphify-client.ts:39:32
     }
 
     const graphMtime = statSync(graphPath).mtimeMs;
-    return (this._capability = graphMtime < this.getNewestSourceMtime() ? "STALE" : "FULL");
+    return (this._capability = graphMtime <= this.getNewestSourceMtime() ? "STALE" : "FULL");
   }
 

[Killed] BlockStatement
src/infrastructure/graphify-client.ts:42:40
     return (this._capability = graphMtime < this.getNewestSourceMtime() ? "STALE" : "FULL");
   }
 
-  refreshCapability(): CapabilityLevel {
-    return this.detectCapability();
-  }
+  refreshCapability(): CapabilityLevel {}
 
   async staleRecover(): Promise<CapabilityLevel> {
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected [ 'FULL', 'STALE', 'NO_GRAPH', …(1) ] to include undefined

[Killed] BlockStatement
src/infrastructure/graphify-client.ts:46:50
     return this.detectCapability();
   }
 
-  async staleRecover(): Promise<CapabilityLevel> {
-    await this.updateGraph();
-    return this.refreshCapability();
-  }
+  async staleRecover(): Promise<CapabilityLevel> {}
 
   async query(question: string): Promise<string> {
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected "spy" to be called with arguments: [ 'graphify', [ 'update', '.' ], …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/graphify-client.ts:51:50
     return this.refreshCapability();
   }
 
-  async query(question: string): Promise<string> {
-    const { stdout } = await execFile("graphify", [
-      "query", question, "--graph", "graphify-out/graph.json",
-    ], { timeout: 30000, cwd: this.root });
-    return stdout;
-  }
+  async query(question: string): Promise<string> {}
 
   async updateGraph(): Promise<void> {
killedBy: GraphifyClient async operations query resolves with a string when execFile succeeds
statusReason: expected undefined to be 'found: ComponentA -> ComponentB\n' // Object.is equality

[Killed] BlockStatement
src/infrastructure/graphify-client.ts:58:38
     return stdout;
   }
 
-  async updateGraph(): Promise<void> {
-    await execFile("graphify", ["update", "."], { timeout: 120000, cwd: this.root });
-  }
+  async updateGraph(): Promise<void> {}
 
   async buildGraph(): Promise<void> {
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected "spy" to be called with arguments: [ 'graphify', [ 'update', '.' ], …(2) ]

Number of calls: 0

[Killed] ObjectLiteral
src/infrastructure/graphify-client.ts:59:49
   }
 
   async updateGraph(): Promise<void> {
-    await execFile("graphify", ["update", "."], { timeout: 120000, cwd: this.root });
+    await execFile("graphify", ["update", "."], {});
   }
 
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected "spy" to be called with arguments: [ 'graphify', [ 'update', '.' ], …(2) ]

Received: 

  1st spy call:

@@ -2,11 +2,8 @@
    "graphify",

[Killed] ArrayDeclaration
src/infrastructure/graphify-client.ts:59:32
   }
 
   async updateGraph(): Promise<void> {
-    await execFile("graphify", ["update", "."], { timeout: 120000, cwd: this.root });
+    await execFile("graphify", [], { timeout: 120000, cwd: this.root });
   }
 
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected "spy" to be called with arguments: [ 'graphify', [ 'update', '.' ], …(2) ]

Received: 

  1st spy call:

  [
    "graphify",

[NoCoverage] BlockStatement
src/infrastructure/graphify-client.ts:62:37
     await execFile("graphify", ["update", "."], { timeout: 120000, cwd: this.root });
   }
 
-  async buildGraph(): Promise<void> {
-    await execFile("graphify", ["."], { timeout: 300000, cwd: this.root });
-  }
+  async buildGraph(): Promise<void> {}
 
   async explain(node: string): Promise<string> {

[NoCoverage] ObjectLiteral
src/infrastructure/graphify-client.ts:63:39
   }
 
   async buildGraph(): Promise<void> {
-    await execFile("graphify", ["."], { timeout: 300000, cwd: this.root });
+    await execFile("graphify", ["."], {});
   }
 

[NoCoverage] BlockStatement
src/infrastructure/graphify-client.ts:66:48
     await execFile("graphify", ["."], { timeout: 300000, cwd: this.root });
   }
 
-  async explain(node: string): Promise<string> {
-    const { stdout } = await execFile("graphify", [
-      "explain", node, "--graph", "graphify-out/graph.json",
-    ], { timeout: 30000, cwd: this.root });
-    return stdout;
-  }
+  async explain(node: string): Promise<string> {}
 
   async path(source: string, target: string): Promise<string> {

[NoCoverage] StringLiteral
src/infrastructure/graphify-client.ts:68:35
 
   async explain(node: string): Promise<string> {
     const { stdout } = await execFile("graphify", [
-      "explain", node, "--graph", "graphify-out/graph.json",
+      "explain", node, "--graph", "",
     ], { timeout: 30000, cwd: this.root });
     return stdout;

[NoCoverage] ObjectLiteral
src/infrastructure/graphify-client.ts:69:8
   async explain(node: string): Promise<string> {
     const { stdout } = await execFile("graphify", [
       "explain", node, "--graph", "graphify-out/graph.json",
-    ], { timeout: 30000, cwd: this.root });
+    ], {});
     return stdout;
   }

[NoCoverage] BlockStatement
src/infrastructure/graphify-client.ts:73:63
     return stdout;
   }
 
-  async path(source: string, target: string): Promise<string> {
-    const { stdout } = await execFile("graphify", [
-      "path", source, target, "--graph", "graphify-out/graph.json",
-    ], { timeout: 30000, cwd: this.root });
-    return stdout;
-  }
+  async path(source: string, target: string): Promise<string> {}
   private getNewestSourceMtime(): number {
     let newest = 0;

[NoCoverage] StringLiteral
src/infrastructure/graphify-client.ts:74:39
   }
 
   async path(source: string, target: string): Promise<string> {
-    const { stdout } = await execFile("graphify", [
+    const { stdout } = await execFile("", [
       "path", source, target, "--graph", "graphify-out/graph.json",
     ], { timeout: 30000, cwd: this.root });

[NoCoverage] StringLiteral
src/infrastructure/graphify-client.ts:75:31
 
   async path(source: string, target: string): Promise<string> {
     const { stdout } = await execFile("graphify", [
-      "path", source, target, "--graph", "graphify-out/graph.json",
+      "path", source, target, "", "graphify-out/graph.json",
     ], { timeout: 30000, cwd: this.root });
     return stdout;

[NoCoverage] StringLiteral
src/infrastructure/graphify-client.ts:75:7
 
   async path(source: string, target: string): Promise<string> {
     const { stdout } = await execFile("graphify", [
-      "path", source, target, "--graph", "graphify-out/graph.json",
+      "", source, target, "--graph", "graphify-out/graph.json",
     ], { timeout: 30000, cwd: this.root });
     return stdout;

[NoCoverage] BlockStatement
src/infrastructure/graphify-client.ts:79:42
     ], { timeout: 30000, cwd: this.root });
     return stdout;
   }
-  private getNewestSourceMtime(): number {
-    let newest = 0;
-    for (const dir of [this.root, join(this.root, "src")]) {
-      if (!existsSync(dir)) continue;
-      for (const entry of readdirSync(dir)) {
-        if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;
-        try {
-          const mtime = statSync(join(dir, entry)).mtimeMs;
-          if (mtime > newest) newest = mtime;
-        } catch {
-          // skip unreadable
-        }
-      }
-    }
-    return newest;
-  }
+  private getNewestSourceMtime(): number {}
 }
 

[NoCoverage] BlockStatement
src/infrastructure/graphify-client.ts:81:60
   }
   private getNewestSourceMtime(): number {
     let newest = 0;
-    for (const dir of [this.root, join(this.root, "src")]) {
-      if (!existsSync(dir)) continue;
-      for (const entry of readdirSync(dir)) {
-        if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;
-        try {
-          const mtime = statSync(join(dir, entry)).mtimeMs;
-          if (mtime > newest) newest = mtime;
-        } catch {
-          // skip unreadable
-        }
-      }
-    }
+    for (const dir of [this.root, join(this.root, "src")]) {}
     return newest;
   }

[NoCoverage] StringLiteral
src/infrastructure/graphify-client.ts:81:51
   }
   private getNewestSourceMtime(): number {
     let newest = 0;
-    for (const dir of [this.root, join(this.root, "src")]) {
+    for (const dir of [this.root, join(this.root, "")]) {
       if (!existsSync(dir)) continue;
       for (const entry of readdirSync(dir)) {

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-client.ts:82:11
   private getNewestSourceMtime(): number {
     let newest = 0;
     for (const dir of [this.root, join(this.root, "src")]) {
-      if (!existsSync(dir)) continue;
+      if (true) continue;
       for (const entry of readdirSync(dir)) {
         if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-client.ts:82:11
   private getNewestSourceMtime(): number {
     let newest = 0;
     for (const dir of [this.root, join(this.root, "src")]) {
-      if (!existsSync(dir)) continue;
+      if (false) continue;
       for (const entry of readdirSync(dir)) {
         if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;

[NoCoverage] BlockStatement
src/infrastructure/graphify-client.ts:83:45
     let newest = 0;
     for (const dir of [this.root, join(this.root, "src")]) {
       if (!existsSync(dir)) continue;
-      for (const entry of readdirSync(dir)) {
-        if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;
-        try {
-          const mtime = statSync(join(dir, entry)).mtimeMs;
-          if (mtime > newest) newest = mtime;
-        } catch {
-          // skip unreadable
-        }
-      }
+      for (const entry of readdirSync(dir)) {}
     }
     return newest;

[NoCoverage] LogicalOperator
src/infrastructure/graphify-client.ts:84:13
     for (const dir of [this.root, join(this.root, "src")]) {
       if (!existsSync(dir)) continue;
       for (const entry of readdirSync(dir)) {
-        if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;
+        if (!entry.endsWith(".ts") && !entry.endsWith(".js") || !entry.endsWith(".json")) continue;
         try {
           const mtime = statSync(join(dir, entry)).mtimeMs;

[NoCoverage] BooleanLiteral
src/infrastructure/graphify-client.ts:84:39
     for (const dir of [this.root, join(this.root, "src")]) {
       if (!existsSync(dir)) continue;
       for (const entry of readdirSync(dir)) {
-        if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;
+        if (!entry.endsWith(".ts") && entry.endsWith(".js") && !entry.endsWith(".json")) continue;
         try {
           const mtime = statSync(join(dir, entry)).mtimeMs;

[NoCoverage] BlockStatement
src/infrastructure/graphify-client.ts:85:13
       if (!existsSync(dir)) continue;
       for (const entry of readdirSync(dir)) {
         if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;
-        try {
-          const mtime = statSync(join(dir, entry)).mtimeMs;
-          if (mtime > newest) newest = mtime;
-        } catch {
+        try {} catch {
           // skip unreadable
         }

[NoCoverage] EqualityOperator
src/infrastructure/graphify-client.ts:87:15
         if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;
         try {
           const mtime = statSync(join(dir, entry)).mtimeMs;
-          if (mtime > newest) newest = mtime;
+          if (mtime >= newest) newest = mtime;
         } catch {
           // skip unreadable

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-client.ts:87:15
         if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;
         try {
           const mtime = statSync(join(dir, entry)).mtimeMs;
-          if (mtime > newest) newest = mtime;
+          if (false) newest = mtime;
         } catch {
           // skip unreadable

[NoCoverage] BlockStatement
src/infrastructure/graphify-client.ts:97:55
   }
 }
 
-export function stderrOrMessage(err: unknown): string {
-  return err instanceof Error ? err.message : String(err);
-}
+export function stderrOrMessage(err: unknown): string {}
 
