[NoCoverage] ObjectLiteral
src/infrastructure/graphify-engine.ts:29:48
 // Confidence tier mapping (contract §7)
 // EXTRACTED → 1.0 (never penalized)
 // INFERRED N.NN → exact tier from this map
-const INFERRED_TIERS: Record<number, number> = {
-  0.95: 0.95,
-  0.85: 0.85,
-  0.75: 0.75,
-  0.65: 0.65,
-  0.55: 0.55,
-};
+const INFERRED_TIERS: Record<number, number> = {};
 
 const EXTRACTED_CONFIDENCE = 1.0;

[NoCoverage] BlockStatement
src/infrastructure/graphify-engine.ts:43:53
  * Map a raw inferred confidence value to the nearest tier in the
  * INFERRED_TIERS lookup table. Values below the floor tier floor at 0.55.
  */
-function mapInferredConfidence(raw: number): number {
-  const tiers = Object.keys(INFERRED_TIERS).map(Number).sort((a, b) => b - a);
-  for (const tier of tiers) {
-    if (raw >= tier) return INFERRED_TIERS[tier]!;
-  }
-  return 0.55;
-}
+function mapInferredConfidence(raw: number): number {}
 
 

[NoCoverage] MethodExpression
src/infrastructure/graphify-engine.ts:44:17
  * INFERRED_TIERS lookup table. Values below the floor tier floor at 0.55.
  */
 function mapInferredConfidence(raw: number): number {
-  const tiers = Object.keys(INFERRED_TIERS).map(Number).sort((a, b) => b - a);
+  const tiers = Object.keys(INFERRED_TIERS).map(Number);
   for (const tier of tiers) {
     if (raw >= tier) return INFERRED_TIERS[tier]!;

[NoCoverage] ArithmeticOperator
src/infrastructure/graphify-engine.ts:44:72
  * INFERRED_TIERS lookup table. Values below the floor tier floor at 0.55.
  */
 function mapInferredConfidence(raw: number): number {
-  const tiers = Object.keys(INFERRED_TIERS).map(Number).sort((a, b) => b - a);
+  const tiers = Object.keys(INFERRED_TIERS).map(Number).sort((a, b) => b + a);
   for (const tier of tiers) {
     if (raw >= tier) return INFERRED_TIERS[tier]!;

[NoCoverage] BlockStatement
src/infrastructure/graphify-engine.ts:45:29
  */
 function mapInferredConfidence(raw: number): number {
   const tiers = Object.keys(INFERRED_TIERS).map(Number).sort((a, b) => b - a);
-  for (const tier of tiers) {
-    if (raw >= tier) return INFERRED_TIERS[tier]!;
-  }
+  for (const tier of tiers) {}
   return 0.55;
 }

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:46:9
 function mapInferredConfidence(raw: number): number {
   const tiers = Object.keys(INFERRED_TIERS).map(Number).sort((a, b) => b - a);
   for (const tier of tiers) {
-    if (raw >= tier) return INFERRED_TIERS[tier]!;
+    if (false) return INFERRED_TIERS[tier]!;
   }
   return 0.55;

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:46:9
 function mapInferredConfidence(raw: number): number {
   const tiers = Object.keys(INFERRED_TIERS).map(Number).sort((a, b) => b - a);
   for (const tier of tiers) {
-    if (raw >= tier) return INFERRED_TIERS[tier]!;
+    if (true) return INFERRED_TIERS[tier]!;
   }
   return 0.55;

[NoCoverage] BooleanLiteral
src/infrastructure/graphify-engine.ts:73:24
 export async function perceive(graphify: GraphifyClient, question: string): Promise<PerceptionResult> {
   // 1. Check capability
   let capability = graphify.capability;
-  let staleRecovered = false;
+  let staleRecovered = true;
 
   // 2. If STALE, auto-recover

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:76:7
   let staleRecovered = false;
 
   // 2. If STALE, auto-recover
-  if (capability === "STALE") {
+  if (true) {
     const newCap = await graphify.staleRecover();
     if (newCap === "FULL") {

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:76:7
   let staleRecovered = false;
 
   // 2. If STALE, auto-recover
-  if (capability === "STALE") {
+  if (false) {
     const newCap = await graphify.staleRecover();
     if (newCap === "FULL") {

[NoCoverage] BlockStatement
src/infrastructure/graphify-engine.ts:78:28
   // 2. If STALE, auto-recover
   if (capability === "STALE") {
     const newCap = await graphify.staleRecover();
-    if (newCap === "FULL") {
-      staleRecovered = true;
-      capability = "FULL";
-    }
+    if (newCap === "FULL") {}
   }
 

[NoCoverage] EqualityOperator
src/infrastructure/graphify-engine.ts:78:9
   // 2. If STALE, auto-recover
   if (capability === "STALE") {
     const newCap = await graphify.staleRecover();
-    if (newCap === "FULL") {
+    if (newCap !== "FULL") {
       staleRecovered = true;
       capability = "FULL";

[NoCoverage] BooleanLiteral
src/infrastructure/graphify-engine.ts:79:24
   if (capability === "STALE") {
     const newCap = await graphify.staleRecover();
     if (newCap === "FULL") {
-      staleRecovered = true;
+      staleRecovered = false;
       capability = "FULL";
     }

[NoCoverage] StringLiteral
src/infrastructure/graphify-engine.ts:80:20
     const newCap = await graphify.staleRecover();
     if (newCap === "FULL") {
       staleRecovered = true;
-      capability = "FULL";
+      capability = "";
     }
   }

[NoCoverage] BlockStatement
src/infrastructure/graphify-engine.ts:86:7
 
   // 3. Query Graphify
   let raw: string;
-  try {
-    raw = await graphify.query(question);
-  } catch (e) {
+  try {} catch (e) {
     return {
       beliefs: [],

[NoCoverage] BlockStatement
src/infrastructure/graphify-engine.ts:88:15
   let raw: string;
   try {
     raw = await graphify.query(question);
-  } catch (e) {
-    return {
-      beliefs: [],
-      communities: [],
-      godNodes: [],
-      capability,
-      staleRecovered,
-      error: stderrOrMessage(e),
-    };
-  }
+  } catch (e) {}
 
   // 4. Parse output

[NoCoverage] ObjectLiteral
src/infrastructure/graphify-engine.ts:89:12
   try {
     raw = await graphify.query(question);
   } catch (e) {
-    return {
-      beliefs: [],
-      communities: [],
-      godNodes: [],
-      capability,
-      staleRecovered,
-      error: stderrOrMessage(e),
-    };
+    return {};
   }
 

[NoCoverage] ArrayDeclaration
src/infrastructure/graphify-engine.ts:91:20
   } catch (e) {
     return {
       beliefs: [],
-      communities: [],
+      communities: ["Stryker was here"],
       godNodes: [],
       capability,

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:107:9
 
   for (const finding of findings) {
     // Skip AMBIGUOUS — never auto-committed
-    if (finding.confidenceLabel === "AMBIGUOUS" || finding.confidence === null) continue;
+    if (true) continue;
 
     let confidence: number;

[NoCoverage] EqualityOperator
src/infrastructure/graphify-engine.ts:107:9
 
   for (const finding of findings) {
     // Skip AMBIGUOUS — never auto-committed
-    if (finding.confidenceLabel === "AMBIGUOUS" || finding.confidence === null) continue;
+    if (finding.confidenceLabel !== "AMBIGUOUS" || finding.confidence === null) continue;
 
     let confidence: number;

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:111:9
 
     let confidence: number;
 
-    if (finding.confidenceLabel === "EXTRACTED") {
+    if (true) {
       confidence = EXTRACTED_CONFIDENCE;
     } else {

[NoCoverage] EqualityOperator
src/infrastructure/graphify-engine.ts:111:9
 
     let confidence: number;
 
-    if (finding.confidenceLabel === "EXTRACTED") {
+    if (finding.confidenceLabel !== "EXTRACTED") {
       confidence = EXTRACTED_CONFIDENCE;
     } else {

[NoCoverage] BlockStatement
src/infrastructure/graphify-engine.ts:113:12
 
     if (finding.confidenceLabel === "EXTRACTED") {
       confidence = EXTRACTED_CONFIDENCE;
-    } else {
-      // INFERRED → map to nearest tier
-      confidence = mapInferredConfidence(finding.confidence);
-      // STALE penalty on INFERRED only (when graph remained STALE after recovery attempt)
-      if (capability === "STALE" && !staleRecovered) {
-        confidence = applyStalePenalty(confidence);
-      }
-    }
+    } else {}
 
     // God nodes get +0.05 boost

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:117:11
       // INFERRED → map to nearest tier
       confidence = mapInferredConfidence(finding.confidence);
       // STALE penalty on INFERRED only (when graph remained STALE after recovery attempt)
-      if (capability === "STALE" && !staleRecovered) {
+      if (false) {
         confidence = applyStalePenalty(confidence);
       }

[NoCoverage] BlockStatement
src/infrastructure/graphify-engine.ts:117:54
       // INFERRED → map to nearest tier
       confidence = mapInferredConfidence(finding.confidence);
       // STALE penalty on INFERRED only (when graph remained STALE after recovery attempt)
-      if (capability === "STALE" && !staleRecovered) {
-        confidence = applyStalePenalty(confidence);
-      }
+      if (capability === "STALE" && !staleRecovered) {}
     }
 

[NoCoverage] BlockStatement
src/infrastructure/graphify-engine.ts:123:28
     }
 
     // God nodes get +0.05 boost
-    if (finding.isGodNode) {
-      confidence = Math.min(1.0, confidence + 0.05);
-    }
+    if (finding.isGodNode) {}
 
     // Surprising connections get -0.10 deduction (min 0.50)

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:123:9
     }
 
     // God nodes get +0.05 boost
-    if (finding.isGodNode) {
+    if (true) {
       confidence = Math.min(1.0, confidence + 0.05);
     }

[NoCoverage] MethodExpression
src/infrastructure/graphify-engine.ts:124:20
 
     // God nodes get +0.05 boost
     if (finding.isGodNode) {
-      confidence = Math.min(1.0, confidence + 0.05);
+      confidence = Math.max(1.0, confidence + 0.05);
     }
 

[NoCoverage] ArithmeticOperator
src/infrastructure/graphify-engine.ts:124:34
 
     // God nodes get +0.05 boost
     if (finding.isGodNode) {
-      confidence = Math.min(1.0, confidence + 0.05);
+      confidence = Math.min(1.0, confidence - 0.05);
     }
 

[NoCoverage] BlockStatement
src/infrastructure/graphify-engine.ts:129:74
 
     // Surprising connections get -0.10 deduction (min 0.50)
     // EXTRACTED findings are never penalized (contract §7)
-    if (finding.isSurprising && finding.confidenceLabel !== "EXTRACTED") {
-      confidence = Math.max(0.50, confidence - 0.10);
-    }
+    if (finding.isSurprising && finding.confidenceLabel !== "EXTRACTED") {}
 
     const tags: string[] = [];

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:129:33
 
     // Surprising connections get -0.10 deduction (min 0.50)
     // EXTRACTED findings are never penalized (contract §7)
-    if (finding.isSurprising && finding.confidenceLabel !== "EXTRACTED") {
+    if (finding.isSurprising && true) {
       confidence = Math.max(0.50, confidence - 0.10);
     }

[NoCoverage] ArithmeticOperator
src/infrastructure/graphify-engine.ts:130:35
     // Surprising connections get -0.10 deduction (min 0.50)
     // EXTRACTED findings are never penalized (contract §7)
     if (finding.isSurprising && finding.confidenceLabel !== "EXTRACTED") {
-      confidence = Math.max(0.50, confidence - 0.10);
+      confidence = Math.max(0.50, confidence + 0.10);
     }
 

[NoCoverage] MethodExpression
src/infrastructure/graphify-engine.ts:130:20
     // Surprising connections get -0.10 deduction (min 0.50)
     // EXTRACTED findings are never penalized (contract §7)
     if (finding.isSurprising && finding.confidenceLabel !== "EXTRACTED") {
-      confidence = Math.max(0.50, confidence - 0.10);
+      confidence = Math.min(0.50, confidence - 0.10);
     }
 

[NoCoverage] ArrayDeclaration
src/infrastructure/graphify-engine.ts:133:28
       confidence = Math.max(0.50, confidence - 0.10);
     }
 
-    const tags: string[] = [];
+    const tags: string[] = ["Stryker was here"];
     if (finding.community) tags.push(`community:${finding.community}`);
     if (finding.isGodNode) tags.push("god-node");

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:134:9
     }
 
     const tags: string[] = [];
-    if (finding.community) tags.push(`community:${finding.community}`);
+    if (true) tags.push(`community:${finding.community}`);
     if (finding.isGodNode) tags.push("god-node");
     if (finding.isSurprising) tags.push("surprising");

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:134:9
     }
 
     const tags: string[] = [];
-    if (finding.community) tags.push(`community:${finding.community}`);
+    if (false) tags.push(`community:${finding.community}`);
     if (finding.isGodNode) tags.push("god-node");
     if (finding.isSurprising) tags.push("surprising");

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:135:9
 
     const tags: string[] = [];
     if (finding.community) tags.push(`community:${finding.community}`);
-    if (finding.isGodNode) tags.push("god-node");
+    if (false) tags.push("god-node");
     if (finding.isSurprising) tags.push("surprising");
     if (finding.relation) tags.push(`relation:${finding.relation}`);

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:135:9
 
     const tags: string[] = [];
     if (finding.community) tags.push(`community:${finding.community}`);
-    if (finding.isGodNode) tags.push("god-node");
+    if (true) tags.push("god-node");
     if (finding.isSurprising) tags.push("surprising");
     if (finding.relation) tags.push(`relation:${finding.relation}`);

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:136:9
     const tags: string[] = [];
     if (finding.community) tags.push(`community:${finding.community}`);
     if (finding.isGodNode) tags.push("god-node");
-    if (finding.isSurprising) tags.push("surprising");
+    if (true) tags.push("surprising");
     if (finding.relation) tags.push(`relation:${finding.relation}`);
 

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:136:9
     const tags: string[] = [];
     if (finding.community) tags.push(`community:${finding.community}`);
     if (finding.isGodNode) tags.push("god-node");
-    if (finding.isSurprising) tags.push("surprising");
+    if (false) tags.push("surprising");
     if (finding.relation) tags.push(`relation:${finding.relation}`);
 

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:137:9
     if (finding.community) tags.push(`community:${finding.community}`);
     if (finding.isGodNode) tags.push("god-node");
     if (finding.isSurprising) tags.push("surprising");
-    if (finding.relation) tags.push(`relation:${finding.relation}`);
+    if (false) tags.push(`relation:${finding.relation}`);
 
     beliefs.push({

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-engine.ts:137:9
     if (finding.community) tags.push(`community:${finding.community}`);
     if (finding.isGodNode) tags.push("god-node");
     if (finding.isSurprising) tags.push("surprising");
-    if (finding.relation) tags.push(`relation:${finding.relation}`);
+    if (true) tags.push(`relation:${finding.relation}`);
 
     beliefs.push({

[NoCoverage] LogicalOperator
src/infrastructure/graphify-engine.ts:147:19
       communityScope: finding.community,
       metadata: {
         nodeName: finding.nodeName,
-        relation: finding.relation ?? null,
+        relation: finding.relation && null,
         confidenceLabel: finding.confidenceLabel,
       },

[NoCoverage] ArrowFunction
src/infrastructure/graphify-engine.ts:154:51
   }
 
   // Extract communities and god nodes from the flat finding array
-  const communities = [...new Set(findings.filter(f => f.community).map(f => f.community!))];
+  const communities = [...new Set(findings.filter(() => undefined).map(f => f.community!))];
   const godNodes = [...new Set(findings.filter(f => f.isGodNode).map(f => f.nodeName))];
 

[NoCoverage] MethodExpression
src/infrastructure/graphify-engine.ts:154:35
   }
 
   // Extract communities and god nodes from the flat finding array
-  const communities = [...new Set(findings.filter(f => f.community).map(f => f.community!))];
+  const communities = [...new Set(findings.map(f => f.community!))];
   const godNodes = [...new Set(findings.filter(f => f.isGodNode).map(f => f.nodeName))];
 

[NoCoverage] ArrowFunction
src/infrastructure/graphify-engine.ts:155:70
 
   // Extract communities and god nodes from the flat finding array
   const communities = [...new Set(findings.filter(f => f.community).map(f => f.community!))];
-  const godNodes = [...new Set(findings.filter(f => f.isGodNode).map(f => f.nodeName))];
+  const godNodes = [...new Set(findings.filter(f => f.isGodNode).map(() => undefined))];
 
   return {

[NoCoverage] MethodExpression
src/infrastructure/graphify-engine.ts:155:32
 
   // Extract communities and god nodes from the flat finding array
   const communities = [...new Set(findings.filter(f => f.community).map(f => f.community!))];
-  const godNodes = [...new Set(findings.filter(f => f.isGodNode).map(f => f.nodeName))];
+  const godNodes = [...new Set(findings.map(f => f.nodeName))];
 
   return {

[NoCoverage] ObjectLiteral
src/infrastructure/graphify-engine.ts:157:10
   const communities = [...new Set(findings.filter(f => f.community).map(f => f.community!))];
   const godNodes = [...new Set(findings.filter(f => f.isGodNode).map(f => f.nodeName))];
 
-  return {
-    beliefs,
-    communities,
-    godNodes,
-    capability,
-    staleRecovered,
-  };
+  return {};
 }
 
