[NoCoverage] BooleanLiteral
src/infrastructure/graphify-parser.ts:8:27
   const lines = raw.split("\n");
 
   let currentCommunity: string | undefined;
-  let inGodNodesSection = false;
+  let inGodNodesSection = true;
   let inSurprisingSection = false;
 

[NoCoverage] BooleanLiteral
src/infrastructure/graphify-parser.ts:9:29
 
   let currentCommunity: string | undefined;
   let inGodNodesSection = false;
-  let inSurprisingSection = false;
+  let inSurprisingSection = true;
 
   for (const line of lines) {

[NoCoverage] BooleanLiteral
src/infrastructure/graphify-parser.ts:13:9
 
   for (const line of lines) {
     const trimmed = line.trim();
-    if (!trimmed) continue;
+    if (trimmed) continue;
 
     // Detect sections

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-parser.ts:13:9
 
   for (const line of lines) {
     const trimmed = line.trim();
-    if (!trimmed) continue;
+    if (false) continue;
 
     // Detect sections

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-parser.ts:16:9
     if (!trimmed) continue;
 
     // Detect sections
-    if (/community/i.test(trimmed)) {
+    if (true) {
       const match = trimmed.match(/community[:\s]+(.+)/i);
       if (match?.[1]) currentCommunity = match[1].trim();

[NoCoverage] BlockStatement
src/infrastructure/graphify-parser.ts:16:37
     if (!trimmed) continue;
 
     // Detect sections
-    if (/community/i.test(trimmed)) {
-      const match = trimmed.match(/community[:\s]+(.+)/i);
-      if (match?.[1]) currentCommunity = match[1].trim();
-      continue;
-    }
+    if (/community/i.test(trimmed)) {}
     if (/god\s*nodes?/i.test(trimmed)) { inGodNodesSection = true; inSurprisingSection = false; continue; }
     if (/surprising\s*connections?/i.test(trimmed)) { inSurprisingSection = true; inGodNodesSection = false; continue; }

[NoCoverage] Regex
src/infrastructure/graphify-parser.ts:17:35
 
     // Detect sections
     if (/community/i.test(trimmed)) {
-      const match = trimmed.match(/community[:\s]+(.+)/i);
+      const match = trimmed.match(/community[:\s](.+)/i);
       if (match?.[1]) currentCommunity = match[1].trim();
       continue;

[NoCoverage] MethodExpression
src/infrastructure/graphify-parser.ts:18:42
     // Detect sections
     if (/community/i.test(trimmed)) {
       const match = trimmed.match(/community[:\s]+(.+)/i);
-      if (match?.[1]) currentCommunity = match[1].trim();
+      if (match?.[1]) currentCommunity = match[1];
       continue;
     }

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-parser.ts:18:11
     // Detect sections
     if (/community/i.test(trimmed)) {
       const match = trimmed.match(/community[:\s]+(.+)/i);
-      if (match?.[1]) currentCommunity = match[1].trim();
+      if (true) currentCommunity = match[1].trim();
       continue;
     }

[NoCoverage] BooleanLiteral
src/infrastructure/graphify-parser.ts:21:90
       if (match?.[1]) currentCommunity = match[1].trim();
       continue;
     }
-    if (/god\s*nodes?/i.test(trimmed)) { inGodNodesSection = true; inSurprisingSection = false; continue; }
+    if (/god\s*nodes?/i.test(trimmed)) { inGodNodesSection = true; inSurprisingSection = true; continue; }
     if (/surprising\s*connections?/i.test(trimmed)) { inSurprisingSection = true; inGodNodesSection = false; continue; }
     if (/^(results?|nodes?|relations?|edges?|finding|summary)/i.test(trimmed)) {

[NoCoverage] BlockStatement
src/infrastructure/graphify-parser.ts:21:40
       if (match?.[1]) currentCommunity = match[1].trim();
       continue;
     }
-    if (/god\s*nodes?/i.test(trimmed)) { inGodNodesSection = true; inSurprisingSection = false; continue; }
+    if (/god\s*nodes?/i.test(trimmed)) {}
     if (/surprising\s*connections?/i.test(trimmed)) { inSurprisingSection = true; inGodNodesSection = false; continue; }
     if (/^(results?|nodes?|relations?|edges?|finding|summary)/i.test(trimmed)) {

[NoCoverage] BlockStatement
src/infrastructure/graphify-parser.ts:22:53
       continue;
     }
     if (/god\s*nodes?/i.test(trimmed)) { inGodNodesSection = true; inSurprisingSection = false; continue; }
-    if (/surprising\s*connections?/i.test(trimmed)) { inSurprisingSection = true; inGodNodesSection = false; continue; }
+    if (/surprising\s*connections?/i.test(trimmed)) {}
     if (/^(results?|nodes?|relations?|edges?|finding|summary)/i.test(trimmed)) {
       inGodNodesSection = false;

[NoCoverage] BooleanLiteral
src/infrastructure/graphify-parser.ts:22:77
       continue;
     }
     if (/god\s*nodes?/i.test(trimmed)) { inGodNodesSection = true; inSurprisingSection = false; continue; }
-    if (/surprising\s*connections?/i.test(trimmed)) { inSurprisingSection = true; inGodNodesSection = false; continue; }
+    if (/surprising\s*connections?/i.test(trimmed)) { inSurprisingSection = false; inGodNodesSection = false; continue; }
     if (/^(results?|nodes?|relations?|edges?|finding|summary)/i.test(trimmed)) {
       inGodNodesSection = false;

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-parser.ts:23:9
     }
     if (/god\s*nodes?/i.test(trimmed)) { inGodNodesSection = true; inSurprisingSection = false; continue; }
     if (/surprising\s*connections?/i.test(trimmed)) { inSurprisingSection = true; inGodNodesSection = false; continue; }
-    if (/^(results?|nodes?|relations?|edges?|finding|summary)/i.test(trimmed)) {
+    if (true) {
       inGodNodesSection = false;
       inSurprisingSection = false;

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-parser.ts:23:9
     }
     if (/god\s*nodes?/i.test(trimmed)) { inGodNodesSection = true; inSurprisingSection = false; continue; }
     if (/surprising\s*connections?/i.test(trimmed)) { inSurprisingSection = true; inGodNodesSection = false; continue; }
-    if (/^(results?|nodes?|relations?|edges?|finding|summary)/i.test(trimmed)) {
+    if (false) {
       inGodNodesSection = false;
       inSurprisingSection = false;

[NoCoverage] BooleanLiteral
src/infrastructure/graphify-parser.ts:24:27
     if (/god\s*nodes?/i.test(trimmed)) { inGodNodesSection = true; inSurprisingSection = false; continue; }
     if (/surprising\s*connections?/i.test(trimmed)) { inSurprisingSection = true; inGodNodesSection = false; continue; }
     if (/^(results?|nodes?|relations?|edges?|finding|summary)/i.test(trimmed)) {
-      inGodNodesSection = false;
+      inGodNodesSection = true;
       inSurprisingSection = false;
       continue;

[NoCoverage] BooleanLiteral
src/infrastructure/graphify-parser.ts:25:29
     if (/surprising\s*connections?/i.test(trimmed)) { inSurprisingSection = true; inGodNodesSection = false; continue; }
     if (/^(results?|nodes?|relations?|edges?|finding|summary)/i.test(trimmed)) {
       inGodNodesSection = false;
-      inSurprisingSection = false;
+      inSurprisingSection = true;
       continue;
     }

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-parser.ts:36:9
     const inferredMatch = trimmed.match(/\bINFERRED\s+([\d.]+)/i);
     const ambiguousMatch = trimmed.match(/\bAMBIGUOUS\b/i);
 
-    if (extractedMatch) { confidence = 1.0; confidenceLabel = "EXTRACTED"; }
+    if (true) { confidence = 1.0; confidenceLabel = "EXTRACTED"; }
     else if (inferredMatch?.[1]) { confidence = parseFloat(inferredMatch[1]); confidenceLabel = `INFERRED ${inferredMatch[1]}`; }
     else if (ambiguousMatch) { confidence = null; confidenceLabel = "AMBIGUOUS"; }

[NoCoverage] BlockStatement
src/infrastructure/graphify-parser.ts:36:25
     const inferredMatch = trimmed.match(/\bINFERRED\s+([\d.]+)/i);
     const ambiguousMatch = trimmed.match(/\bAMBIGUOUS\b/i);
 
-    if (extractedMatch) { confidence = 1.0; confidenceLabel = "EXTRACTED"; }
+    if (extractedMatch) {}
     else if (inferredMatch?.[1]) { confidence = parseFloat(inferredMatch[1]); confidenceLabel = `INFERRED ${inferredMatch[1]}`; }
     else if (ambiguousMatch) { confidence = null; confidenceLabel = "AMBIGUOUS"; }

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-parser.ts:37:14
     const ambiguousMatch = trimmed.match(/\bAMBIGUOUS\b/i);
 
     if (extractedMatch) { confidence = 1.0; confidenceLabel = "EXTRACTED"; }
-    else if (inferredMatch?.[1]) { confidence = parseFloat(inferredMatch[1]); confidenceLabel = `INFERRED ${inferredMatch[1]}`; }
+    else if (false) { confidence = parseFloat(inferredMatch[1]); confidenceLabel = `INFERRED ${inferredMatch[1]}`; }
     else if (ambiguousMatch) { confidence = null; confidenceLabel = "AMBIGUOUS"; }
 

[NoCoverage] OptionalChaining
src/infrastructure/graphify-parser.ts:37:14
     const ambiguousMatch = trimmed.match(/\bAMBIGUOUS\b/i);
 
     if (extractedMatch) { confidence = 1.0; confidenceLabel = "EXTRACTED"; }
-    else if (inferredMatch?.[1]) { confidence = parseFloat(inferredMatch[1]); confidenceLabel = `INFERRED ${inferredMatch[1]}`; }
+    else if (inferredMatch[1]) { confidence = parseFloat(inferredMatch[1]); confidenceLabel = `INFERRED ${inferredMatch[1]}`; }
     else if (ambiguousMatch) { confidence = null; confidenceLabel = "AMBIGUOUS"; }
 

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-parser.ts:38:14
 
     if (extractedMatch) { confidence = 1.0; confidenceLabel = "EXTRACTED"; }
     else if (inferredMatch?.[1]) { confidence = parseFloat(inferredMatch[1]); confidenceLabel = `INFERRED ${inferredMatch[1]}`; }
-    else if (ambiguousMatch) { confidence = null; confidenceLabel = "AMBIGUOUS"; }
+    else if (true) { confidence = null; confidenceLabel = "AMBIGUOUS"; }
 
     // Extract relation keywords

[NoCoverage] BlockStatement
src/infrastructure/graphify-parser.ts:38:30
 
     if (extractedMatch) { confidence = 1.0; confidenceLabel = "EXTRACTED"; }
     else if (inferredMatch?.[1]) { confidence = parseFloat(inferredMatch[1]); confidenceLabel = `INFERRED ${inferredMatch[1]}`; }
-    else if (ambiguousMatch) { confidence = null; confidenceLabel = "AMBIGUOUS"; }
+    else if (ambiguousMatch) {}
 
     // Extract relation keywords

[NoCoverage] Regex
src/infrastructure/graphify-parser.ts:42:36
 
     // Extract relation keywords
     let relation: string | undefined;
-    const relMatch = trimmed.match(/\b(calls?|imports?|depends?\s*on|implements?|extends?|uses?|contains?|exports?)\b/i);
+    const relMatch = trimmed.match(/\b(calls?|imports?|depends?\s*on|implements?|extends?|uses?|contains|exports?)\b/i);
     if (relMatch?.[1]) relation = relMatch[1].toLowerCase();
 

[NoCoverage] Regex
src/infrastructure/graphify-parser.ts:42:36
 
     // Extract relation keywords
     let relation: string | undefined;
-    const relMatch = trimmed.match(/\b(calls?|imports?|depends?\s*on|implements?|extends?|uses?|contains?|exports?)\b/i);
+    const relMatch = trimmed.match(/\b(calls?|imports|depends?\s*on|implements?|extends?|uses?|contains?|exports?)\b/i);
     if (relMatch?.[1]) relation = relMatch[1].toLowerCase();
 

[NoCoverage] ConditionalExpression
src/infrastructure/graphify-parser.ts:43:9
     // Extract relation keywords
     let relation: string | undefined;
     const relMatch = trimmed.match(/\b(calls?|imports?|depends?\s*on|implements?|extends?|uses?|contains?|exports?)\b/i);
-    if (relMatch?.[1]) relation = relMatch[1].toLowerCase();
+    if (true) relation = relMatch[1].toLowerCase();
 
     // Extract node names (PascalCase or camelCase identifiers)

[NoCoverage] MethodExpression
src/infrastructure/graphify-parser.ts:43:35
     // Extract relation keywords
     let relation: string | undefined;
     const relMatch = trimmed.match(/\b(calls?|imports?|depends?\s*on|implements?|extends?|uses?|contains?|exports?)\b/i);
-    if (relMatch?.[1]) relation = relMatch[1].toLowerCase();
+    if (relMatch?.[1]) relation = relMatch[1].toUpperCase();
 
     // Extract node names (PascalCase or camelCase identifiers)

[NoCoverage] LogicalOperator
src/infrastructure/graphify-parser.ts:46:25
     if (relMatch?.[1]) relation = relMatch[1].toLowerCase();
 
     // Extract node names (PascalCase or camelCase identifiers)
-    const nodeMatches = trimmed.match(/\b([A-Z][a-zA-Z0-9]*(?:\.[A-Z][a-zA-Z0-9]*)*)\b/g)
-      ?? trimmed.match(/\b([a-z][a-zA-Z0-9]+)\b/g) ?? [];
+    const nodeMatches = trimmed.match(/\b([A-Z][a-zA-Z0-9]*(?:\.[A-Z][a-zA-Z0-9]*)*)\b/g) && trimmed.match(/\b([a-z][a-zA-Z0-9]+)\b/g) ?? [];
 
     // Create a finding for this line

[NoCoverage] LogicalOperator
src/infrastructure/graphify-parser.ts:46:25
     if (relMatch?.[1]) relation = relMatch[1].toLowerCase();
 
     // Extract node names (PascalCase or camelCase identifiers)
-    const nodeMatches = trimmed.match(/\b([A-Z][a-zA-Z0-9]*(?:\.[A-Z][a-zA-Z0-9]*)*)\b/g)
-      ?? trimmed.match(/\b([a-z][a-zA-Z0-9]+)\b/g) ?? [];
+    const nodeMatches = (trimmed.match(/\b([A-Z][a-zA-Z0-9]*(?:\.[A-Z][a-zA-Z0-9]*)*)\b/g) ?? trimmed.match(/\b([a-z][a-zA-Z0-9]+)\b/g)) && [];
 
     // Create a finding for this line

[NoCoverage] ArrayDeclaration
src/infrastructure/graphify-parser.ts:47:55
 
     // Extract node names (PascalCase or camelCase identifiers)
     const nodeMatches = trimmed.match(/\b([A-Z][a-zA-Z0-9]*(?:\.[A-Z][a-zA-Z0-9]*)*)\b/g)
-      ?? trimmed.match(/\b([a-z][a-zA-Z0-9]+)\b/g) ?? [];
+      ?? trimmed.match(/\b([a-z][a-zA-Z0-9]+)\b/g) ?? ["Stryker was here"];
 
     // Create a finding for this line

[NoCoverage] Regex
src/infrastructure/graphify-parser.ts:47:24
 
     // Extract node names (PascalCase or camelCase identifiers)
     const nodeMatches = trimmed.match(/\b([A-Z][a-zA-Z0-9]*(?:\.[A-Z][a-zA-Z0-9]*)*)\b/g)
-      ?? trimmed.match(/\b([a-z][a-zA-Z0-9]+)\b/g) ?? [];
+      ?? trimmed.match(/\b([a-z][^a-zA-Z0-9]+)\b/g) ?? [];
 
     // Create a finding for this line

[NoCoverage] LogicalOperator
src/infrastructure/graphify-parser.ts:51:17
 
     // Create a finding for this line
     findings.push({
-      nodeName: nodeMatches[0] ?? trimmed.slice(0, 50),
+      nodeName: nodeMatches[0] && trimmed.slice(0, 50),
       relation,
       confidence,

[NoCoverage] MethodExpression
src/infrastructure/graphify-parser.ts:51:35
 
     // Create a finding for this line
     findings.push({
-      nodeName: nodeMatches[0] ?? trimmed.slice(0, 50),
+      nodeName: nodeMatches[0] ?? trimmed,
       relation,
       confidence,
