[NoCoverage] BlockStatement
src/infrastructure/migrations.ts:6:64
 
 export const MIGRATIONS: Record<number, (state: NoesisState) => NoesisState> = {};
 
-export function runMigrations(state: NoesisState): NoesisState {
-  let current = structuredClone(state);
-  for (let version = current.version; version < CURRENT_VERSION; version++) {
-    const migrate = MIGRATIONS[version];
-    if (!migrate) continue;
-    current = migrate(structuredClone(current));
-    current.version = version + 1;
-  }
-  return current;
-}
+export function runMigrations(state: NoesisState): NoesisState {}
 

[NoCoverage] EqualityOperator
src/infrastructure/migrations.ts:8:39
 
 export function runMigrations(state: NoesisState): NoesisState {
   let current = structuredClone(state);
-  for (let version = current.version; version < CURRENT_VERSION; version++) {
+  for (let version = current.version; version <= CURRENT_VERSION; version++) {
     const migrate = MIGRATIONS[version];
     if (!migrate) continue;

[NoCoverage] UpdateOperator
src/infrastructure/migrations.ts:8:66
 
 export function runMigrations(state: NoesisState): NoesisState {
   let current = structuredClone(state);
-  for (let version = current.version; version < CURRENT_VERSION; version++) {
+  for (let version = current.version; version < CURRENT_VERSION; version--) {
     const migrate = MIGRATIONS[version];
     if (!migrate) continue;

[NoCoverage] BooleanLiteral
src/infrastructure/migrations.ts:10:9
   let current = structuredClone(state);
   for (let version = current.version; version < CURRENT_VERSION; version++) {
     const migrate = MIGRATIONS[version];
-    if (!migrate) continue;
+    if (migrate) continue;
     current = migrate(structuredClone(current));
     current.version = version + 1;

[NoCoverage] ConditionalExpression
src/infrastructure/migrations.ts:10:9
   let current = structuredClone(state);
   for (let version = current.version; version < CURRENT_VERSION; version++) {
     const migrate = MIGRATIONS[version];
-    if (!migrate) continue;
+    if (true) continue;
     current = migrate(structuredClone(current));
     current.version = version + 1;

[NoCoverage] ArithmeticOperator
src/infrastructure/migrations.ts:12:23
     const migrate = MIGRATIONS[version];
     if (!migrate) continue;
     current = migrate(structuredClone(current));
-    current.version = version + 1;
+    current.version = version - 1;
   }
   return current;
