[NoCoverage] BlockStatement
src/infrastructure/obsidian-writer.ts:14:31
 }
 
 export function writeObsidianNote(vaultPath: string, note: ObsidianNote): void {
-  if (!existsSync(vaultPath)) {
-    console.warn(`[noesis] Obsidian vault not found at ${vaultPath}, skipping projection`);
-    return;
-  }
+  if (!existsSync(vaultPath)) {}
 
   const dirName = note.type === "decision" ? "Decisions" : note.type === "learning" ? "Learning" : "Sessions";

[NoCoverage] ConditionalExpression
src/infrastructure/obsidian-writer.ts:14:7
 }
 
 export function writeObsidianNote(vaultPath: string, note: ObsidianNote): void {
-  if (!existsSync(vaultPath)) {
+  if (true) {
     console.warn(`[noesis] Obsidian vault not found at ${vaultPath}, skipping projection`);
     return;

[NoCoverage] EqualityOperator
src/infrastructure/obsidian-writer.ts:19:60
     return;
   }
 
-  const dirName = note.type === "decision" ? "Decisions" : note.type === "learning" ? "Learning" : "Sessions";
+  const dirName = note.type === "decision" ? "Decisions" : note.type !== "learning" ? "Learning" : "Sessions";
   const targetDir = join(vaultPath, dirName);
   if (!existsSync(targetDir)) {

[NoCoverage] EqualityOperator
src/infrastructure/obsidian-writer.ts:19:19
     return;
   }
 
-  const dirName = note.type === "decision" ? "Decisions" : note.type === "learning" ? "Learning" : "Sessions";
+  const dirName = note.type !== "decision" ? "Decisions" : note.type === "learning" ? "Learning" : "Sessions";
   const targetDir = join(vaultPath, dirName);
   if (!existsSync(targetDir)) {

[NoCoverage] ConditionalExpression
src/infrastructure/obsidian-writer.ts:21:7
 
   const dirName = note.type === "decision" ? "Decisions" : note.type === "learning" ? "Learning" : "Sessions";
   const targetDir = join(vaultPath, dirName);
-  if (!existsSync(targetDir)) {
+  if (false) {
     mkdirSync(targetDir, { recursive: true });
   }

[NoCoverage] BlockStatement
src/infrastructure/obsidian-writer.ts:21:31
 
   const dirName = note.type === "decision" ? "Decisions" : note.type === "learning" ? "Learning" : "Sessions";
   const targetDir = join(vaultPath, dirName);
-  if (!existsSync(targetDir)) {
-    mkdirSync(targetDir, { recursive: true });
-  }
+  if (!existsSync(targetDir)) {}
 
   const slug = slugify(note.title, 48);

[NoCoverage] BooleanLiteral
src/infrastructure/obsidian-writer.ts:22:39
   const dirName = note.type === "decision" ? "Decisions" : note.type === "learning" ? "Learning" : "Sessions";
   const targetDir = join(vaultPath, dirName);
   if (!existsSync(targetDir)) {
-    mkdirSync(targetDir, { recursive: true });
+    mkdirSync(targetDir, { recursive: false });
   }
 

[NoCoverage] StringLiteral
src/infrastructure/obsidian-writer.ts:31:16
 
   // Build frontmatter
   const fmLines: string[] = ["---"];
-  fmLines.push(`type: ${note.type}`);
+  fmLines.push(``);
   if (note.status) fmLines.push(`status: ${note.status}`);
   for (const [key, value] of Object.entries(note.frontmatter)) {

[NoCoverage] ConditionalExpression
src/infrastructure/obsidian-writer.ts:32:7
   // Build frontmatter
   const fmLines: string[] = ["---"];
   fmLines.push(`type: ${note.type}`);
-  if (note.status) fmLines.push(`status: ${note.status}`);
+  if (true) fmLines.push(`status: ${note.status}`);
   for (const [key, value] of Object.entries(note.frontmatter)) {
     fmLines.push(`${key}: ${JSON.stringify(value)}`);

[NoCoverage] ConditionalExpression
src/infrastructure/obsidian-writer.ts:32:7
   // Build frontmatter
   const fmLines: string[] = ["---"];
   fmLines.push(`type: ${note.type}`);
-  if (note.status) fmLines.push(`status: ${note.status}`);
+  if (false) fmLines.push(`status: ${note.status}`);
   for (const [key, value] of Object.entries(note.frontmatter)) {
     fmLines.push(`${key}: ${JSON.stringify(value)}`);

[NoCoverage] BlockStatement
src/infrastructure/obsidian-writer.ts:33:64
   const fmLines: string[] = ["---"];
   fmLines.push(`type: ${note.type}`);
   if (note.status) fmLines.push(`status: ${note.status}`);
-  for (const [key, value] of Object.entries(note.frontmatter)) {
-    fmLines.push(`${key}: ${JSON.stringify(value)}`);
-  }
+  for (const [key, value] of Object.entries(note.frontmatter)) {}
   fmLines.push("---", "");
 

[NoCoverage] StringLiteral
src/infrastructure/obsidian-writer.ts:36:16
   for (const [key, value] of Object.entries(note.frontmatter)) {
     fmLines.push(`${key}: ${JSON.stringify(value)}`);
   }
-  fmLines.push("---", "");
+  fmLines.push("", "");
 
   const content = [...fmLines, `# ${note.title}`, "", note.body].join("\n");

[NoCoverage] StringLiteral
src/infrastructure/obsidian-writer.ts:36:23
   for (const [key, value] of Object.entries(note.frontmatter)) {
     fmLines.push(`${key}: ${JSON.stringify(value)}`);
   }
-  fmLines.push("---", "");
+  fmLines.push("---", "Stryker was here!");
 
   const content = [...fmLines, `# ${note.title}`, "", note.body].join("\n");

[NoCoverage] ArrayDeclaration
src/infrastructure/obsidian-writer.ts:38:19
   }
   fmLines.push("---", "");
 
-  const content = [...fmLines, `# ${note.title}`, "", note.body].join("\n");
+  const content = [].join("\n");
 
   // Atomic write: temp → fsync → rename

[NoCoverage] StringLiteral
src/infrastructure/obsidian-writer.ts:38:51
   }
   fmLines.push("---", "");
 
-  const content = [...fmLines, `# ${note.title}`, "", note.body].join("\n");
+  const content = [...fmLines, `# ${note.title}`, "Stryker was here!", note.body].join("\n");
 
   // Atomic write: temp → fsync → rename

[NoCoverage] BlockStatement
src/infrastructure/obsidian-writer.ts:42:7
 
   // Atomic write: temp → fsync → rename
   const tempPath = `${filePath}.tmp.${process.pid}`;
-  try {
-    ensureDir(targetDir);
-    const fd = openSync(tempPath, "w");
-    writeFileSync(fd, content);
-    fsyncSync(fd);
-    closeSync(fd);
-    renameSync(tempPath, filePath);
-  } catch (err) {
+  try {} catch (err) {
     console.warn(`[noesis] Failed to write Obsidian note ${filePath}:`, err);
     // Cleanup temp file if it exists

[NoCoverage] BlockStatement
src/infrastructure/obsidian-writer.ts:49:17
     fsyncSync(fd);
     closeSync(fd);
     renameSync(tempPath, filePath);
-  } catch (err) {
-    console.warn(`[noesis] Failed to write Obsidian note ${filePath}:`, err);
-    // Cleanup temp file if it exists
-    try { require("node:fs").unlinkSync(tempPath); } catch { /* ignore */ }
-  }
+  } catch (err) {}
 }
 

[NoCoverage] BlockStatement
src/infrastructure/obsidian-writer.ts:52:9
   } catch (err) {
     console.warn(`[noesis] Failed to write Obsidian note ${filePath}:`, err);
     // Cleanup temp file if it exists
-    try { require("node:fs").unlinkSync(tempPath); } catch { /* ignore */ }
+    try {} catch { /* ignore */ }
   }
 }

[NoCoverage] BlockStatement
src/infrastructure/obsidian-writer.ts:56:39
   }
 }
 
-function ensureDir(dir: string): void {
-  if (!existsSync(dir)) {
-    mkdirSync(dir, { recursive: true });
-  }
-}
+function ensureDir(dir: string): void {}
 

[NoCoverage] BlockStatement
src/infrastructure/obsidian-writer.ts:57:25
 }
 
 function ensureDir(dir: string): void {
-  if (!existsSync(dir)) {
-    mkdirSync(dir, { recursive: true });
-  }
+  if (!existsSync(dir)) {}
 }
 

[NoCoverage] ConditionalExpression
src/infrastructure/obsidian-writer.ts:57:7
 }
 
 function ensureDir(dir: string): void {
-  if (!existsSync(dir)) {
+  if (true) {
     mkdirSync(dir, { recursive: true });
   }
