[NoCoverage] BooleanLiteral
src/infrastructure/state-manager.ts:9:29
  */
 export class StateManager {
   private _state: NoesisState;
-  private _attentionDirty = false;
+  private _attentionDirty = true;
 
   constructor(private root: string) {

[NoCoverage] BlockStatement
src/infrastructure/state-manager.ts:11:37
   private _state: NoesisState;
   private _attentionDirty = false;
 
-  constructor(private root: string) {
-    this._state = loadState(root);
-  }
+  constructor(private root: string) {}
 
   get rootPath(): string {

[NoCoverage] BlockStatement
src/infrastructure/state-manager.ts:15:26
     this._state = loadState(root);
   }
 
-  get rootPath(): string {
-    return this.root;
-  }
+  get rootPath(): string {}
 
   read(): NoesisState {

[NoCoverage] BlockStatement
src/infrastructure/state-manager.ts:19:23
     return this.root;
   }
 
-  read(): NoesisState {
-    return this._state;
-  }
+  read(): NoesisState {}
 
   mutate(fn: (state: NoesisState) => void): void {

[NoCoverage] BlockStatement
src/infrastructure/state-manager.ts:23:50
     return this._state;
   }
 
-  mutate(fn: (state: NoesisState) => void): void {
-    const before = structuredClone(this._state);
-    fn(this._state);
-
-    if (stateEqual(before, this._state)) return;
-    if (sameExceptAttention(before, this._state)) {
-      this._attentionDirty = true;
-      return;
-    }
-
-    saveState(this.root, this._state);
-  }
+  mutate(fn: (state: NoesisState) => void): void {}
 
   checkpointAttention(): void {

[NoCoverage] ConditionalExpression
src/infrastructure/state-manager.ts:27:9
     const before = structuredClone(this._state);
     fn(this._state);
 
-    if (stateEqual(before, this._state)) return;
+    if (false) return;
     if (sameExceptAttention(before, this._state)) {
       this._attentionDirty = true;

[NoCoverage] ConditionalExpression
src/infrastructure/state-manager.ts:27:9
     const before = structuredClone(this._state);
     fn(this._state);
 
-    if (stateEqual(before, this._state)) return;
+    if (true) return;
     if (sameExceptAttention(before, this._state)) {
       this._attentionDirty = true;

[NoCoverage] BlockStatement
src/infrastructure/state-manager.ts:28:51
     fn(this._state);
 
     if (stateEqual(before, this._state)) return;
-    if (sameExceptAttention(before, this._state)) {
-      this._attentionDirty = true;
-      return;
-    }
+    if (sameExceptAttention(before, this._state)) {}
 
     saveState(this.root, this._state);

[NoCoverage] ConditionalExpression
src/infrastructure/state-manager.ts:28:9
     fn(this._state);
 
     if (stateEqual(before, this._state)) return;
-    if (sameExceptAttention(before, this._state)) {
+    if (true) {
       this._attentionDirty = true;
       return;

[NoCoverage] BooleanLiteral
src/infrastructure/state-manager.ts:29:30
 
     if (stateEqual(before, this._state)) return;
     if (sameExceptAttention(before, this._state)) {
-      this._attentionDirty = true;
+      this._attentionDirty = false;
       return;
     }

[NoCoverage] BlockStatement
src/infrastructure/state-manager.ts:36:31
     saveState(this.root, this._state);
   }
 
-  checkpointAttention(): void {
-    if (!this._attentionDirty) return;
-    saveState(this.root, this._state);
-    this._attentionDirty = false;
-  }
+  checkpointAttention(): void {}
 
   invalidateAfterCompaction(): void {

[NoCoverage] ConditionalExpression
src/infrastructure/state-manager.ts:37:9
   }
 
   checkpointAttention(): void {
-    if (!this._attentionDirty) return;
+    if (false) return;
     saveState(this.root, this._state);
     this._attentionDirty = false;

[NoCoverage] BooleanLiteral
src/infrastructure/state-manager.ts:37:9
   }
 
   checkpointAttention(): void {
-    if (!this._attentionDirty) return;
+    if (this._attentionDirty) return;
     saveState(this.root, this._state);
     this._attentionDirty = false;

[NoCoverage] BooleanLiteral
src/infrastructure/state-manager.ts:39:28
   checkpointAttention(): void {
     if (!this._attentionDirty) return;
     saveState(this.root, this._state);
-    this._attentionDirty = false;
+    this._attentionDirty = true;
   }
 

[NoCoverage] BlockStatement
src/infrastructure/state-manager.ts:42:37
     this._attentionDirty = false;
   }
 
-  invalidateAfterCompaction(): void {
-    this._state = loadState(this.root);
-    this._attentionDirty = false;
-  }
+  invalidateAfterCompaction(): void {}
 }
 

[NoCoverage] BooleanLiteral
src/infrastructure/state-manager.ts:44:28
 
   invalidateAfterCompaction(): void {
     this._state = loadState(this.root);
-    this._attentionDirty = false;
+    this._attentionDirty = true;
   }
 }

[NoCoverage] BlockStatement
src/infrastructure/state-manager.ts:48:69
   }
 }
 
-function stateEqual(left: NoesisState, right: NoesisState): boolean {
-  return JSON.stringify(left) === JSON.stringify(right);
-}
+function stateEqual(left: NoesisState, right: NoesisState): boolean {}
 
 function sameExceptAttention(left: NoesisState, right: NoesisState): boolean {

[NoCoverage] ConditionalExpression
src/infrastructure/state-manager.ts:49:10
 }
 
 function stateEqual(left: NoesisState, right: NoesisState): boolean {
-  return JSON.stringify(left) === JSON.stringify(right);
+  return false;
 }
 

[NoCoverage] ConditionalExpression
src/infrastructure/state-manager.ts:49:10
 }
 
 function stateEqual(left: NoesisState, right: NoesisState): boolean {
-  return JSON.stringify(left) === JSON.stringify(right);
+  return true;
 }
 

[NoCoverage] BlockStatement
src/infrastructure/state-manager.ts:52:78
   return JSON.stringify(left) === JSON.stringify(right);
 }
 
-function sameExceptAttention(left: NoesisState, right: NoesisState): boolean {
-  const leftClone: Partial<NoesisState> = structuredClone(left);
-  const rightClone: Partial<NoesisState> = structuredClone(right);
-  delete leftClone.attention;
-  delete rightClone.attention;
-  return JSON.stringify(leftClone) === JSON.stringify(rightClone);
-}
+function sameExceptAttention(left: NoesisState, right: NoesisState): boolean {}
 

[NoCoverage] EqualityOperator
src/infrastructure/state-manager.ts:57:10
   const rightClone: Partial<NoesisState> = structuredClone(right);
   delete leftClone.attention;
   delete rightClone.attention;
-  return JSON.stringify(leftClone) === JSON.stringify(rightClone);
+  return JSON.stringify(leftClone) !== JSON.stringify(rightClone);
 }
 

[NoCoverage] ConditionalExpression
src/infrastructure/state-manager.ts:57:10
   const rightClone: Partial<NoesisState> = structuredClone(right);
   delete leftClone.attention;
   delete rightClone.attention;
-  return JSON.stringify(leftClone) === JSON.stringify(rightClone);
+  return false;
 }
 
