[NoCoverage] BlockStatement
src/rendering/focus-resolver.ts:3:82
 import type { NoesisState } from "../schema.js";
 
-export function resolveFocus(state: NoesisState, explicitFocus?: string): string {
-  if (explicitFocus && explicitFocus.trim().length > 0) {
-    return explicitFocus.trim();
-  }
-  if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {
-    return state.commitment.workflow.goal.trim();
-  }
-  if (state.attention.focus && state.attention.focus.trim().length > 0) {
-    return state.attention.focus.trim();
-  }
-  return "No active focus. Use noesis_attend to set one.";
-}
+export function resolveFocus(state: NoesisState, explicitFocus?: string): string {}
 

[NoCoverage] EqualityOperator
src/rendering/focus-resolver.ts:4:24
 import type { NoesisState } from "../schema.js";
 
 export function resolveFocus(state: NoesisState, explicitFocus?: string): string {
-  if (explicitFocus && explicitFocus.trim().length > 0) {
+  if (explicitFocus && explicitFocus.trim().length >= 0) {
     return explicitFocus.trim();
   }

[NoCoverage] ConditionalExpression
src/rendering/focus-resolver.ts:4:7
 import type { NoesisState } from "../schema.js";
 
 export function resolveFocus(state: NoesisState, explicitFocus?: string): string {
-  if (explicitFocus && explicitFocus.trim().length > 0) {
+  if (true) {
     return explicitFocus.trim();
   }

[NoCoverage] MethodExpression
src/rendering/focus-resolver.ts:5:12
 
 export function resolveFocus(state: NoesisState, explicitFocus?: string): string {
   if (explicitFocus && explicitFocus.trim().length > 0) {
-    return explicitFocus.trim();
+    return explicitFocus;
   }
   if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {

[NoCoverage] BlockStatement
src/rendering/focus-resolver.ts:7:91
   if (explicitFocus && explicitFocus.trim().length > 0) {
     return explicitFocus.trim();
   }
-  if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {
-    return state.commitment.workflow.goal.trim();
-  }
+  if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {}
   if (state.attention.focus && state.attention.focus.trim().length > 0) {
     return state.attention.focus.trim();

[NoCoverage] MethodExpression
src/rendering/focus-resolver.ts:7:41
   if (explicitFocus && explicitFocus.trim().length > 0) {
     return explicitFocus.trim();
   }
-  if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {
+  if (state.commitment.workflow.goal && state.commitment.workflow.goal.length > 0) {
     return state.commitment.workflow.goal.trim();
   }

[NoCoverage] MethodExpression
src/rendering/focus-resolver.ts:8:12
     return explicitFocus.trim();
   }
   if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {
-    return state.commitment.workflow.goal.trim();
+    return state.commitment.workflow.goal;
   }
   if (state.attention.focus && state.attention.focus.trim().length > 0) {

[NoCoverage] EqualityOperator
src/rendering/focus-resolver.ts:10:32
   if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {
     return state.commitment.workflow.goal.trim();
   }
-  if (state.attention.focus && state.attention.focus.trim().length > 0) {
+  if (state.attention.focus && state.attention.focus.trim().length >= 0) {
     return state.attention.focus.trim();
   }

[NoCoverage] ConditionalExpression
src/rendering/focus-resolver.ts:10:32
   if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {
     return state.commitment.workflow.goal.trim();
   }
-  if (state.attention.focus && state.attention.focus.trim().length > 0) {
+  if (state.attention.focus && true) {
     return state.attention.focus.trim();
   }

[NoCoverage] MethodExpression
src/rendering/focus-resolver.ts:11:12
     return state.commitment.workflow.goal.trim();
   }
   if (state.attention.focus && state.attention.focus.trim().length > 0) {
-    return state.attention.focus.trim();
+    return state.attention.focus;
   }
   return "No active focus. Use noesis_attend to set one.";

[NoCoverage] StringLiteral
src/rendering/focus-resolver.ts:13:10
   if (state.attention.focus && state.attention.focus.trim().length > 0) {
     return state.attention.focus.trim();
   }
-  return "No active focus. Use noesis_attend to set one.";
+  return "";
 }
 
