[Killed] BlockStatement
src/rendering/preamble-builder.ts:10:39
 import { estimateTokens } from "../shared/tokens.js";
 import { stripTransientState } from "./state-cleanup.js";
 
-function escapeXml(s: string): string {
-  return s.replace(/&/g, "&amp;")
-          .replace(/</g, "&lt;")
-          .replace(/>/g, "&gt;")
-          .replace(/"/g, "&quot;")
-          .replace(/'/g, "&apos;");
-}
+function escapeXml(s: string): string {}
 
 import {
killedBy: Belief Revision Properties 100 random states produce preamble ≤ 2000 tokens
statusReason: text is not iterable

[Survived] StringLiteral
src/rendering/preamble-builder.ts:11:26
 import { stripTransientState } from "./state-cleanup.js";
 
 function escapeXml(s: string): string {
-  return s.replace(/&/g, "&amp;")
+  return s.replace(/&/g, "")
           .replace(/</g, "&lt;")
           .replace(/>/g, "&gt;")

[Survived] StringLiteral
src/rendering/preamble-builder.ts:15:26
           .replace(/</g, "&lt;")
           .replace(/>/g, "&gt;")
           .replace(/"/g, "&quot;")
-          .replace(/'/g, "&apos;");
+          .replace(/'/g, "");
 }
 

[Survived] ArrowFunction
src/rendering/preamble-builder.ts:42:49
 }
 
 export function buildPreamble(state: NoesisState, opts: PreambleOpts): string {
-  const activeFacts = state.belief.facts.filter((fact) => fact.status === "active");
+  const activeFacts = state.belief.facts.filter(() => undefined);
   const lowConfFacts = activeFacts.filter((fact) => fact.confidence < 0.75 && fact.confidence >= 0.5);
   const resolvedLearning = state.learning.failures.filter((entry) => entry.rootCause && entry.fix).length;

[Survived] ConditionalExpression
src/rendering/preamble-builder.ts:42:59
 }
 
 export function buildPreamble(state: NoesisState, opts: PreambleOpts): string {
-  const activeFacts = state.belief.facts.filter((fact) => fact.status === "active");
+  const activeFacts = state.belief.facts.filter((fact) => true);
   const lowConfFacts = activeFacts.filter((fact) => fact.confidence < 0.75 && fact.confidence >= 0.5);
   const resolvedLearning = state.learning.failures.filter((entry) => entry.rootCause && entry.fix).length;

[Survived] EqualityOperator
src/rendering/preamble-builder.ts:43:79
 
 export function buildPreamble(state: NoesisState, opts: PreambleOpts): string {
   const activeFacts = state.belief.facts.filter((fact) => fact.status === "active");
-  const lowConfFacts = activeFacts.filter((fact) => fact.confidence < 0.75 && fact.confidence >= 0.5);
+  const lowConfFacts = activeFacts.filter((fact) => fact.confidence < 0.75 && fact.confidence < 0.5);
   const resolvedLearning = state.learning.failures.filter((entry) => entry.rootCause && entry.fix).length;
   const findings = state.attention.graphFindings ?? [];

[Survived] EqualityOperator
src/rendering/preamble-builder.ts:43:53
 
 export function buildPreamble(state: NoesisState, opts: PreambleOpts): string {
   const activeFacts = state.belief.facts.filter((fact) => fact.status === "active");
-  const lowConfFacts = activeFacts.filter((fact) => fact.confidence < 0.75 && fact.confidence >= 0.5);
+  const lowConfFacts = activeFacts.filter((fact) => fact.confidence >= 0.75 && fact.confidence >= 0.5);
   const resolvedLearning = state.learning.failures.filter((entry) => entry.rootCause && entry.fix).length;
   const findings = state.attention.graphFindings ?? [];

[Survived] ConditionalExpression
src/rendering/preamble-builder.ts:44:70
 export function buildPreamble(state: NoesisState, opts: PreambleOpts): string {
   const activeFacts = state.belief.facts.filter((fact) => fact.status === "active");
   const lowConfFacts = activeFacts.filter((fact) => fact.confidence < 0.75 && fact.confidence >= 0.5);
-  const resolvedLearning = state.learning.failures.filter((entry) => entry.rootCause && entry.fix).length;
+  const resolvedLearning = state.learning.failures.filter((entry) => false).length;
   const findings = state.attention.graphFindings ?? [];
   const sections: string[] = [

[Survived] ConditionalExpression
src/rendering/preamble-builder.ts:44:70
 export function buildPreamble(state: NoesisState, opts: PreambleOpts): string {
   const activeFacts = state.belief.facts.filter((fact) => fact.status === "active");
   const lowConfFacts = activeFacts.filter((fact) => fact.confidence < 0.75 && fact.confidence >= 0.5);
-  const resolvedLearning = state.learning.failures.filter((entry) => entry.rootCause && entry.fix).length;
+  const resolvedLearning = state.learning.failures.filter((entry) => true).length;
   const findings = state.attention.graphFindings ?? [];
   const sections: string[] = [

[Killed] LogicalOperator
src/rendering/preamble-builder.ts:45:20
   const activeFacts = state.belief.facts.filter((fact) => fact.status === "active");
   const lowConfFacts = activeFacts.filter((fact) => fact.confidence < 0.75 && fact.confidence >= 0.5);
   const resolvedLearning = state.learning.failures.filter((entry) => entry.rootCause && entry.fix).length;
-  const findings = state.attention.graphFindings ?? [];
+  const findings = state.attention.graphFindings && [];
   const sections: string[] = [
     `[Noesis] Graphify: ${opts.capability} | Project: ${opts.projectName} | ` +
killedBy: Belief Revision Properties 100 random states produce preamble ≤ 2000 tokens
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] BooleanLiteral
src/rendering/preamble-builder.ts:53:67
   ];
 
   pushIf(sections, formatWorkSection(state.commitment.workflow.goal, state.commitment.workflow.steps));
-  pushIf(sections, formatDecisionsSection(state.belief.decisions, true));
+  pushIf(sections, formatDecisionsSection(state.belief.decisions, false));
   pushIf(sections, formatBeliefsSection(activeFacts, true));
   pushIf(sections, formatGraphSection(findings));

[Survived] BooleanLiteral
src/rendering/preamble-builder.ts:54:54
 
   pushIf(sections, formatWorkSection(state.commitment.workflow.goal, state.commitment.workflow.steps));
   pushIf(sections, formatDecisionsSection(state.belief.decisions, true));
-  pushIf(sections, formatBeliefsSection(activeFacts, true));
+  pushIf(sections, formatBeliefsSection(activeFacts, false));
   pushIf(sections, formatGraphSection(findings));
   pushIf(sections, formatHypothesesSection(state.inference.hypotheses, true));

[Survived] BooleanLiteral
src/rendering/preamble-builder.ts:56:72
   pushIf(sections, formatDecisionsSection(state.belief.decisions, true));
   pushIf(sections, formatBeliefsSection(activeFacts, true));
   pushIf(sections, formatGraphSection(findings));
-  pushIf(sections, formatHypothesesSection(state.inference.hypotheses, true));
+  pushIf(sections, formatHypothesesSection(state.inference.hypotheses, false));
   pushIf(sections, formatLearningSection(opts.learningRanked, true));
 

[Survived] BooleanLiteral
src/rendering/preamble-builder.ts:57:63
   pushIf(sections, formatBeliefsSection(activeFacts, true));
   pushIf(sections, formatGraphSection(findings));
   pushIf(sections, formatHypothesesSection(state.inference.hypotheses, true));
-  pushIf(sections, formatLearningSection(opts.learningRanked, true));
+  pushIf(sections, formatLearningSection(opts.learningRanked, false));
 
   const notes = [

[Survived] ArrowFunction
src/rendering/preamble-builder.ts:60:28
   pushIf(sections, formatLearningSection(opts.learningRanked, true));
 
   const notes = [
-    ...opts.staleNotes.map((note) => `⚠ ${note.message}`),
+    ...opts.staleNotes.map(() => undefined),
     ...(opts.consistencyWarnings ?? []).map((warning) => `⚠ ${warning}`),
   ];

[Survived] ArrowFunction
src/rendering/preamble-builder.ts:61:45
 
   const notes = [
     ...opts.staleNotes.map((note) => `⚠ ${note.message}`),
-    ...(opts.consistencyWarnings ?? []).map((warning) => `⚠ ${warning}`),
+    ...(opts.consistencyWarnings ?? []).map(() => undefined),
   ];
   pushIf(sections, notes.length > 0 ? `[Notes]\n${notes.join("\n")}` : undefined);

[Survived] LogicalOperator
src/rendering/preamble-builder.ts:61:9
 
   const notes = [
     ...opts.staleNotes.map((note) => `⚠ ${note.message}`),
-    ...(opts.consistencyWarnings ?? []).map((warning) => `⚠ ${warning}`),
+    ...(opts.consistencyWarnings && []).map((warning) => `⚠ ${warning}`),
   ];
   pushIf(sections, notes.length > 0 ? `[Notes]\n${notes.join("\n")}` : undefined);

[Survived] EqualityOperator
src/rendering/preamble-builder.ts:63:20
     ...opts.staleNotes.map((note) => `⚠ ${note.message}`),
     ...(opts.consistencyWarnings ?? []).map((warning) => `⚠ ${warning}`),
   ];
-  pushIf(sections, notes.length > 0 ? `[Notes]\n${notes.join("\n")}` : undefined);
+  pushIf(sections, notes.length >= 0 ? `[Notes]\n${notes.join("\n")}` : undefined);
 
   const preamble = escapeXml(sections.join("\n\n"));

[Survived] ConditionalExpression
src/rendering/preamble-builder.ts:63:20
     ...opts.staleNotes.map((note) => `⚠ ${note.message}`),
     ...(opts.consistencyWarnings ?? []).map((warning) => `⚠ ${warning}`),
   ];
-  pushIf(sections, notes.length > 0 ? `[Notes]\n${notes.join("\n")}` : undefined);
+  pushIf(sections, true ? `[Notes]\n${notes.join("\n")}` : undefined);
 
   const preamble = escapeXml(sections.join("\n\n"));

[Survived] ConditionalExpression
src/rendering/preamble-builder.ts:66:10
   pushIf(sections, notes.length > 0 ? `[Notes]\n${notes.join("\n")}` : undefined);
 
   const preamble = escapeXml(sections.join("\n\n"));
-  return estimateTokens(preamble) <= MAX_TOKENS ? preamble : trimToBudget(preamble, state);
+  return false ? preamble : trimToBudget(preamble, state);
 }
 

[Survived] ConditionalExpression
src/rendering/preamble-builder.ts:66:10
   pushIf(sections, notes.length > 0 ? `[Notes]\n${notes.join("\n")}` : undefined);
 
   const preamble = escapeXml(sections.join("\n\n"));
-  return estimateTokens(preamble) <= MAX_TOKENS ? preamble : trimToBudget(preamble, state);
+  return true ? preamble : trimToBudget(preamble, state);
 }
 

[Survived] BlockStatement
src/rendering/preamble-builder.ts:69:68
   return estimateTokens(preamble) <= MAX_TOKENS ? preamble : trimToBudget(preamble, state);
 }
 
-function pushIf(target: string[], value: string | undefined): void {
-  if (value) target.push(value);
-}
+function pushIf(target: string[], value: string | undefined): void {}
 
 function trimToBudget(preamble: string, state: NoesisState): string {

[Survived] ConditionalExpression
src/rendering/preamble-builder.ts:70:7
 }
 
 function pushIf(target: string[], value: string | undefined): void {
-  if (value) target.push(value);
+  if (false) target.push(value);
 }
 

[Survived] ConditionalExpression
src/rendering/preamble-builder.ts:70:7
 }
 
 function pushIf(target: string[], value: string | undefined): void {
-  if (value) target.push(value);
+  if (true) target.push(value);
 }
 

[NoCoverage] BlockStatement
src/rendering/preamble-builder.ts:73:69
   if (value) target.push(value);
 }
 
-function trimToBudget(preamble: string, state: NoesisState): string {
-  let result = preamble;
-  const maxChars = MAX_TOKENS * 4;
-
-  if (estimateTokens(result) > MAX_TOKENS) {
-    const beliefsSection = formatBeliefsSection(state.belief.facts, true);
-    if (beliefsSection) result = result.replace(/\[Beliefs\][\s\S]*?(?=\n\n\[|\n*$)/, escapeXml(beliefsSection));
-  }
-
-  if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Learning\][\s\S]*?(?=\n\n\[|\n*$)/, "");
-  if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Hypotheses\][\s\S]*?(?=\n\n\[|\n*$)/, "");
-
-  return result.length > maxChars ? `${result.slice(0, maxChars - 3)}...` : result;
-}
+function trimToBudget(preamble: string, state: NoesisState): string {}
 
 export function buildSubagentPreamble(state: NoesisState, _taskFilter?: string): string {

[NoCoverage] ArithmeticOperator
src/rendering/preamble-builder.ts:75:20
 
 function trimToBudget(preamble: string, state: NoesisState): string {
   let result = preamble;
-  const maxChars = MAX_TOKENS * 4;
+  const maxChars = MAX_TOKENS / 4;
 
   if (estimateTokens(result) > MAX_TOKENS) {

[NoCoverage] BlockStatement
src/rendering/preamble-builder.ts:77:44
   let result = preamble;
   const maxChars = MAX_TOKENS * 4;
 
-  if (estimateTokens(result) > MAX_TOKENS) {
-    const beliefsSection = formatBeliefsSection(state.belief.facts, true);
-    if (beliefsSection) result = result.replace(/\[Beliefs\][\s\S]*?(?=\n\n\[|\n*$)/, escapeXml(beliefsSection));
-  }
+  if (estimateTokens(result) > MAX_TOKENS) {}
 
   if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Learning\][\s\S]*?(?=\n\n\[|\n*$)/, "");

[NoCoverage] ConditionalExpression
src/rendering/preamble-builder.ts:77:7
   let result = preamble;
   const maxChars = MAX_TOKENS * 4;
 
-  if (estimateTokens(result) > MAX_TOKENS) {
+  if (false) {
     const beliefsSection = formatBeliefsSection(state.belief.facts, true);
     if (beliefsSection) result = result.replace(/\[Beliefs\][\s\S]*?(?=\n\n\[|\n*$)/, escapeXml(beliefsSection));

[NoCoverage] BooleanLiteral
src/rendering/preamble-builder.ts:78:69
   const maxChars = MAX_TOKENS * 4;
 
   if (estimateTokens(result) > MAX_TOKENS) {
-    const beliefsSection = formatBeliefsSection(state.belief.facts, true);
+    const beliefsSection = formatBeliefsSection(state.belief.facts, false);
     if (beliefsSection) result = result.replace(/\[Beliefs\][\s\S]*?(?=\n\n\[|\n*$)/, escapeXml(beliefsSection));
   }

[NoCoverage] ConditionalExpression
src/rendering/preamble-builder.ts:79:9
 
   if (estimateTokens(result) > MAX_TOKENS) {
     const beliefsSection = formatBeliefsSection(state.belief.facts, true);
-    if (beliefsSection) result = result.replace(/\[Beliefs\][\s\S]*?(?=\n\n\[|\n*$)/, escapeXml(beliefsSection));
+    if (false) result = result.replace(/\[Beliefs\][\s\S]*?(?=\n\n\[|\n*$)/, escapeXml(beliefsSection));
   }
 

[NoCoverage] ConditionalExpression
src/rendering/preamble-builder.ts:79:9
 
   if (estimateTokens(result) > MAX_TOKENS) {
     const beliefsSection = formatBeliefsSection(state.belief.facts, true);
-    if (beliefsSection) result = result.replace(/\[Beliefs\][\s\S]*?(?=\n\n\[|\n*$)/, escapeXml(beliefsSection));
+    if (true) result = result.replace(/\[Beliefs\][\s\S]*?(?=\n\n\[|\n*$)/, escapeXml(beliefsSection));
   }
 

[NoCoverage] EqualityOperator
src/rendering/preamble-builder.ts:82:7
     if (beliefsSection) result = result.replace(/\[Beliefs\][\s\S]*?(?=\n\n\[|\n*$)/, escapeXml(beliefsSection));
   }
 
-  if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Learning\][\s\S]*?(?=\n\n\[|\n*$)/, "");
+  if (estimateTokens(result) >= MAX_TOKENS) result = result.replace(/\[Learning\][\s\S]*?(?=\n\n\[|\n*$)/, "");
   if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Hypotheses\][\s\S]*?(?=\n\n\[|\n*$)/, "");
 

[NoCoverage] EqualityOperator
src/rendering/preamble-builder.ts:82:7
     if (beliefsSection) result = result.replace(/\[Beliefs\][\s\S]*?(?=\n\n\[|\n*$)/, escapeXml(beliefsSection));
   }
 
-  if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Learning\][\s\S]*?(?=\n\n\[|\n*$)/, "");
+  if (estimateTokens(result) <= MAX_TOKENS) result = result.replace(/\[Learning\][\s\S]*?(?=\n\n\[|\n*$)/, "");
   if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Hypotheses\][\s\S]*?(?=\n\n\[|\n*$)/, "");
 

[NoCoverage] EqualityOperator
src/rendering/preamble-builder.ts:83:7
   }
 
   if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Learning\][\s\S]*?(?=\n\n\[|\n*$)/, "");
-  if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Hypotheses\][\s\S]*?(?=\n\n\[|\n*$)/, "");
+  if (estimateTokens(result) >= MAX_TOKENS) result = result.replace(/\[Hypotheses\][\s\S]*?(?=\n\n\[|\n*$)/, "");
 
   return result.length > maxChars ? `${result.slice(0, maxChars - 3)}...` : result;

[NoCoverage] EqualityOperator
src/rendering/preamble-builder.ts:83:7
   }
 
   if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Learning\][\s\S]*?(?=\n\n\[|\n*$)/, "");
-  if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Hypotheses\][\s\S]*?(?=\n\n\[|\n*$)/, "");
+  if (estimateTokens(result) <= MAX_TOKENS) result = result.replace(/\[Hypotheses\][\s\S]*?(?=\n\n\[|\n*$)/, "");
 
   return result.length > maxChars ? `${result.slice(0, maxChars - 3)}...` : result;

[NoCoverage] ConditionalExpression
src/rendering/preamble-builder.ts:85:10
   if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Learning\][\s\S]*?(?=\n\n\[|\n*$)/, "");
   if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Hypotheses\][\s\S]*?(?=\n\n\[|\n*$)/, "");
 
-  return result.length > maxChars ? `${result.slice(0, maxChars - 3)}...` : result;
+  return true ? `${result.slice(0, maxChars - 3)}...` : result;
 }
 

[NoCoverage] EqualityOperator
src/rendering/preamble-builder.ts:85:10
   if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Learning\][\s\S]*?(?=\n\n\[|\n*$)/, "");
   if (estimateTokens(result) > MAX_TOKENS) result = result.replace(/\[Hypotheses\][\s\S]*?(?=\n\n\[|\n*$)/, "");
 
-  return result.length > maxChars ? `${result.slice(0, maxChars - 3)}...` : result;
+  return result.length <= maxChars ? `${result.slice(0, maxChars - 3)}...` : result;
 }
 

[NoCoverage] BlockStatement
src/rendering/preamble-builder.ts:88:89
   return result.length > maxChars ? `${result.slice(0, maxChars - 3)}...` : result;
 }
 
-export function buildSubagentPreamble(state: NoesisState, _taskFilter?: string): string {
-  const allLearning = [...state.learning.failures, ...state.learning.successes];
-  const learningTop = allLearning.slice(0, 3);
-  return buildPreamble(state, {
-    capability: "FULL",
-    learningRanked: learningTop,
-    staleNotes: [],
-    projectName: "",
-  });
-}
+export function buildSubagentPreamble(state: NoesisState, _taskFilter?: string): string {}
 

[NoCoverage] MethodExpression
src/rendering/preamble-builder.ts:90:23
 
 export function buildSubagentPreamble(state: NoesisState, _taskFilter?: string): string {
   const allLearning = [...state.learning.failures, ...state.learning.successes];
-  const learningTop = allLearning.slice(0, 3);
+  const learningTop = allLearning;
   return buildPreamble(state, {
     capability: "FULL",

[NoCoverage] ArrayDeclaration
src/rendering/preamble-builder.ts:94:17
   return buildPreamble(state, {
     capability: "FULL",
     learningRanked: learningTop,
-    staleNotes: [],
+    staleNotes: ["Stryker was here"],
     projectName: "",
   });

[NoCoverage] StringLiteral
src/rendering/preamble-builder.ts:95:18
     capability: "FULL",
     learningRanked: learningTop,
     staleNotes: [],
-    projectName: "",
+    projectName: "Stryker was here!",
   });
 }
