[Survived] BlockStatement
src/rendering/section-formatters.ts:4:92
 import { truncate } from "../shared/text.js";
 import type { BeliefFact, BeliefDecision, LearningEntry, WorkflowStep, GraphFinding } from "../schema.js";
 
-export function formatWorkSection(goal: string, steps: WorkflowStep[]): string | undefined {
-  if (!goal && steps.length === 0) return undefined;
-
-  const current = steps.find((s) => s.status === "active") ?? steps.find((s) => s.status === "pending");
-  const next = current ? steps[steps.indexOf(current) + 1] : undefined;
-
-  let line = `[Work] ${goal || "(no goal)"}`;
-  if (current) line += ` | Step: ${truncate(current.description, 100)}`;
-  if (next) line += ` | Next: ${truncate(next.description, 100)}`;
-  return line;
-}
+export function formatWorkSection(goal: string, steps: WorkflowStep[]): string | undefined {}
 
 export function formatDecisionsSection(decisions: BeliefDecision[], includeRationale: boolean): string | undefined {

[Survived] BooleanLiteral
src/rendering/section-formatters.ts:5:7
 import type { BeliefFact, BeliefDecision, LearningEntry, WorkflowStep, GraphFinding } from "../schema.js";
 
 export function formatWorkSection(goal: string, steps: WorkflowStep[]): string | undefined {
-  if (!goal && steps.length === 0) return undefined;
+  if (goal && steps.length === 0) return undefined;
 
   const current = steps.find((s) => s.status === "active") ?? steps.find((s) => s.status === "pending");

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:5:7
 import type { BeliefFact, BeliefDecision, LearningEntry, WorkflowStep, GraphFinding } from "../schema.js";
 
 export function formatWorkSection(goal: string, steps: WorkflowStep[]): string | undefined {
-  if (!goal && steps.length === 0) return undefined;
+  if (true) return undefined;
 
   const current = steps.find((s) => s.status === "active") ?? steps.find((s) => s.status === "pending");

[NoCoverage] ConditionalExpression
src/rendering/section-formatters.ts:7:37
 export function formatWorkSection(goal: string, steps: WorkflowStep[]): string | undefined {
   if (!goal && steps.length === 0) return undefined;
 
-  const current = steps.find((s) => s.status === "active") ?? steps.find((s) => s.status === "pending");
+  const current = steps.find((s) => true) ?? steps.find((s) => s.status === "pending");
   const next = current ? steps[steps.indexOf(current) + 1] : undefined;
 

[NoCoverage] ConditionalExpression
src/rendering/section-formatters.ts:7:37
 export function formatWorkSection(goal: string, steps: WorkflowStep[]): string | undefined {
   if (!goal && steps.length === 0) return undefined;
 
-  const current = steps.find((s) => s.status === "active") ?? steps.find((s) => s.status === "pending");
+  const current = steps.find((s) => false) ?? steps.find((s) => s.status === "pending");
   const next = current ? steps[steps.indexOf(current) + 1] : undefined;
 

[NoCoverage] ArithmeticOperator
src/rendering/section-formatters.ts:8:32
   if (!goal && steps.length === 0) return undefined;
 
   const current = steps.find((s) => s.status === "active") ?? steps.find((s) => s.status === "pending");
-  const next = current ? steps[steps.indexOf(current) + 1] : undefined;
+  const next = current ? steps[steps.indexOf(current) - 1] : undefined;
 
   let line = `[Work] ${goal || "(no goal)"}`;

[NoCoverage] ConditionalExpression
src/rendering/section-formatters.ts:10:24
   const current = steps.find((s) => s.status === "active") ?? steps.find((s) => s.status === "pending");
   const next = current ? steps[steps.indexOf(current) + 1] : undefined;
 
-  let line = `[Work] ${goal || "(no goal)"}`;
+  let line = `[Work] ${true}`;
   if (current) line += ` | Step: ${truncate(current.description, 100)}`;
   if (next) line += ` | Next: ${truncate(next.description, 100)}`;

[NoCoverage] ConditionalExpression
src/rendering/section-formatters.ts:10:24
   const current = steps.find((s) => s.status === "active") ?? steps.find((s) => s.status === "pending");
   const next = current ? steps[steps.indexOf(current) + 1] : undefined;
 
-  let line = `[Work] ${goal || "(no goal)"}`;
+  let line = `[Work] ${false}`;
   if (current) line += ` | Step: ${truncate(current.description, 100)}`;
   if (next) line += ` | Next: ${truncate(next.description, 100)}`;

[NoCoverage] ConditionalExpression
src/rendering/section-formatters.ts:11:7
   const next = current ? steps[steps.indexOf(current) + 1] : undefined;
 
   let line = `[Work] ${goal || "(no goal)"}`;
-  if (current) line += ` | Step: ${truncate(current.description, 100)}`;
+  if (false) line += ` | Step: ${truncate(current.description, 100)}`;
   if (next) line += ` | Next: ${truncate(next.description, 100)}`;
   return line;

[NoCoverage] ConditionalExpression
src/rendering/section-formatters.ts:11:7
   const next = current ? steps[steps.indexOf(current) + 1] : undefined;
 
   let line = `[Work] ${goal || "(no goal)"}`;
-  if (current) line += ` | Step: ${truncate(current.description, 100)}`;
+  if (true) line += ` | Step: ${truncate(current.description, 100)}`;
   if (next) line += ` | Next: ${truncate(next.description, 100)}`;
   return line;

[NoCoverage] ConditionalExpression
src/rendering/section-formatters.ts:12:7
 
   let line = `[Work] ${goal || "(no goal)"}`;
   if (current) line += ` | Step: ${truncate(current.description, 100)}`;
-  if (next) line += ` | Next: ${truncate(next.description, 100)}`;
+  if (true) line += ` | Next: ${truncate(next.description, 100)}`;
   return line;
 }

[NoCoverage] ConditionalExpression
src/rendering/section-formatters.ts:12:7
 
   let line = `[Work] ${goal || "(no goal)"}`;
   if (current) line += ` | Step: ${truncate(current.description, 100)}`;
-  if (next) line += ` | Next: ${truncate(next.description, 100)}`;
+  if (false) line += ` | Next: ${truncate(next.description, 100)}`;
   return line;
 }

[Survived] BlockStatement
src/rendering/section-formatters.ts:16:116
   return line;
 }
 
-export function formatDecisionsSection(decisions: BeliefDecision[], includeRationale: boolean): string | undefined {
-  const active = decisions.filter((d) => d.status === "active").slice(0, 5);
-  if (active.length === 0) return undefined;
-  const lines = active.map((d) => {
-    const base = `- ${truncate(d.content, 100)}`;
-    return includeRationale ? `${base} (rationale: ${truncate(d.rationale, 80)})` : base;
-  });
-  return `[Decisions]\n${lines.join("\n")}`;
-}
+export function formatDecisionsSection(decisions: BeliefDecision[], includeRationale: boolean): string | undefined {}
 
 export function formatBeliefsSection(facts: BeliefFact[], includeSource: boolean): string | undefined {

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:17:42
 }
 
 export function formatDecisionsSection(decisions: BeliefDecision[], includeRationale: boolean): string | undefined {
-  const active = decisions.filter((d) => d.status === "active").slice(0, 5);
+  const active = decisions.filter((d) => true).slice(0, 5);
   if (active.length === 0) return undefined;
   const lines = active.map((d) => {

[Survived] ArrowFunction
src/rendering/section-formatters.ts:17:35
 }
 
 export function formatDecisionsSection(decisions: BeliefDecision[], includeRationale: boolean): string | undefined {
-  const active = decisions.filter((d) => d.status === "active").slice(0, 5);
+  const active = decisions.filter(() => undefined).slice(0, 5);
   if (active.length === 0) return undefined;
   const lines = active.map((d) => {

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:18:7
 
 export function formatDecisionsSection(decisions: BeliefDecision[], includeRationale: boolean): string | undefined {
   const active = decisions.filter((d) => d.status === "active").slice(0, 5);
-  if (active.length === 0) return undefined;
+  if (false) return undefined;
   const lines = active.map((d) => {
     const base = `- ${truncate(d.content, 100)}`;

[Survived] EqualityOperator
src/rendering/section-formatters.ts:18:7
 
 export function formatDecisionsSection(decisions: BeliefDecision[], includeRationale: boolean): string | undefined {
   const active = decisions.filter((d) => d.status === "active").slice(0, 5);
-  if (active.length === 0) return undefined;
+  if (active.length !== 0) return undefined;
   const lines = active.map((d) => {
     const base = `- ${truncate(d.content, 100)}`;

[Survived] BlockStatement
src/rendering/section-formatters.ts:19:35
 export function formatDecisionsSection(decisions: BeliefDecision[], includeRationale: boolean): string | undefined {
   const active = decisions.filter((d) => d.status === "active").slice(0, 5);
   if (active.length === 0) return undefined;
-  const lines = active.map((d) => {
-    const base = `- ${truncate(d.content, 100)}`;
-    return includeRationale ? `${base} (rationale: ${truncate(d.rationale, 80)})` : base;
-  });
+  const lines = active.map((d) => {});
   return `[Decisions]\n${lines.join("\n")}`;
 }

[Survived] StringLiteral
src/rendering/section-formatters.ts:21:31
   if (active.length === 0) return undefined;
   const lines = active.map((d) => {
     const base = `- ${truncate(d.content, 100)}`;
-    return includeRationale ? `${base} (rationale: ${truncate(d.rationale, 80)})` : base;
+    return includeRationale ? `` : base;
   });
   return `[Decisions]\n${lines.join("\n")}`;

[Survived] BlockStatement
src/rendering/section-formatters.ts:26:103
   return `[Decisions]\n${lines.join("\n")}`;
 }
 
-export function formatBeliefsSection(facts: BeliefFact[], includeSource: boolean): string | undefined {
-  const active = facts.filter((f) => f.status === "active" && f.confidence >= 0.75)
-    .sort((a, b) => b.confidence - a.confidence)
-    .slice(0, 10);
-  if (active.length === 0) return undefined;
-  const lines = active.map((f) => includeSource
-    ? `[${f.confidence}] ${truncate(f.content, 100)} (src: ${f.source})`
-    : `[${f.confidence}] ${truncate(f.content, 100)}`);
-  return `[Beliefs]\n${lines.join("\n")}`;
-}
+export function formatBeliefsSection(facts: BeliefFact[], includeSource: boolean): string | undefined {}
 
 export function formatHypothesesSection(hypotheses: Array<{ status: string; content: string }>, includeStatus: boolean): string | undefined {

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:27:38
 }
 
 export function formatBeliefsSection(facts: BeliefFact[], includeSource: boolean): string | undefined {
-  const active = facts.filter((f) => f.status === "active" && f.confidence >= 0.75)
+  const active = facts.filter((f) => false)
     .sort((a, b) => b.confidence - a.confidence)
     .slice(0, 10);

[Survived] LogicalOperator
src/rendering/section-formatters.ts:27:38
 }
 
 export function formatBeliefsSection(facts: BeliefFact[], includeSource: boolean): string | undefined {
-  const active = facts.filter((f) => f.status === "active" && f.confidence >= 0.75)
+  const active = facts.filter((f) => f.status === "active" || f.confidence >= 0.75)
     .sort((a, b) => b.confidence - a.confidence)
     .slice(0, 10);

[Survived] ArrowFunction
src/rendering/section-formatters.ts:28:11
 
 export function formatBeliefsSection(facts: BeliefFact[], includeSource: boolean): string | undefined {
   const active = facts.filter((f) => f.status === "active" && f.confidence >= 0.75)
-    .sort((a, b) => b.confidence - a.confidence)
+    .sort(() => undefined)
     .slice(0, 10);
   if (active.length === 0) return undefined;

[Survived] ArithmeticOperator
src/rendering/section-formatters.ts:28:21
 
 export function formatBeliefsSection(facts: BeliefFact[], includeSource: boolean): string | undefined {
   const active = facts.filter((f) => f.status === "active" && f.confidence >= 0.75)
-    .sort((a, b) => b.confidence - a.confidence)
+    .sort((a, b) => b.confidence + a.confidence)
     .slice(0, 10);
   if (active.length === 0) return undefined;

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:30:7
   const active = facts.filter((f) => f.status === "active" && f.confidence >= 0.75)
     .sort((a, b) => b.confidence - a.confidence)
     .slice(0, 10);
-  if (active.length === 0) return undefined;
+  if (false) return undefined;
   const lines = active.map((f) => includeSource
     ? `[${f.confidence}] ${truncate(f.content, 100)} (src: ${f.source})`

[Survived] EqualityOperator
src/rendering/section-formatters.ts:30:7
   const active = facts.filter((f) => f.status === "active" && f.confidence >= 0.75)
     .sort((a, b) => b.confidence - a.confidence)
     .slice(0, 10);
-  if (active.length === 0) return undefined;
+  if (active.length !== 0) return undefined;
   const lines = active.map((f) => includeSource
     ? `[${f.confidence}] ${truncate(f.content, 100)} (src: ${f.source})`

[Survived] ArrowFunction
src/rendering/section-formatters.ts:31:28
     .sort((a, b) => b.confidence - a.confidence)
     .slice(0, 10);
   if (active.length === 0) return undefined;
-  const lines = active.map((f) => includeSource
-    ? `[${f.confidence}] ${truncate(f.content, 100)} (src: ${f.source})`
-    : `[${f.confidence}] ${truncate(f.content, 100)}`);
+  const lines = active.map(() => undefined);
   return `[Beliefs]\n${lines.join("\n")}`;
 }

[Survived] StringLiteral
src/rendering/section-formatters.ts:34:35
   const lines = active.map((f) => includeSource
     ? `[${f.confidence}] ${truncate(f.content, 100)} (src: ${f.source})`
     : `[${f.confidence}] ${truncate(f.content, 100)}`);
-  return `[Beliefs]\n${lines.join("\n")}`;
+  return `[Beliefs]\n${lines.join("")}`;
 }
 

[Survived] BlockStatement
src/rendering/section-formatters.ts:37:141
   return `[Beliefs]\n${lines.join("\n")}`;
 }
 
-export function formatHypothesesSection(hypotheses: Array<{ status: string; content: string }>, includeStatus: boolean): string | undefined {
-  const active = hypotheses.filter((h) => h.status === "testing").slice(0, 3);
-  if (active.length === 0) return undefined;
-  const lines = active.map((h) => includeStatus ? `- ${truncate(h.content, 100)} [testing]` : `- ${truncate(h.content, 100)}`);
-  return `[Hypotheses]\n${lines.join("\n")}`;
-}
+export function formatHypothesesSection(hypotheses: Array<{ status: string; content: string }>, includeStatus: boolean): string | undefined {}
 
 export function formatLearningSection(entries: LearningEntry[], includeFix: boolean): string | undefined {

[Survived] ArrowFunction
src/rendering/section-formatters.ts:38:36
 }
 
 export function formatHypothesesSection(hypotheses: Array<{ status: string; content: string }>, includeStatus: boolean): string | undefined {
-  const active = hypotheses.filter((h) => h.status === "testing").slice(0, 3);
+  const active = hypotheses.filter(() => undefined).slice(0, 3);
   if (active.length === 0) return undefined;
   const lines = active.map((h) => includeStatus ? `- ${truncate(h.content, 100)} [testing]` : `- ${truncate(h.content, 100)}`);

[Survived] MethodExpression
src/rendering/section-formatters.ts:38:18
 }
 
 export function formatHypothesesSection(hypotheses: Array<{ status: string; content: string }>, includeStatus: boolean): string | undefined {
-  const active = hypotheses.filter((h) => h.status === "testing").slice(0, 3);
+  const active = hypotheses.filter(h => h.status === "testing");
   if (active.length === 0) return undefined;
   const lines = active.map((h) => includeStatus ? `- ${truncate(h.content, 100)} [testing]` : `- ${truncate(h.content, 100)}`);

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:39:7
 
 export function formatHypothesesSection(hypotheses: Array<{ status: string; content: string }>, includeStatus: boolean): string | undefined {
   const active = hypotheses.filter((h) => h.status === "testing").slice(0, 3);
-  if (active.length === 0) return undefined;
+  if (true) return undefined;
   const lines = active.map((h) => includeStatus ? `- ${truncate(h.content, 100)} [testing]` : `- ${truncate(h.content, 100)}`);
   return `[Hypotheses]\n${lines.join("\n")}`;

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:39:7
 
 export function formatHypothesesSection(hypotheses: Array<{ status: string; content: string }>, includeStatus: boolean): string | undefined {
   const active = hypotheses.filter((h) => h.status === "testing").slice(0, 3);
-  if (active.length === 0) return undefined;
+  if (false) return undefined;
   const lines = active.map((h) => includeStatus ? `- ${truncate(h.content, 100)} [testing]` : `- ${truncate(h.content, 100)}`);
   return `[Hypotheses]\n${lines.join("\n")}`;

[Survived] ArrowFunction
src/rendering/section-formatters.ts:40:28
 export function formatHypothesesSection(hypotheses: Array<{ status: string; content: string }>, includeStatus: boolean): string | undefined {
   const active = hypotheses.filter((h) => h.status === "testing").slice(0, 3);
   if (active.length === 0) return undefined;
-  const lines = active.map((h) => includeStatus ? `- ${truncate(h.content, 100)} [testing]` : `- ${truncate(h.content, 100)}`);
+  const lines = active.map(() => undefined);
   return `[Hypotheses]\n${lines.join("\n")}`;
 }

[Survived] StringLiteral
src/rendering/section-formatters.ts:40:51
 export function formatHypothesesSection(hypotheses: Array<{ status: string; content: string }>, includeStatus: boolean): string | undefined {
   const active = hypotheses.filter((h) => h.status === "testing").slice(0, 3);
   if (active.length === 0) return undefined;
-  const lines = active.map((h) => includeStatus ? `- ${truncate(h.content, 100)} [testing]` : `- ${truncate(h.content, 100)}`);
+  const lines = active.map((h) => includeStatus ? `` : `- ${truncate(h.content, 100)}`);
   return `[Hypotheses]\n${lines.join("\n")}`;
 }

[Survived] BlockStatement
src/rendering/section-formatters.ts:44:106
   return `[Hypotheses]\n${lines.join("\n")}`;
 }
 
-export function formatLearningSection(entries: LearningEntry[], includeFix: boolean): string | undefined {
-  const top = entries.slice(0, 3);
-  if (top.length === 0) return undefined;
-  const lines = top.map((l) => {
-    const tag = l.rootCause !== undefined ? "FAIL" : "PASS";
-    const fixPart = includeFix && l.fix ? ` — fix: ${truncate(l.fix, 80)}` : "";
-    return `[${tag}] ${truncate(l.description, 100)}${fixPart}`;
-  });
-  return `[Learning]\n${lines.join("\n")}`;
-}
+export function formatLearningSection(entries: LearningEntry[], includeFix: boolean): string | undefined {}
 
 export function formatGraphSection(findings: GraphFinding[]): string | undefined {

[Survived] MethodExpression
src/rendering/section-formatters.ts:45:15
 }
 
 export function formatLearningSection(entries: LearningEntry[], includeFix: boolean): string | undefined {
-  const top = entries.slice(0, 3);
+  const top = entries;
   if (top.length === 0) return undefined;
   const lines = top.map((l) => {

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:46:7
 
 export function formatLearningSection(entries: LearningEntry[], includeFix: boolean): string | undefined {
   const top = entries.slice(0, 3);
-  if (top.length === 0) return undefined;
+  if (false) return undefined;
   const lines = top.map((l) => {
     const tag = l.rootCause !== undefined ? "FAIL" : "PASS";

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:46:7
 
 export function formatLearningSection(entries: LearningEntry[], includeFix: boolean): string | undefined {
   const top = entries.slice(0, 3);
-  if (top.length === 0) return undefined;
+  if (true) return undefined;
   const lines = top.map((l) => {
     const tag = l.rootCause !== undefined ? "FAIL" : "PASS";

[Survived] BlockStatement
src/rendering/section-formatters.ts:47:32
 export function formatLearningSection(entries: LearningEntry[], includeFix: boolean): string | undefined {
   const top = entries.slice(0, 3);
   if (top.length === 0) return undefined;
-  const lines = top.map((l) => {
-    const tag = l.rootCause !== undefined ? "FAIL" : "PASS";
-    const fixPart = includeFix && l.fix ? ` — fix: ${truncate(l.fix, 80)}` : "";
-    return `[${tag}] ${truncate(l.description, 100)}${fixPart}`;
-  });
+  const lines = top.map((l) => {});
   return `[Learning]\n${lines.join("\n")}`;
 }

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:48:17
   const top = entries.slice(0, 3);
   if (top.length === 0) return undefined;
   const lines = top.map((l) => {
-    const tag = l.rootCause !== undefined ? "FAIL" : "PASS";
+    const tag = false ? "FAIL" : "PASS";
     const fixPart = includeFix && l.fix ? ` — fix: ${truncate(l.fix, 80)}` : "";
     return `[${tag}] ${truncate(l.description, 100)}${fixPart}`;

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:48:17
   const top = entries.slice(0, 3);
   if (top.length === 0) return undefined;
   const lines = top.map((l) => {
-    const tag = l.rootCause !== undefined ? "FAIL" : "PASS";
+    const tag = true ? "FAIL" : "PASS";
     const fixPart = includeFix && l.fix ? ` — fix: ${truncate(l.fix, 80)}` : "";
     return `[${tag}] ${truncate(l.description, 100)}${fixPart}`;

[Killed] ConditionalExpression
src/rendering/section-formatters.ts:49:21
   if (top.length === 0) return undefined;
   const lines = top.map((l) => {
     const tag = l.rootCause !== undefined ? "FAIL" : "PASS";
-    const fixPart = includeFix && l.fix ? ` — fix: ${truncate(l.fix, 80)}` : "";
+    const fixPart = true ? ` — fix: ${truncate(l.fix, 80)}` : "";
     return `[${tag}] ${truncate(l.description, 100)}${fixPart}`;
   });
killedBy: Belief Revision Properties 100 random states produce preamble ≤ 2000 tokens
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] LogicalOperator
src/rendering/section-formatters.ts:49:21
   if (top.length === 0) return undefined;
   const lines = top.map((l) => {
     const tag = l.rootCause !== undefined ? "FAIL" : "PASS";
-    const fixPart = includeFix && l.fix ? ` — fix: ${truncate(l.fix, 80)}` : "";
+    const fixPart = includeFix || l.fix ? ` — fix: ${truncate(l.fix, 80)}` : "";
     return `[${tag}] ${truncate(l.description, 100)}${fixPart}`;
   });
killedBy: Belief Revision Properties 100 random states produce preamble ≤ 2000 tokens
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] StringLiteral
src/rendering/section-formatters.ts:52:36
     const fixPart = includeFix && l.fix ? ` — fix: ${truncate(l.fix, 80)}` : "";
     return `[${tag}] ${truncate(l.description, 100)}${fixPart}`;
   });
-  return `[Learning]\n${lines.join("\n")}`;
+  return `[Learning]\n${lines.join("")}`;
 }
 

[Survived] BlockStatement
src/rendering/section-formatters.ts:55:82
   return `[Learning]\n${lines.join("\n")}`;
 }
 
-export function formatGraphSection(findings: GraphFinding[]): string | undefined {
-  if (findings.length === 0) return undefined;
-  const lines = findings.slice(0, 5).map((f) => `- ${f.nodeName}: ${truncate(f.rawSnippet, 120)}`);
-  return `[Graph]\n${lines.join("\n")}`;
-}
+export function formatGraphSection(findings: GraphFinding[]): string | undefined {}
 

[Survived] EqualityOperator
src/rendering/section-formatters.ts:56:7
 }
 
 export function formatGraphSection(findings: GraphFinding[]): string | undefined {
-  if (findings.length === 0) return undefined;
+  if (findings.length !== 0) return undefined;
   const lines = findings.slice(0, 5).map((f) => `- ${f.nodeName}: ${truncate(f.rawSnippet, 120)}`);
   return `[Graph]\n${lines.join("\n")}`;

[Survived] ConditionalExpression
src/rendering/section-formatters.ts:56:7
 }
 
 export function formatGraphSection(findings: GraphFinding[]): string | undefined {
-  if (findings.length === 0) return undefined;
+  if (true) return undefined;
   const lines = findings.slice(0, 5).map((f) => `- ${f.nodeName}: ${truncate(f.rawSnippet, 120)}`);
   return `[Graph]\n${lines.join("\n")}`;

[NoCoverage] ArrowFunction
src/rendering/section-formatters.ts:57:42
 
 export function formatGraphSection(findings: GraphFinding[]): string | undefined {
   if (findings.length === 0) return undefined;
-  const lines = findings.slice(0, 5).map((f) => `- ${f.nodeName}: ${truncate(f.rawSnippet, 120)}`);
+  const lines = findings.slice(0, 5).map(() => undefined);
   return `[Graph]\n${lines.join("\n")}`;
 }

[NoCoverage] MethodExpression
src/rendering/section-formatters.ts:57:17
 
 export function formatGraphSection(findings: GraphFinding[]): string | undefined {
   if (findings.length === 0) return undefined;
-  const lines = findings.slice(0, 5).map((f) => `- ${f.nodeName}: ${truncate(f.rawSnippet, 120)}`);
+  const lines = findings.map((f) => `- ${f.nodeName}: ${truncate(f.rawSnippet, 120)}`);
   return `[Graph]\n${lines.join("\n")}`;
 }

[NoCoverage] StringLiteral
src/rendering/section-formatters.ts:58:33
 export function formatGraphSection(findings: GraphFinding[]): string | undefined {
   if (findings.length === 0) return undefined;
   const lines = findings.slice(0, 5).map((f) => `- ${f.nodeName}: ${truncate(f.rawSnippet, 120)}`);
-  return `[Graph]\n${lines.join("\n")}`;
+  return `[Graph]\n${lines.join("")}`;
 }
 
