[NoCoverage] BlockStatement
src/rendering/state-cleanup.ts:12:70
 import { clone } from "../shared/clone.js";
 
 
-export function stripTransientState(state: NoesisState): NoesisState {
-  const copy = clone(state);
-  delete copy.attention.graphFindings;
-  delete copy.attention.__graphFindings;
-  return copy;
-}
+export function stripTransientState(state: NoesisState): NoesisState {}
 
 export function evictOverCap(

[NoCoverage] BlockStatement
src/rendering/state-cleanup.ts:28:3
   evictedLearning: LearningEntry[];
   evictedHypotheses: Hypothesis[];
   evictedCommitmentActions: PlannedAction[];
-} {
-  // Placeholder: no-op eviction for now. Real logic would rank and trim.
-  return {
-    evictedFacts: [],
-    evictedDecisions: [],
-    evictedLearning: [],
-    evictedHypotheses: [],
-    evictedCommitmentActions: [],
-  };
-}
+} {}
 
 export function evictStale(

[NoCoverage] ObjectLiteral
src/rendering/state-cleanup.ts:30:10
   evictedCommitmentActions: PlannedAction[];
 } {
   // Placeholder: no-op eviction for now. Real logic would rank and trim.
-  return {
-    evictedFacts: [],
-    evictedDecisions: [],
-    evictedLearning: [],
-    evictedHypotheses: [],
-    evictedCommitmentActions: [],
-  };
+  return {};
 }
 

[NoCoverage] ArrayDeclaration
src/rendering/state-cleanup.ts:35:31
     evictedDecisions: [],
     evictedLearning: [],
     evictedHypotheses: [],
-    evictedCommitmentActions: [],
+    evictedCommitmentActions: ["Stryker was here"],
   };
 }

[NoCoverage] BlockStatement
src/rendering/state-cleanup.ts:46:3
   evictedFacts: BeliefFact[];
   evictedDecisions: BeliefDecision[];
   evictedHypotheses: Hypothesis[];
-} {
-  // Placeholder: no-op stale eviction for now.
-  return {
-    evictedFacts: [],
-    evictedDecisions: [],
-    evictedHypotheses: [],
-  };
-}
+} {}
 

[NoCoverage] ArrayDeclaration
src/rendering/state-cleanup.ts:49:19
 } {
   // Placeholder: no-op stale eviction for now.
   return {
-    evictedFacts: [],
+    evictedFacts: ["Stryker was here"],
     evictedDecisions: [],
     evictedHypotheses: [],

[NoCoverage] ArrayDeclaration
src/rendering/state-cleanup.ts:50:23
   // Placeholder: no-op stale eviction for now.
   return {
     evictedFacts: [],
-    evictedDecisions: [],
+    evictedDecisions: ["Stryker was here"],
     evictedHypotheses: [],
   };

[NoCoverage] ArrayDeclaration
src/rendering/state-cleanup.ts:51:24
   return {
     evictedFacts: [],
     evictedDecisions: [],
-    evictedHypotheses: [],
+    evictedHypotheses: ["Stryker was here"],
   };
 }
