[NoCoverage] BlockStatement
src/rendering/survivor-builder.ts:20:68
   preserveData: { noesis: NoesisState };
 }
 
-export function buildSurvivors(state: NoesisState): SurvivorResult {
-  const lines: string[] = [];
-
-  lines.push(`[Focus] ${truncate(state.attention.focus || "No active focus", 200)}`);
-  pushIf(lines, formatWorkSection(state.commitment.workflow.goal, state.commitment.workflow.steps));
-  pushLines(lines, formatDecisionsSection(state.belief.decisions, false));
-  pushLines(lines, formatBeliefsSection(getActiveFacts(state, 0.75), false));
-  pushLines(lines, formatHypothesesSection(getUnresolvedHypotheses(state, 3), false));
-
-  const allLearning: LearningEntry[] = [...state.learning.failures, ...state.learning.successes];
-  pushLines(lines, formatLearningSection(rankLearning(allLearning).slice(0, 3), false));
-
-  const summary = state.learning.summary;
-  lines.push(`Learning summary: ${summary.successCount} successes, ${summary.failureCount} failures (${summary.resolvedCount} resolved)`);
-  lines.push("State: .omp/noesis/state.json");
-
-  return { contextLines: lines, preserveData: { noesis: stripTransientState(state) } };
-}
+export function buildSurvivors(state: NoesisState): SurvivorResult {}
 
 function pushIf(target: string[], value: string | undefined): void {

[NoCoverage] LogicalOperator
src/rendering/survivor-builder.ts:23:34
 export function buildSurvivors(state: NoesisState): SurvivorResult {
   const lines: string[] = [];
 
-  lines.push(`[Focus] ${truncate(state.attention.focus || "No active focus", 200)}`);
+  lines.push(`[Focus] ${truncate(state.attention.focus && "No active focus", 200)}`);
   pushIf(lines, formatWorkSection(state.commitment.workflow.goal, state.commitment.workflow.steps));
   pushLines(lines, formatDecisionsSection(state.belief.decisions, false));

[NoCoverage] ConditionalExpression
src/rendering/survivor-builder.ts:23:34
 export function buildSurvivors(state: NoesisState): SurvivorResult {
   const lines: string[] = [];
 
-  lines.push(`[Focus] ${truncate(state.attention.focus || "No active focus", 200)}`);
+  lines.push(`[Focus] ${truncate(false, 200)}`);
   pushIf(lines, formatWorkSection(state.commitment.workflow.goal, state.commitment.workflow.steps));
   pushLines(lines, formatDecisionsSection(state.belief.decisions, false));

[NoCoverage] BooleanLiteral
src/rendering/survivor-builder.ts:25:67
 
   lines.push(`[Focus] ${truncate(state.attention.focus || "No active focus", 200)}`);
   pushIf(lines, formatWorkSection(state.commitment.workflow.goal, state.commitment.workflow.steps));
-  pushLines(lines, formatDecisionsSection(state.belief.decisions, false));
+  pushLines(lines, formatDecisionsSection(state.belief.decisions, true));
   pushLines(lines, formatBeliefsSection(getActiveFacts(state, 0.75), false));
   pushLines(lines, formatHypothesesSection(getUnresolvedHypotheses(state, 3), false));

[NoCoverage] BooleanLiteral
src/rendering/survivor-builder.ts:26:70
   lines.push(`[Focus] ${truncate(state.attention.focus || "No active focus", 200)}`);
   pushIf(lines, formatWorkSection(state.commitment.workflow.goal, state.commitment.workflow.steps));
   pushLines(lines, formatDecisionsSection(state.belief.decisions, false));
-  pushLines(lines, formatBeliefsSection(getActiveFacts(state, 0.75), false));
+  pushLines(lines, formatBeliefsSection(getActiveFacts(state, 0.75), true));
   pushLines(lines, formatHypothesesSection(getUnresolvedHypotheses(state, 3), false));
 

[NoCoverage] BooleanLiteral
src/rendering/survivor-builder.ts:27:79
   pushIf(lines, formatWorkSection(state.commitment.workflow.goal, state.commitment.workflow.steps));
   pushLines(lines, formatDecisionsSection(state.belief.decisions, false));
   pushLines(lines, formatBeliefsSection(getActiveFacts(state, 0.75), false));
-  pushLines(lines, formatHypothesesSection(getUnresolvedHypotheses(state, 3), false));
+  pushLines(lines, formatHypothesesSection(getUnresolvedHypotheses(state, 3), true));
 
   const allLearning: LearningEntry[] = [...state.learning.failures, ...state.learning.successes];

[NoCoverage] ArrayDeclaration
src/rendering/survivor-builder.ts:29:40
   pushLines(lines, formatBeliefsSection(getActiveFacts(state, 0.75), false));
   pushLines(lines, formatHypothesesSection(getUnresolvedHypotheses(state, 3), false));
 
-  const allLearning: LearningEntry[] = [...state.learning.failures, ...state.learning.successes];
+  const allLearning: LearningEntry[] = [];
   pushLines(lines, formatLearningSection(rankLearning(allLearning).slice(0, 3), false));
 

[NoCoverage] BooleanLiteral
src/rendering/survivor-builder.ts:30:81
   pushLines(lines, formatHypothesesSection(getUnresolvedHypotheses(state, 3), false));
 
   const allLearning: LearningEntry[] = [...state.learning.failures, ...state.learning.successes];
-  pushLines(lines, formatLearningSection(rankLearning(allLearning).slice(0, 3), false));
+  pushLines(lines, formatLearningSection(rankLearning(allLearning).slice(0, 3), true));
 
   const summary = state.learning.summary;

[NoCoverage] MethodExpression
src/rendering/survivor-builder.ts:30:42
   pushLines(lines, formatHypothesesSection(getUnresolvedHypotheses(state, 3), false));
 
   const allLearning: LearningEntry[] = [...state.learning.failures, ...state.learning.successes];
-  pushLines(lines, formatLearningSection(rankLearning(allLearning).slice(0, 3), false));
+  pushLines(lines, formatLearningSection(rankLearning(allLearning), false));
 
   const summary = state.learning.summary;

[NoCoverage] StringLiteral
src/rendering/survivor-builder.ts:33:14
   pushLines(lines, formatLearningSection(rankLearning(allLearning).slice(0, 3), false));
 
   const summary = state.learning.summary;
-  lines.push(`Learning summary: ${summary.successCount} successes, ${summary.failureCount} failures (${summary.resolvedCount} resolved)`);
+  lines.push(``);
   lines.push("State: .omp/noesis/state.json");
 

[NoCoverage] StringLiteral
src/rendering/survivor-builder.ts:34:14
 
   const summary = state.learning.summary;
   lines.push(`Learning summary: ${summary.successCount} successes, ${summary.failureCount} failures (${summary.resolvedCount} resolved)`);
-  lines.push("State: .omp/noesis/state.json");
+  lines.push("");
 
   return { contextLines: lines, preserveData: { noesis: stripTransientState(state) } };

[NoCoverage] BlockStatement
src/rendering/survivor-builder.ts:43:73
   if (value) target.push(value);
 }
 
-function pushLines(target: string[], section: string | undefined): void {
-  if (!section) return;
-  target.push(section);
-}
+function pushLines(target: string[], section: string | undefined): void {}
 

[NoCoverage] ConditionalExpression
src/rendering/survivor-builder.ts:44:7
 }
 
 function pushLines(target: string[], section: string | undefined): void {
-  if (!section) return;
+  if (false) return;
   target.push(section);
 }

[NoCoverage] BooleanLiteral
src/rendering/survivor-builder.ts:44:7
 }
 
 function pushLines(target: string[], section: string | undefined): void {
-  if (!section) return;
+  if (section) return;
   target.push(section);
 }
