[Killed] BlockStatement
src/domains/learning/eviction-strategy.ts:14:20
 export function evictLearning(
   entries: LearningEntry[],
   max: number,
-): LearningEntry[] {
-  if (entries.length <= max) return entries;
-
-  // rankLearning sorts descending by score. Reverse to ascending for eviction.
-  const ranked = rankLearning(entries);
-  const ascending = ranked.reverse();
-
-  // Apply tiebreaker: among equal scores, successes before failures.
-  // With ascending sort, this means successes appear first and get evicted first.
-  ascending.sort((a, b) => {
-    const aIsFailure = a.rootCause !== undefined ? 1 : 0;
-    const bIsFailure = b.rootCause !== undefined ? 1 : 0;
-    return aIsFailure - bIsFailure;
-  });
-
-  // Keep the highest-scored entries (end of ascending-sorted array).
-  return ascending.slice(-max);
-}
+): LearningEntry[] {}
 
killedBy: eviction ordering properties 100 random entry sets → eviction keeps exactly maxEntries
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/domains/learning/eviction-strategy.ts:15:7
   entries: LearningEntry[],
   max: number,
 ): LearningEntry[] {
-  if (entries.length <= max) return entries;
+  if (true) return entries;
 
   // rankLearning sorts descending by score. Reverse to ascending for eviction.
killedBy: eviction ordering properties 100 random entry sets → eviction keeps exactly maxEntries
statusReason: expected 28 to be 6 // Object.is equality

[Killed] EqualityOperator
src/domains/learning/eviction-strategy.ts:15:7
   entries: LearningEntry[],
   max: number,
 ): LearningEntry[] {
-  if (entries.length <= max) return entries;
+  if (entries.length > max) return entries;
 
   // rankLearning sorts descending by score. Reverse to ascending for eviction.
killedBy: eviction ordering properties 100 random entry sets → eviction keeps exactly maxEntries
statusReason: expected 28 to be 6 // Object.is equality

[Survived] MethodExpression
src/domains/learning/eviction-strategy.ts:19:21
 
   // rankLearning sorts descending by score. Reverse to ascending for eviction.
   const ranked = rankLearning(entries);
-  const ascending = ranked.reverse();
+  const ascending = ranked;
 
   // Apply tiebreaker: among equal scores, successes before failures.

[Survived] BlockStatement
src/domains/learning/eviction-strategy.ts:23:28
 
   // Apply tiebreaker: among equal scores, successes before failures.
   // With ascending sort, this means successes appear first and get evicted first.
-  ascending.sort((a, b) => {
-    const aIsFailure = a.rootCause !== undefined ? 1 : 0;
-    const bIsFailure = b.rootCause !== undefined ? 1 : 0;
-    return aIsFailure - bIsFailure;
-  });
+  ascending.sort((a, b) => {});
 
   // Keep the highest-scored entries (end of ascending-sorted array).

[Survived] MethodExpression
src/domains/learning/eviction-strategy.ts:23:3
 
   // Apply tiebreaker: among equal scores, successes before failures.
   // With ascending sort, this means successes appear first and get evicted first.
-  ascending.sort((a, b) => {
-    const aIsFailure = a.rootCause !== undefined ? 1 : 0;
-    const bIsFailure = b.rootCause !== undefined ? 1 : 0;
-    return aIsFailure - bIsFailure;
-  });
+  ascending;
 
   // Keep the highest-scored entries (end of ascending-sorted array).

[Survived] ConditionalExpression
src/domains/learning/eviction-strategy.ts:24:24
   // Apply tiebreaker: among equal scores, successes before failures.
   // With ascending sort, this means successes appear first and get evicted first.
   ascending.sort((a, b) => {
-    const aIsFailure = a.rootCause !== undefined ? 1 : 0;
+    const aIsFailure = true ? 1 : 0;
     const bIsFailure = b.rootCause !== undefined ? 1 : 0;
     return aIsFailure - bIsFailure;

[Survived] EqualityOperator
src/domains/learning/eviction-strategy.ts:24:24
   // Apply tiebreaker: among equal scores, successes before failures.
   // With ascending sort, this means successes appear first and get evicted first.
   ascending.sort((a, b) => {
-    const aIsFailure = a.rootCause !== undefined ? 1 : 0;
+    const aIsFailure = a.rootCause === undefined ? 1 : 0;
     const bIsFailure = b.rootCause !== undefined ? 1 : 0;
     return aIsFailure - bIsFailure;

[Survived] EqualityOperator
src/domains/learning/eviction-strategy.ts:25:24
   // With ascending sort, this means successes appear first and get evicted first.
   ascending.sort((a, b) => {
     const aIsFailure = a.rootCause !== undefined ? 1 : 0;
-    const bIsFailure = b.rootCause !== undefined ? 1 : 0;
+    const bIsFailure = b.rootCause === undefined ? 1 : 0;
     return aIsFailure - bIsFailure;
   });

[Survived] ConditionalExpression
src/domains/learning/eviction-strategy.ts:25:24
   // With ascending sort, this means successes appear first and get evicted first.
   ascending.sort((a, b) => {
     const aIsFailure = a.rootCause !== undefined ? 1 : 0;
-    const bIsFailure = b.rootCause !== undefined ? 1 : 0;
+    const bIsFailure = true ? 1 : 0;
     return aIsFailure - bIsFailure;
   });

[Survived] ArithmeticOperator
src/domains/learning/eviction-strategy.ts:26:12
   ascending.sort((a, b) => {
     const aIsFailure = a.rootCause !== undefined ? 1 : 0;
     const bIsFailure = b.rootCause !== undefined ? 1 : 0;
-    return aIsFailure - bIsFailure;
+    return aIsFailure + bIsFailure;
   });
 

[Killed] UnaryOperator
src/domains/learning/eviction-strategy.ts:30:26
   });
 
   // Keep the highest-scored entries (end of ascending-sorted array).
-  return ascending.slice(-max);
+  return ascending.slice(+max);
 }
 
killedBy: eviction ordering properties 100 random entry sets → eviction keeps exactly maxEntries
statusReason: expected 22 to be 6 // Object.is equality

[Killed] MethodExpression
src/domains/learning/eviction-strategy.ts:30:10
   });
 
   // Keep the highest-scored entries (end of ascending-sorted array).
-  return ascending.slice(-max);
+  return ascending;
 }
 
killedBy: eviction ordering properties 100 random entry sets → eviction keeps exactly maxEntries
statusReason: expected 28 to be 6 // Object.is equality
