[Survived] ConditionalExpression
src/domains/learning/ranking-strategy.ts:26:9
     const recency = Math.max(1.0 - ageHours / 168, 0.1); // 1 week = 168 hours
 
     let relevance: number;
-    if (entry.skillScope === currentSkillScope) {
+    if (true) {
       relevance = 1.0;
     } else if (entry.skillScope !== undefined) {
