[Killed] BooleanLiteral
src/infrastructure/graphify-client.ts:34:9
     }
 
     const graphPath = join(this.root, "graphify-out", "graph.json");
-    if (!existsSync(graphPath)) {
+    if (existsSync(graphPath)) {
       return (this._capability = "NO_GRAPH");
     }
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected 'NO_GRAPH' to be 'FULL' // Object.is equality

[Killed] EqualityOperator
src/infrastructure/graphify-client.ts:39:32
     }
 
     const graphMtime = statSync(graphPath).mtimeMs;
-    return (this._capability = graphMtime < this.getNewestSourceMtime() ? "STALE" : "FULL");
+    return (this._capability = graphMtime >= this.getNewestSourceMtime() ? "STALE" : "FULL");
   }
 
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected 'STALE' to be 'FULL' // Object.is equality

[Killed] BooleanLiteral
src/infrastructure/graphify-client.ts:82:11
   private getNewestSourceMtime(): number {
     let newest = 0;
     for (const dir of [this.root, join(this.root, "src")]) {
-      if (!existsSync(dir)) continue;
+      if (existsSync(dir)) continue;
       for (const entry of readdirSync(dir)) {
         if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: ENOENT: no such file or directory, scandir '/var/folders/0_/jb97vw8x5vg1vff86bb1fvnm0000gn/T/graphify-async-test-mUt7Je/src'

[Killed] ConditionalExpression
src/infrastructure/graphify-client.ts:84:13
     for (const dir of [this.root, join(this.root, "src")]) {
       if (!existsSync(dir)) continue;
       for (const entry of readdirSync(dir)) {
-        if (!entry.endsWith(".ts") && !entry.endsWith(".js") && !entry.endsWith(".json")) continue;
+        if (false) continue;
         try {
           const mtime = statSync(join(dir, entry)).mtimeMs;
killedBy: GraphifyClient async operations staleRecover awaits updateGraph and refreshes capability
statusReason: expected 'STALE' to be 'FULL' // Object.is equality
