[Killed] ArrowFunction
src/rendering/section-formatters.ts:7:30
 export function formatWorkSection(goal: string, steps: WorkflowStep[]): string | undefined {
   if (!goal && steps.length === 0) return undefined;
 
-  const current = steps.find((s) => s.status === "active") ?? steps.find((s) => s.status === "pending");
+  const current = steps.find(() => undefined) ?? steps.find((s) => s.status === "pending");
   const next = current ? steps[steps.indexOf(current) + 1] : undefined;
 
killedBy: rendering and consistency contracts section formatters format active entities and omit empty sections
statusReason: expected '[Work] goal' to be '[Work] goal | Step: step' // Object.is equality

[Killed] ConditionalExpression
src/rendering/section-formatters.ts:17:42
 }
 
 export function formatDecisionsSection(decisions: BeliefDecision[], includeRationale: boolean): string | undefined {
-  const active = decisions.filter((d) => d.status === "active").slice(0, 5);
+  const active = decisions.filter((d) => false).slice(0, 5);
   if (active.length === 0) return undefined;
   const lines = active.map((d) => {
killedBy: rendering and consistency contracts section formatters format active entities and omit empty sections
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
src/rendering/section-formatters.ts:48:17
   const top = entries.slice(0, 3);
   if (top.length === 0) return undefined;
   const lines = top.map((l) => {
-    const tag = l.rootCause !== undefined ? "FAIL" : "PASS";
+    const tag = l.rootCause === undefined ? "FAIL" : "PASS";
     const fixPart = includeFix && l.fix ? ` — fix: ${truncate(l.fix, 80)}` : "";
     return `[${tag}] ${truncate(l.description, 100)}${fixPart}`;
killedBy: rendering and consistency contracts section formatters format active entities and omit empty sections
statusReason: expected '[Learning]\n[PASS] learning — fix: fix' to contain 'FAIL'

[Killed] ConditionalExpression
src/rendering/section-formatters.ts:56:7
 }
 
 export function formatGraphSection(findings: GraphFinding[]): string | undefined {
-  if (findings.length === 0) return undefined;
+  if (false) return undefined;
   const lines = findings.slice(0, 5).map((f) => `- ${f.nodeName}: ${truncate(f.rawSnippet, 120)}`);
   return `[Graph]\n${lines.join("\n")}`;
killedBy: rendering and consistency contracts section formatters format active entities and omit empty sections
statusReason: expected '[Graph]\n' to be undefined
