[Killed] ConditionalExpression
src/domains/commitment/consistency-strategy.ts:7:7
   const warnings: string[] = [];
   const { workflow } = state.commitment;
 
-  if (workflow.status === "done") {
+  if (false) {
     for (const step of workflow.steps) {
       if (step.status === "active") {
killedBy: rendering and consistency contracts checkConsistency warns when done workflow still has active steps
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/domains/commitment/consistency-strategy.ts:18:50
   }
 
   if (workflow.status === "active") {
-    const hasActive = workflow.steps.some((s) => s.status === "active");
+    const hasActive = workflow.steps.some((s) => true);
     if (!hasActive) {
       warnings.push("Workflow active but no active step");
killedBy: rendering and consistency contracts checkConsistency warns when active workflow has no active step
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] EqualityOperator
src/domains/commitment/consistency-strategy.ts:18:50
   }
 
   if (workflow.status === "active") {
-    const hasActive = workflow.steps.some((s) => s.status === "active");
+    const hasActive = workflow.steps.some((s) => s.status !== "active");
     if (!hasActive) {
       warnings.push("Workflow active but no active step");
killedBy: rendering and consistency contracts checkConsistency warns when active workflow has no active step
statusReason: expected [] to deeply equal [ Array(1) ]
