[Killed] ConditionalExpression
src/domains/learning/eviction-strategy.ts:25:24
   // With ascending sort, this means successes appear first and get evicted first.
   ascending.sort((a, b) => {
     const aIsFailure = a.rootCause !== undefined ? 1 : 0;
-    const bIsFailure = b.rootCause !== undefined ? 1 : 0;
+    const bIsFailure = false ? 1 : 0;
     return aIsFailure - bIsFailure;
   });
killedBy: eviction ordering properties eviction keeps the highest scored entries
statusReason: expected 'new-relevant' to be 'old-resolved' // Object.is equality
