[Killed] EqualityOperator
src/rendering/focus-resolver.ts:4:24
 import type { NoesisState } from "../schema.js";
 
 export function resolveFocus(state: NoesisState, explicitFocus?: string): string {
-  if (explicitFocus && explicitFocus.trim().length > 0) {
+  if (explicitFocus && explicitFocus.trim().length <= 0) {
     return explicitFocus.trim();
   }
killedBy: rendering and consistency contracts resolveFocus prefers explicit focus, then workflow goal, then attention focus
statusReason: expected 'workflow focus' to be 'explicit focus' // Object.is equality

[Killed] ConditionalExpression
src/rendering/focus-resolver.ts:7:7
   if (explicitFocus && explicitFocus.trim().length > 0) {
     return explicitFocus.trim();
   }
-  if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {
+  if (true) {
     return state.commitment.workflow.goal.trim();
   }
killedBy: rendering and consistency contracts resolveFocus prefers explicit focus, then workflow goal, then attention focus
statusReason: expected '' to be 'attention focus' // Object.is equality

[Killed] ConditionalExpression
src/rendering/focus-resolver.ts:10:7
   if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {
     return state.commitment.workflow.goal.trim();
   }
-  if (state.attention.focus && state.attention.focus.trim().length > 0) {
+  if (false) {
     return state.attention.focus.trim();
   }
killedBy: rendering and consistency contracts resolveFocus prefers explicit focus, then workflow goal, then attention focus
statusReason: expected 'No active focus. Use noesis_attend to…' to be 'attention focus' // Object.is equality

[Killed] ConditionalExpression
src/rendering/focus-resolver.ts:10:7
   if (state.commitment.workflow.goal && state.commitment.workflow.goal.trim().length > 0) {
     return state.commitment.workflow.goal.trim();
   }
-  if (state.attention.focus && state.attention.focus.trim().length > 0) {
+  if (true) {
     return state.attention.focus.trim();
   }
killedBy: rendering and consistency contracts resolveFocus returns default orientation when no focus source exists
statusReason: expected '' to be 'No active focus. Use noesis_attend to…' // Object.is equality
